// SPDX-License-Identifier: GPL-3.0-only

// This file was auto-generated.
// If you want to edit this, edit the .json definitions and rerun the generator script, instead.

#ifndef INVADER__TAG__HEK__CLASS__DEFINITION_HPP
#define INVADER__TAG__HEK__CLASS__DEFINITION_HPP

#include "../../hek/data_type.hpp"

namespace Invader::HEK {
    enum ActorType : TagEnum {
        ACTOR_TYPE_ELITE,
        ACTOR_TYPE_JACKAL,
        ACTOR_TYPE_GRUNT,
        ACTOR_TYPE_HUNTER,
        ACTOR_TYPE_ENGINEER,
        ACTOR_TYPE_ASSASSIN,
        ACTOR_TYPE_PLAYER,
        ACTOR_TYPE_MARINE,
        ACTOR_TYPE_CREW,
        ACTOR_TYPE_COMBAT_FORM,
        ACTOR_TYPE_INFECTION_FORM,
        ACTOR_TYPE_CARRIER_FORM,
        ACTOR_TYPE_MONITOR,
        ACTOR_TYPE_SENTINEL,
        ACTOR_TYPE_NONE,
        ACTOR_TYPE_MOUNTED_WEAPON,
        ACTOR_TYPE_ENUM_COUNT
    };
    /**
     * Get the string representation of the enum.
     * @param value value of the enum
     * @return      string representation of the enum
     */
    const char *ActorType_to_string(ActorType value);
    /**
     * Get the pretty string representation of the enum.
     * @param value value of the enum
     * @return      pretty string representation of the enum
     */
    const char *ActorType_to_string_pretty(ActorType value);
    /**
     * Get the enum value from the string.
     * @param value value of the enum as a string
     * @return      value of the enum
     */

     * @return      pretty string representation of the enum
     */
    const char *WeaponHUDInterfaceScreenEffectDefinitionDesaturationFlagsFlag_to_string_pretty(WeaponHUDInterfaceScreenEffectDefinitionDesaturationFlagsFlag value);
    /**
     * Get the enum value from the string.
     * @param value value of the enum as a string
     * @return      value of the enum
     */
    WeaponHUDInterfaceScreenEffectDefinitionDesaturationFlagsFlag WeaponHUDInterfaceScreenEffectDefinitionDesaturationFlagsFlag_from_string(const char *value);

    using WeaponHUDInterfaceFlags = std::uint16_t;
    enum WeaponHUDInterfaceFlagsFlag : std::uint16_t {
        WEAPON_HUD_INTERFACE_FLAGS_FLAG_USE_PARENT_HUD_FLASHING_PARAMETERS = static_cast<std::uint16_t>(1) << 0,
        WEAPON_HUD_INTERFACE_FLAGS_FLAG_ENUM_COUNT
    };
    /**
     * Get the string representation of the enum.
     * @param value value of the enum
     * @return      string representation of the enum
     */
    const char *WeaponHUDInterfaceFlagsFlag_to_string(WeaponHUDInterfaceFlagsFlag value);
    /**
     * Get the pretty string representation of the enum.
     * @param value value of the enum
     * @return      pretty string representation of the enum
     */
    const char *WeaponHUDInterfaceFlagsFlag_to_string_pretty(WeaponHUDInterfaceFlagsFlag value);
    /**
     * Get the enum value from the string.
     * @param value value of the enum as a string
     * @return      value of the enum
     */
    WeaponHUDInterfaceFlagsFlag WeaponHUDInterfaceFlagsFlag_from_string(const char *value);

    using WeatherParticleSystemParticleTypeFlags = std::uint32_t;
    enum WeatherParticleSystemParticleTypeFlagsFlag : std::uint32_t {
        WEATHER_PARTICLE_SYSTEM_PARTICLE_TYPE_FLAGS_FLAG_INTERPOLATE_COLORS_IN_HSV = static_cast<std::uint32_t>(1) << 0,
        WEATHER_PARTICLE_SYSTEM_PARTICLE_TYPE_FLAGS_FLAG_ALONG_LONG_HUE_PATH = static_cast<std::uint32_t>(1) << 1,
        WEATHER_PARTICLE_SYSTEM_PARTICLE_TYPE_FLAGS_FLAG_RANDOM_ROTATION = static_cast<std::uint32_t>(1) << 2,
        WEATHER_PARTICLE_SYSTEM_PARTICLE_TYPE_FLAGS_FLAG_ENUM_COUNT
    };
    /**
     * Get the string representation of the enum.
     * @param value value of the enum
     * @return      string representation of the enum
     */
    const char *WeatherParticleSystemParticleTypeFlagsFlag_to_string(WeatherParticleSystemParticleTypeFlagsFlag value);
    /**
     * Get the pretty string representation of the enum.
     * @param value value of the enum
     * @return      pretty string representation of the enum
     */
    const char *WeatherParticleSystemParticleTypeFlagsFlag_to_string_pretty(WeatherParticleSystemParticleTypeFlagsFlag value);
    /**
     * Get the enum value from the string.
     * @param value value of the enum as a string
     * @return      value of the enum
     */
    WeatherParticleSystemParticleTypeFlagsFlag WeatherParticleSystemParticleTypeFlagsFlag_from_string(const char *value);

    ENDIAN_TEMPLATE(EndianType) struct Actor {
        EndianType<ActorFlags> flags;
        EndianType<ActorMoreFlags> more_flags;
        PAD(0xC);
        EndianType<ActorType> type;
        PAD(0x2);
        EndianType<float> max_vision_distance;
        EndianType<Angle> central_vision_angle;
        EndianType<Angle> max_vision_angle;
        PAD(0x4);
        EndianType<Angle> peripheral_vision_angle;
        EndianType<float> peripheral_distance;
        PAD(0x4);
        Vector3D<EndianType> standing_gun_offset;
        Vector3D<EndianType> crouching_gun_offset;
        EndianType<float> hearing_distance;
        EndianType<float> notice_projectile_chance;
        EndianType<float> notice_vehicle_chance;
        PAD(0x8);
        EndianType<float> combat_perception_time;
        EndianType<float> guard_perception_time;
        EndianType<float> non_combat_perception_time;
        LittleEndian<float> inverse_combat_perception_time;
        LittleEndian<float> inverse_guard_perception_time;
        LittleEndian<float> inverse_non_combat_perception_time;
        PAD(0x8);
        EndianType<float> dive_into_cover_chance;
        EndianType<float> emerge_from_cover_chance;
        EndianType<float> dive_from_grenade_chance;
        EndianType<float> pathfinding_radius;
        EndianType<float> glass_ignorance_chance;
        EndianType<float> stationary_movement_dist;
        EndianType<float> free_flying_sidestep;
        EndianType<Angle> begin_moving_angle;
        LittleEndian<float> cosine_begin_moving_angle;
        Euler2D<EndianType> maximum_aiming_deviation;
        Euler2D<EndianType> maximum_looking_deviation;
        EndianType<Angle> noncombat_look_delta_l;
        EndianType<Angle> noncombat_look_delta_r;
        EndianType<Angle> combat_look_delta_l;
        EndianType<Angle> combat_look_delta_r;
        Euler2D<EndianType> idle_aiming_range;
        Euler2D<EndianType> idle_looking_range;
        Bounds<EndianType<float>> event_look_time_modifier;
        Bounds<EndianType<float>> noncombat_idle_facing;
        Bounds<EndianType<float>> noncombat_idle_aiming;
        Bounds<EndianType<float>> noncombat_idle_looking;
        Bounds<EndianType<float>> guard_idle_facing;
        Bounds<EndianType<float>> guard_idle_aiming;
        Bounds<EndianType<float>> guard_idle_looking;
        Bounds<EndianType<float>> combat_idle_facing;
        Bounds<EndianType<float>> combat_idle_aiming;
        Bounds<EndianType<float>> combat_idle_looking;
        PAD(0x8);
        Euler2D<LittleEndian> cosine_maximum_aiming_deviation;
        Euler2D<LittleEndian> cosine_maximum_looking_deviation;
        TagDependency<EndianType> do_not_use;
        PAD(0x10C);
        TagDependency<EndianType> do_not_use_1;
        EndianType<ActorUnreachableDangerTrigger> unreachable_danger_trigger;
        EndianType<ActorUnreachableDangerTrigger> vehicle_danger_trigger;
        EndianType<ActorUnreachableDangerTrigger> player_danger_trigger;
        PAD(0x2);
        Bounds<EndianType<float>> danger_trigger_time;
        EndianType<std::int16_t> friends_killed_trigger;
        EndianType<std::int16_t> friends_retreating_trigger;
        PAD(0xC);
        Bounds<EndianType<float>> retreat_time;
        PAD(0x8);
        Bounds<EndianType<float>> cowering_time;
        EndianType<float> friend_killed_panic_chance;
        EndianType<ActorType> leader_type;
        PAD(0x2);
        EndianType<float> leader_killed_panic_chance;
        EndianType<float> panic_damage_threshold;
        EndianType<float> surprise_distance;
        PAD(0x1C);
        Bounds<EndianType<float>> hide_behind_cover_time;
        EndianType<float> hide_target_not_visible_time;
        EndianType<float> hide_shield_fraction;
        EndianType<float> attack_shield_fraction;
        EndianType<float> pursue_shield_fraction;
        PAD(0x10);
        EndianType<ActorDefensiveCrouchType> defensive_crouch_type;
        PAD(0x2);
        EndianType<float> attacking_crouch_threshold;
        EndianType<float> defending_crouch_threshold;
        EndianType<float> min_stand_time;
        EndianType<float> min_crouch_time;
        EndianType<float> defending_hide_time_modifier;
        EndianType<float> attacking_evasion_threshold;
        EndianType<float> defending_evasion_threshold;
        EndianType<float> evasion_seek_cover_chance;
        EndianType<float> evasion_delay_time;
        EndianType<float> max_seek_cover_distance;
        EndianType<float> cover_damage_threshold;
        EndianType<float> stalking_discovery_time;
        EndianType<float> stalking_max_distance;
        EndianType<Angle> stationary_facing_angle;
        EndianType<float> change_facing_stand_time;
        PAD(0x4);
        Bounds<EndianType<float>> uncover_delay_time;
        Bounds<EndianType<float>> target_search_time;
        Bounds<EndianType<float>> pursuit_position_time;
        EndianType<std::uint16_t> num_positions_coord;
        EndianType<std::uint16_t> num_positions_normal;
        PAD(0x20);
        EndianType<float> melee_attack_delay;
        EndianType<float> melee_fudge_factor;
        EndianType<float> melee_charge_time;
        Bounds<EndianType<float>> melee_leap_range;
        EndianType<float> melee_leap_velocity;
        EndianType<float> melee_leap_chance;
        EndianType<float> melee_leap_ballistic;
        EndianType<float> berserk_damage_amount;
        EndianType<float> berserk_damage_threshold;
        EndianType<float> berserk_proximity;
        EndianType<float> suicide_sensing_dist;
        EndianType<float> berserk_grenade_chance;
        PAD(0xC);
        Bounds<EndianType<float>> guard_position_time;
        Bounds<EndianType<float>> combat_position_time;
        EndianType<float> old_position_avoid_dist;
        EndianType<float> friend_avoid_dist;
        PAD(0x28);
        Bounds<EndianType<float>> noncombat_idle_speech_time;
        Bounds<EndianType<float>> combat_idle_speech_time;
        PAD(0x30);
        PAD(0x80);
        TagDependency<EndianType> do_not_use_2;
        PAD(0x30);
        ENDIAN_TEMPLATE(NewEndian) operator Actor<NewEndian>() const {
            Actor<NewEndian> copy = {};
            COPY_THIS(flags);
            COPY_THIS(more_flags);
            COPY_THIS(type);
            COPY_THIS(max_vision_distance);
            COPY_THIS(central_vision_angle);
            COPY_THIS(max_vision_angle);
            COPY_THIS(peripheral_vision_angle);
            COPY_THIS(peripheral_distance);
            COPY_THIS(standing_gun_offset);
            COPY_THIS(crouching_gun_offset);
            COPY_THIS(hearing_distance);
            COPY_THIS(notice_projectile_chance);
            COPY_THIS(notice_vehicle_chance);
            COPY_THIS(combat_perception_time);
            COPY_THIS(guard_perception_time);
            COPY_THIS(non_combat_perception_time);
            COPY_THIS(inverse_combat_perception_time);
            COPY_THIS(inverse_guard_perception_time);
            COPY_THIS(inverse_non_combat_perception_time);
            COPY_THIS(dive_into_cover_chance);
            COPY_THIS(emerge_from_cover_chance);
            COPY_THIS(dive_from_grenade_chance);
            COPY_THIS(pathfinding_radius);
            COPY_THIS(glass_ignorance_chance);
            COPY_THIS(stationary_movement_dist);
            COPY_THIS(free_flying_sidestep);
            COPY_THIS(begin_moving_angle);
            COPY_THIS(cosine_begin_moving_angle);
            COPY_THIS(maximum_aiming_deviation);
            COPY_THIS(maximum_looking_deviation);
            COPY_THIS(noncombat_look_delta_l);
            COPY_THIS(noncombat_look_delta_r);
            COPY_THIS(combat_look_delta_l);
            COPY_THIS(combat_look_delta_r);
            COPY_THIS(idle_aiming_range);
            COPY_THIS(idle_looking_range);
            COPY_THIS(event_look_time_modifier);
            COPY_THIS(noncombat_idle_facing);
            COPY_THIS(noncombat_idle_aiming);
            COPY_THIS(noncombat_idle_looking);
            COPY_THIS(guard_idle_facing);
            COPY_THIS(guard_idle_aiming);
            COPY_THIS(guard_idle_looking);
            COPY_THIS(combat_idle_facing);
            COPY_THIS(combat_idle_aiming);
            COPY_THIS(combat_idle_looking);
            COPY_THIS(cosine_maximum_aiming_deviation);
            COPY_THIS(cosine_maximum_looking_deviation);
            COPY_THIS(do_not_use);
            COPY_THIS(do_not_use_1);
            COPY_THIS(unreachable_danger_trigger);
            COPY_THIS(vehicle_danger_trigger);
            COPY_THIS(player_danger_trigger);
            COPY_THIS(danger_trigger_time);
            COPY_THIS(friends_killed_trigger);
            COPY_THIS(friends_retreating_trigger);
            COPY_THIS(retreat_time);
            COPY_THIS(cowering_time);
            COPY_THIS(friend_killed_panic_chance);
            COPY_THIS(leader_type);
            COPY_THIS(leader_killed_panic_chance);
            COPY_THIS(panic_damage_threshold);
            COPY_THIS(surprise_distance);
            COPY_THIS(hide_behind_cover_time);
            COPY_THIS(hide_target_not_visible_time);
            COPY_THIS(hide_shield_fraction);
            COPY_THIS(attack_shield_fraction);
            COPY_THIS(pursue_shield_fraction);
            COPY_THIS(defensive_crouch_type);
            COPY_THIS(attacking_crouch_threshold);
            COPY_THIS(defending_crouch_threshold);
            COPY_THIS(min_stand_time);
            COPY_THIS(min_crouch_time);
            COPY_THIS(defending_hide_time_modifier);
            COPY_THIS(attacking_evasion_threshold);
            COPY_THIS(defending_evasion_threshold);
            COPY_THIS(evasion_seek_cover_chance);
            COPY_THIS(evasion_delay_time);
            COPY_THIS(max_seek_cover_distance);
            COPY_THIS(cover_damage_threshold);
            COPY_THIS(stalking_discovery_time);
            COPY_THIS(stalking_max_distance);
            COPY_THIS(stationary_facing_angle);
            COPY_THIS(change_facing_stand_time);
            COPY_THIS(uncover_delay_time);
            COPY_THIS(target_search_time);
            COPY_THIS(pursuit_position_time);
            COPY_THIS(num_positions_coord);
            COPY_THIS(num_positions_normal);
            COPY_THIS(melee_attack_delay);
            COPY_THIS(melee_fudge_factor);
            COPY_THIS(melee_charge_time);
            COPY_THIS(melee_leap_range);
            COPY_THIS(melee_leap_velocity);
            COPY_THIS(melee_leap_chance);
            COPY_THIS(melee_leap_ballistic);
            COPY_THIS(berserk_damage_amount);
            COPY_THIS(berserk_damage_threshold);
            COPY_THIS(berserk_proximity);
            COPY_THIS(suicide_sensing_dist);
            COPY_THIS(berserk_grenade_chance);
            COPY_THIS(guard_position_time);
            COPY_THIS(combat_position_time);
            COPY_THIS(old_position_avoid_dist);
            COPY_THIS(friend_avoid_dist);
            COPY_THIS(noncombat_idle_speech_time);
            COPY_THIS(combat_idle_speech_time);
            COPY_THIS(do_not_use_2);
            return copy;
        }
    };
    static_assert(sizeof(Actor<NativeEndian>) == 0x4F8);

    ENDIAN_TEMPLATE(EndianType) struct ActorVariantChangeColors {
        ColorRGB<EndianType> color_lower_bound;
        ColorRGB<EndianType> color_upper_bound;
        PAD(0x8);
        ENDIAN_TEMPLATE(NewEndian) operator ActorVariantChangeColors<NewEndian>() const {
            ActorVariantChangeColors<NewEndian> copy = {};
            COPY_THIS(color_lower_bound);
            COPY_THIS(color_upper_bound);
            return copy;
        }
    };
    static_assert(sizeof(ActorVariantChangeColors<NativeEndian>) == 0x20);

    ENDIAN_TEMPLATE(EndianType) struct ActorVariant {
        EndianType<ActorVariantFlags> flags;
        TagDependency<EndianType> actor_definition;
        TagDependency<EndianType> unit;
        TagDependency<EndianType> major_variant;
        EndianType<MetagameType> metagame_type;
        EndianType<MetagameClass> metagame_class;
        PAD(0x14);
        EndianType<ActorVariantMovementType> movement_type;
        PAD(0x2);
        EndianType<float> initial_crouch_chance;
        Bounds<EndianType<float>> crouch_time;
        Bounds<EndianType<float>> run_time;
        TagDependency<EndianType> weapon;
        EndianType<float> maximum_firing_distance;
        EndianType<float> rate_of_fire;
        EndianType<Angle> projectile_error;
        Bounds<EndianType<float>> first_burst_delay_time;
        EndianType<float> new_target_firing_pattern_time;
        EndianType<float> surprise_delay_time;
        EndianType<float> surprise_fire_wildly_time;
        EndianType<float> death_fire_wildly_chance;
        EndianType<float> death_fire_wildly_time;
        Bounds<EndianType<float>> desired_combat_range;
        Vector3D<EndianType> custom_stand_gun_offset;
        Vector3D<EndianType> custom_crouch_gun_offset;
        EndianType<float> target_tracking;
        EndianType<float> target_leading;
        EndianType<float> weapon_damage_modifier;
        EndianType<float> damage_per_second;
        EndianType<float> burst_origin_radius;
        EndianType<Angle> burst_origin_angle;
        Bounds<EndianType<float>> burst_return_length;
        EndianType<Angle> burst_return_angle;
        Bounds<EndianType<float>> burst_duration;
        Bounds<EndianType<float>> burst_separation;
        EndianType<Angle> burst_angular_velocity;
        PAD(0x4);
        EndianType<float> special_damage_modifier;
        EndianType<Angle> special_projectile_error;
        EndianType<float> new_target_burst_duration;
        EndianType<float> new_target_burst_separation;
        EndianType<float> new_target_rate_of_fire;
        EndianType<float> new_target_projectile_error;
        PAD(0x8);
        EndianType<float> moving_burst_duration;
        EndianType<float> moving_burst_separation;
        EndianType<float> moving_rate_of_fire;
        EndianType<float> moving_projectile_error;
        PAD(0x8);
        EndianType<float> berserk_burst_duration;
        EndianType<float> berserk_burst_separation;
        EndianType<float> berserk_rate_of_fire;
        EndianType<float> berserk_projectile_error;
        PAD(0x8);
        EndianType<float> super_ballistic_range;
        EndianType<float> bombardment_range;
        EndianType<float> modified_vision_range;
        EndianType<ActorVariantSpecialFireMode> special_fire_mode;
        EndianType<ActorVariantSpecialFireSituation> special_fire_situation;
        EndianType<float> special_fire_chance;
        EndianType<float> special_fire_delay;
        EndianType<float> melee_range;
        EndianType<float> melee_abort_range;
        Bounds<EndianType<float>> berserk_firing_ranges;
        EndianType<float> berserk_melee_range;
        EndianType<float> berserk_melee_abort_range;
        PAD(0x8);
        EndianType<GrenadeType> grenade_type;
        EndianType<ActorVariantTrajectoryType> trajectory_type;
        EndianType<ActorVariantGrenadeStimulus> grenade_stimulus;
        EndianType<std::int16_t> minimum_enemy_count;
        EndianType<float> enemy_radius;
        PAD(0x4);
        EndianType<float> grenade_velocity;
        Bounds<EndianType<float>> grenade_ranges;
        EndianType<float> collateral_damage_radius;
        EndianType<Fraction> grenade_chance;
        EndianType<float> grenade_check_time;
        EndianType<float> encounter_grenade_timeout;
        PAD(0x14);
        TagDependency<EndianType> equipment;
        Bounds<EndianType<std::int16_t>> grenade_count;
        EndianType<float> dont_drop_grenades_chance;
        Bounds<EndianType<float>> drop_weapon_loaded;
        Bounds<EndianType<std::int16_t>> drop_weapon_ammo;
        PAD(0xC);
        PAD(0x10);
        EndianType<float> body_vitality;
        EndianType<float> shield_vitality;
        EndianType<float> shield_sapping_radius;
        EndianType<Index> forced_shader_permutation;
        PAD(0x2);
        PAD(0x10);
        PAD(0xC);
        TagReflexive<EndianType, ActorVariantChangeColors> change_colors;
        ENDIAN_TEMPLATE(NewEndian) operator ActorVariant<NewEndian>() const {
            ActorVariant<NewEndian> copy = {};
            COPY_THIS(flags);
            COPY_THIS(actor_definition);
            COPY_THIS(unit);
            COPY_THIS(major_variant);
            COPY_THIS(metagame_type);
            COPY_THIS(metagame_class);
            COPY_THIS(movement_type);
            COPY_THIS(initial_crouch_chance);
            COPY_THIS(crouch_time);
            COPY_THIS(run_time);
            COPY_THIS(weapon);
            COPY_THIS(maximum_firing_distance);
            COPY_THIS(rate_of_fire);
            COPY_THIS(projectile_error);
            COPY_THIS(first_burst_delay_time);
            COPY_THIS(new_target_firing_pattern_time);
            COPY_THIS(surprise_delay_time);
            COPY_THIS(surprise_fire_wildly_time);
            COPY_THIS(death_fire_wildly_chance);
            COPY_THIS(death_fire_wildly_time);
            COPY_THIS(desired_combat_range);
            COPY_THIS(custom_stand_gun_offset);
            COPY_THIS(custom_crouch_gun_offset);
            COPY_THIS(target_tracking);
            COPY_THIS(target_leading);
            COPY_THIS(weapon_damage_modifier);
            COPY_THIS(damage_per_second);
            COPY_THIS(burst_origin_radius);
            COPY_THIS(burst_origin_angle);
            COPY_THIS(burst_return_length);
            COPY_THIS(burst_return_angle);
            COPY_THIS(burst_duration);
            COPY_THIS(burst_separation);
            COPY_THIS(burst_angular_velocity);
            COPY_THIS(special_damage_modifier);
            COPY_THIS(special_projectile_error);
            COPY_THIS(new_target_burst_duration);
            COPY_THIS(new_target_burst_separation);
            COPY_THIS(new_target_rate_of_fire);
            COPY_THIS(new_target_projectile_error);
            COPY_THIS(moving_burst_duration);
            COPY_THIS(moving_burst_separation);
            COPY_THIS(moving_rate_of_fire);
            COPY_THIS(moving_projectile_error);
            COPY_THIS(berserk_burst_duration);
            COPY_THIS(berserk_burst_separation);
            COPY_THIS(berserk_rate_of_fire);
            COPY_THIS(berserk_projectile_error);
            COPY_THIS(super_ballistic_range);
            COPY_THIS(bombardment_range);
            COPY_THIS(modified_vision_range);
            COPY_THIS(special_fire_mode);
            COPY_THIS(special_fire_situation);
            COPY_THIS(special_fire_chance);
            COPY_THIS(special_fire_delay);
            COPY_THIS(melee_range);
            COPY_THIS(melee_abort_range);
            COPY_THIS(berserk_firing_ranges);
            COPY_THIS(berserk_melee_range);
            COPY_THIS(berserk_melee_abort_range);
            COPY_THIS(grenade_type);
            COPY_THIS(trajectory_type);
            COPY_THIS(grenade_stimulus);
            COPY_THIS(minimum_enemy_count);
            COPY_THIS(enemy_radius);
            COPY_THIS(grenade_velocity);
            COPY_THIS(grenade_ranges);
            COPY_THIS(collateral_damage_radius);
            COPY_THIS(grenade_chance);
            COPY_THIS(grenade_check_time);
            COPY_THIS(encounter_grenade_timeout);
            COPY_THIS(equipment);
            COPY_THIS(grenade_count);
            COPY_THIS(dont_drop_grenades_chance);
            COPY_THIS(drop_weapon_loaded);
            COPY_THIS(drop_weapon_ammo);
            COPY_THIS(body_vitality);
            COPY_THIS(shield_vitality);
            COPY_THIS(shield_sapping_radius);
            COPY_THIS(forced_shader_permutation);
            COPY_THIS(change_colors);
            return copy;
        }
    };
    static_assert(sizeof(ActorVariant<NativeEndian>) == 0x238);

    ENDIAN_TEMPLATE(EndianType) struct AntennaVertex {
        EndianType<Fraction> spring_strength_coefficient;
        PAD(0x18);
        Euler2D<EndianType> angles;
        EndianType<float> length;
        EndianType<Index> sequence_index;
        PAD(0x2);
        ColorARGB<EndianType> color;
        ColorARGB<EndianType> lod_color;
        PAD(0x28);
        Point3D<LittleEndian> offset;
        ENDIAN_TEMPLATE(NewEndian) operator AntennaVertex<NewEndian>() const {
            AntennaVertex<NewEndian> copy = {};
            COPY_THIS(spring_strength_coefficient);
            COPY_THIS(angles);
            COPY_THIS(length);
            COPY_THIS(sequence_index);
            COPY_THIS(color);
            COPY_THIS(lod_color);
            COPY_THIS(offset);
            return copy;
        }
    };
    static_assert(sizeof(AntennaVertex<NativeEndian>) == 0x80);

    ENDIAN_TEMPLATE(EndianType) struct Antenna {
        TagString attachment_marker_name;
        TagDependency<EndianType> bitmaps;
        TagDependency<EndianType> physics;
        PAD(0x50);
        EndianType<Fraction> spring_strength_coefficient;
        EndianType<float> falloff_pixels;
        EndianType<float> cutoff_pixels;
        EndianType<float> length;
        PAD(0x24);
        TagReflexive<EndianType, AntennaVertex> vertices;
        ENDIAN_TEMPLATE(NewEndian) operator Antenna<NewEndian>() const {
            Antenna<NewEndian> copy = {};
            COPY_THIS(attachment_marker_name);
            COPY_THIS(bitmaps);
            COPY_THIS(physics);
            COPY_THIS(spring_strength_coefficient);
            COPY_THIS(falloff_pixels);
            COPY_THIS(cutoff_pixels);
            COPY_THIS(length);
            COPY_THIS(vertices);
            return copy;
        }
    };
    static_assert(sizeof(Antenna<NativeEndian>) == 0xD0);

    ENDIAN_TEMPLATE(EndianType) struct BipedContactPoint {
        PAD(0x20);
        TagString marker_name;
        ENDIAN_TEMPLATE(NewEndian) operator BipedContactPoint<NewEndian>() const {
            BipedContactPoint<NewEndian> copy = {};
            COPY_THIS(marker_name);
            return copy;
        }
    };
    static_assert(sizeof(BipedContactPoint<NativeEndian>) == 0x40);

    ENDIAN_TEMPLATE(EndianType) struct ObjectAttachment {
        TagDependency<EndianType> type;
        TagString marker;
        EndianType<FunctionOut> primary_scale;
        EndianType<FunctionOut> secondary_scale;
        EndianType<FunctionNameNullable> change_color;
        PAD(0x2);
        PAD(0x10);
        ENDIAN_TEMPLATE(NewEndian) operator ObjectAttachment<NewEndian>() const {
            ObjectAttachment<NewEndian> copy = {};
            COPY_THIS(type);
            COPY_THIS(marker);
            COPY_THIS(primary_scale);
            COPY_THIS(secondary_scale);
            COPY_THIS(change_color);
            return copy;
        }
    };
    static_assert(sizeof(ObjectAttachment<NativeEndian>) == 0x48);

    ENDIAN_TEMPLATE(EndianType) struct ObjectWidget {
        TagDependency<EndianType> reference;
        PAD(0x10);
        ENDIAN_TEMPLATE(NewEndian) operator ObjectWidget<NewEndian>() const {
            ObjectWidget<NewEndian> copy = {};
            COPY_THIS(reference);
            return copy;
        }
    };
    static_assert(sizeof(ObjectWidget<NativeEndian>) == 0x20);

    ENDIAN_TEMPLATE(EndianType) struct ObjectFunction {
        EndianType<ObjectFunctionFlags> flags;
        EndianType<float> period;
        EndianType<FunctionScaleBy> scale_period_by;
        EndianType<WaveFunction> function;
        EndianType<FunctionScaleBy> scale_function_by;
        EndianType<WaveFunction> wobble_function;
        EndianType<float> wobble_period;
        EndianType<float> wobble_magnitude;
        EndianType<Fraction> square_wave_threshold;
        EndianType<std::int16_t> step_count;
        EndianType<FunctionType> map_to;
        EndianType<std::int16_t> sawtooth_count;
        EndianType<FunctionScaleBy> add;
        EndianType<FunctionScaleBy> scale_result_by;
        EndianType<FunctionBoundsMode> bounds_mode;
        Bounds<EndianType<Fraction>> bounds;
        PAD(0x4);
        PAD(0x2);
        EndianType<std::int16_t> turn_off_with;
        EndianType<float> scale_by;
        PAD(0xFC);
        LittleEndian<float> inverse_bounds;
        LittleEndian<float> inverse_sawtooth;
        LittleEndian<float> inverse_step;
        LittleEndian<float> inverse_period;
        TagString usage;
        ENDIAN_TEMPLATE(NewEndian) operator ObjectFunction<NewEndian>() const {
            ObjectFunction<NewEndian> copy = {};
            COPY_THIS(flags);
            COPY_THIS(period);
            COPY_THIS(scale_period_by);
            COPY_THIS(function);
            COPY_THIS(scale_function_by);
            COPY_THIS(wobble_function);
            COPY_THIS(wobble_period);
            COPY_THIS(wobble_magnitude);
            COPY_THIS(square_wave_threshold);
            COPY_THIS(step_count);
            COPY_THIS(map_to);
            COPY_THIS(sawtooth_count);
            COPY_THIS(add);
            COPY_THIS(scale_result_by);
            COPY_THIS(bounds_mode);
            COPY_THIS(bounds);
            COPY_THIS(turn_off_with);
            COPY_THIS(scale_by);
            COPY_THIS(inverse_bounds);
            COPY_THIS(inverse_sawtooth);
            COPY_THIS(inverse_step);
            COPY_THIS(inverse_period);
            COPY_THIS(usage);
            return copy;
        }
    };
    static_assert(sizeof(ObjectFunction<NativeEndian>) == 0x168);

    ENDIAN_TEMPLATE(EndianType) struct ObjectChangeColorsPermutation {
        EndianType<float> weight;
        ColorRGB<EndianType> color_lower_bound;
        ColorRGB<EndianType> color_upper_bound;
        ENDIAN_TEMPLATE(NewEndian) operator ObjectChangeColorsPermutation<NewEndian>() const {
            ObjectChangeColorsPermutation<NewEndian> copy;
            COPY_THIS(weight);
            COPY_THIS(color_lower_bound);
            COPY_THIS(color_upper_bound);
            return copy;
        }
    };
    static_assert(sizeof(ObjectChangeColorsPermutation<NativeEndian>) == 0x1C);

    ENDIAN_TEMPLATE(EndianType) struct ObjectChangeColors {
        EndianType<FunctionScaleBy> darken_by;
        EndianType<FunctionScaleBy> scale_by;
        EndianType<ColorInterpolationFlags> flags;
        ColorRGB<EndianType> color_lower_bound;
        ColorRGB<EndianType> color_upper_bound;
        TagReflexive<EndianType, ObjectChangeColorsPermutation> permutations;
        ENDIAN_TEMPLATE(NewEndian) operator ObjectChangeColors<NewEndian>() const {
            ObjectChangeColors<NewEndian> copy;
            COPY_THIS(darken_by);
            COPY_THIS(scale_by);
            COPY_THIS(flags);
            COPY_THIS(color_lower_bound);
            COPY_THIS(color_upper_bound);
            COPY_THIS(permutations);
            return copy;
        }
    };
    static_assert(sizeof(ObjectChangeColors<NativeEndian>) == 0x2C);

    ENDIAN_TEMPLATE(EndianType) struct PredictedResource {
        EndianType<PredictedResourceType> type;
        EndianType<Index> resource_index;
        EndianType<TagID> tag;
        ENDIAN_TEMPLATE(NewEndian) operator PredictedResource<NewEndian>() const {
            PredictedResource<NewEndian> copy;
            COPY_THIS(type);
            COPY_THIS(resource_index);
            COPY_THIS(tag);
            return copy;
        }
    };
    static_assert(sizeof(PredictedResource<NativeEndian>) == 0x8);

    ENDIAN_TEMPLATE(EndianType) struct Object {
        LittleEndian<ObjectType> object_type;
        EndianType<ObjectFlags> flags;
        EndianType<float> bounding_radius;
        Point3D<EndianType> bounding_offset;
        Point3D<EndianType> origin_offset;
        EndianType<float> acceleration_scale;
        LittleEndian<std::uint32_t> scales_change_colors;
        TagDependency<EndianType> model;
        TagDependency<EndianType> animation_graph;
        PAD(0x28);
        TagDependency<EndianType> collision_model;
        TagDependency<EndianType> physics;
        TagDependency<EndianType> modifier_shader;
        TagDependency<EndianType> creation_effect;
        PAD(0x54);
        EndianType<float> render_bounding_radius;
        EndianType<ObjectFunctionIn> a_in;
        EndianType<ObjectFunctionIn> b_in;
        EndianType<ObjectFunctionIn> c_in;
        EndianType<ObjectFunctionIn> d_in;
        PAD(0x2C);
        EndianType<std::int16_t> hud_text_message_index;
        EndianType<std::int16_t> forced_shader_permutation_index;
        TagReflexive<EndianType, ObjectAttachment> attachments;
        TagReflexive<EndianType, ObjectWidget> widgets;
        TagReflexive<EndianType, ObjectFunction> functions;
        TagReflexive<EndianType, ObjectChangeColors> change_colors;
        TagReflexive<EndianType, PredictedResource> predicted_resources;
        ENDIAN_TEMPLATE(NewEndian) operator Object<NewEndian>() const {
            Object<NewEndian> copy = {};
            COPY_THIS(object_type);
            COPY_THIS(flags);
            COPY_THIS(bounding_radius);
            COPY_THIS(bounding_offset);
            COPY_THIS(origin_offset);
            COPY_THIS(acceleration_scale);
            COPY_THIS(scales_change_colors);
            COPY_THIS(model);
            COPY_THIS(animation_graph);
            COPY_THIS(collision_model);
            COPY_THIS(physics);
            COPY_THIS(modifier_shader);
            COPY_THIS(creation_effect);
            COPY_THIS(render_bounding_radius);
            COPY_THIS(a_in);
            COPY_THIS(b_in);
            COPY_THIS(c_in);
            COPY_THIS(d_in);
            COPY_THIS(hud_text_message_index);
            COPY_THIS(forced_shader_permutation_index);
            COPY_THIS(attachments);
            COPY_THIS(widgets);
            COPY_THIS(functions);
            COPY_THIS(change_colors);
            COPY_THIS(predicted_resources);
            return copy;
        }
    };
    static_assert(sizeof(Object<NativeEndian>) == 0x17C);

    ENDIAN_TEMPLATE(EndianType) struct UnitCameraTrack {
        TagDependency<EndianType> track;
        PAD(0xC);
        ENDIAN_TEMPLATE(NewEndian) operator UnitCameraTrack<NewEndian>() const {
            UnitCameraTrack<NewEndian> copy = {};
            COPY_THIS(track);
            return copy;
        }
    };
    static_assert(sizeof(UnitCameraTrack<NativeEndian>) == 0x1C);

    ENDIAN_TEMPLATE(EndianType) struct UnitUnitHudInterface {
        TagDependency<EndianType> hud;
        PAD(0x20);
        ENDIAN_TEMPLATE(NewEndian) operator UnitUnitHudInterface<NewEndian>() const {
            UnitUnitHudInterface<NewEndian> copy = {};
            COPY_THIS(hud);
            return copy;
        }
    };
    static_assert(sizeof(UnitUnitHudInterface<NativeEndian>) == 0x30);

    ENDIAN_TEMPLATE(EndianType) struct UnitDialogueVariant {
        EndianType<std::int16_t> variant_number;
        PAD(0x2);
        PAD(0x4);
        TagDependency<EndianType> dialogue;
        ENDIAN_TEMPLATE(NewEndian) operator UnitDialogueVariant<NewEndian>() const {
            UnitDialogueVariant<NewEndian> copy = {};
            COPY_THIS(variant_number);
            COPY_THIS(dialogue);
            return copy;
        }
    };
    static_assert(sizeof(UnitDialogueVariant<NativeEndian>) == 0x18);

    ENDIAN_TEMPLATE(EndianType) struct UnitPoweredSeat {
        PAD(0x4);
        EndianType<float> driver_powerup_time;
        EndianType<float> driver_powerdown_time;
        PAD(0x38);
        ENDIAN_TEMPLATE(NewEndian) operator UnitPoweredSeat<NewEndian>() const {
            UnitPoweredSeat<NewEndian> copy = {};
            COPY_THIS(driver_powerup_time);
            COPY_THIS(driver_powerdown_time);
            return copy;
        }
    };
    static_assert(sizeof(UnitPoweredSeat<NativeEndian>) == 0x44);

    ENDIAN_TEMPLATE(EndianType) struct UnitWeapon {
        TagDependency<EndianType> weapon;
        PAD(0x14);
        ENDIAN_TEMPLATE(NewEndian) operator UnitWeapon<NewEndian>() const {
            UnitWeapon<NewEndian> copy = {};
            COPY_THIS(weapon);
            return copy;
        }
    };
    static_assert(sizeof(UnitWeapon<NativeEndian>) == 0x24);

    ENDIAN_TEMPLATE(EndianType) struct UnitSeat {
        EndianType<UnitSeatFlags> flags;
        TagString label;
        TagString marker_name;
        PAD(0x20);
        Vector3D<EndianType> acceleration_scale;
        PAD(0xC);
        EndianType<float> yaw_rate;
        EndianType<float> pitch_rate;
        TagString camera_marker_name;
        TagString camera_submerged_marker_name;
        EndianType<Angle> pitch_auto_level;
        Bounds<EndianType<Angle>> pitch_range;
        TagReflexive<EndianType, UnitCameraTrack> camera_tracks;
        TagReflexive<EndianType, UnitUnitHudInterface> unit_hud_interface;
        PAD(0x4);
        EndianType<Index> hud_text_message_index;
        PAD(0x2);
        EndianType<Angle> yaw_minimum;
        EndianType<Angle> yaw_maximum;
        TagDependency<EndianType> built_in_gunner;
        PAD(0x14);
        ENDIAN_TEMPLATE(NewEndian) operator UnitSeat<NewEndian>() const {
            UnitSeat<NewEndian> copy = {};
            COPY_THIS(flags);
            COPY_THIS(label);
            COPY_THIS(marker_name);
            COPY_THIS(acceleration_scale);
            COPY_THIS(yaw_rate);
            COPY_THIS(pitch_rate);
            COPY_THIS(camera_marker_name);
            COPY_THIS(camera_submerged_marker_name);
            COPY_THIS(pitch_auto_level);
            COPY_THIS(pitch_range);
            COPY_THIS(camera_tracks);
            COPY_THIS(unit_hud_interface);
            COPY_THIS(hud_text_message_index);
            COPY_THIS(yaw_minimum);
            COPY_THIS(yaw_maximum);
            COPY_THIS(built_in_gunner);
            return copy;
        }
    };
    static_assert(sizeof(UnitSeat<NativeEndian>) == 0x11C);

    ENDIAN_TEMPLATE(EndianType) struct Unit : Object<EndianType> {
        EndianType<UnitFlags> unit_flags;
        EndianType<UnitDefaultTeam> default_team;
        EndianType<ObjectNoise> constant_sound_volume;
        EndianType<float> rider_damage_fraction;
        TagDependency<EndianType> integrated_light_toggle;
        EndianType<UnitFunctionIn> unit_a_in;
        EndianType<UnitFunctionIn> unit_b_in;
        EndianType<UnitFunctionIn> unit_c_in;
        EndianType<UnitFunctionIn> unit_d_in;
        EndianType<Angle> camera_field_of_view;
        EndianType<float> camera_stiffness;
        TagString camera_marker_name;
        TagString camera_submerged_marker_name;
        EndianType<Angle> pitch_auto_level;
        Bounds<EndianType<Angle>> pitch_range;
        TagReflexive<EndianType, UnitCameraTrack> camera_tracks;
        Point3D<EndianType> seat_acceleration_scale;
        PAD(0xC);
        EndianType<float> soft_ping_threshold;
        EndianType<float> soft_ping_interrupt_time;
        EndianType<float> hard_ping_threshold;
        EndianType<float> hard_ping_interrupt_time;
        EndianType<float> hard_death_threshold;
        EndianType<float> feign_death_threshold;
        EndianType<float> feign_death_time;
        EndianType<float> distance_of_evade_anim;
        EndianType<float> distance_of_dive_anim;
        PAD(0x4);
        EndianType<float> stunned_movement_threshold;
        EndianType<float> feign_death_chance;
        EndianType<float> feign_repeat_chance;
        TagDependency<EndianType> spawned_actor;
        Bounds<EndianType<std::int16_t>> spawned_actor_count;
        EndianType<float> spawned_velocity;
        EndianType<Angle> aiming_velocity_maximum;
        EndianType<Angle> aiming_acceleration_maximum;
        EndianType<Fraction> casual_aiming_modifier;
        EndianType<Angle> looking_velocity_maximum;
        EndianType<Angle> looking_acceleration_maximum;
        PAD(0x8);
        EndianType<float> ai_vehicle_radius;
        EndianType<float> ai_danger_radius;
        TagDependency<EndianType> melee_damage;
        EndianType<UnitMotionSensorBlipSize> motion_sensor_blip_size;
        PAD(0x2);
        EndianType<MetagameType> metagame_type;
        EndianType<MetagameClass> metagame_class;
        PAD(0x8);
        TagReflexive<EndianType, UnitUnitHudInterface> new_hud_interfaces;
        TagReflexive<EndianType, UnitDialogueVariant> dialogue_variants;
        EndianType<float> grenade_velocity;
        EndianType<GrenadeType> grenade_type;
        EndianType<std::int16_t> grenade_count;
        LittleEndian<std::int16_t> soft_ping_interrupt_ticks;
        LittleEndian<std::int16_t> hard_ping_interrupt_ticks;
        TagReflexive<EndianType, UnitPoweredSeat> powered_seats;
        TagReflexive<EndianType, UnitWeapon> weapons;
        TagReflexive<EndianType, UnitSeat> seats;
        ENDIAN_TEMPLATE(NewEndian) operator Unit<NewEndian>() const {
            Unit<NewEndian> copy = {};
            COPY_THIS(unit_flags);
            COPY_THIS(default_team);
            COPY_THIS(constant_sound_volume);
            COPY_THIS(rider_damage_fraction);
            COPY_THIS(integrated_light_toggle);
            COPY_THIS(unit_a_in);
            COPY_THIS(unit_b_in);
            COPY_THIS(unit_c_in);
            COPY_THIS(unit_d_in);
            COPY_THIS(camera_field_of_view);
            COPY_THIS(camera_stiffness);
            COPY_THIS(camera_marker_name);
            COPY_THIS(camera_submerged_marker_name);
            COPY_THIS(pitch_auto_level);
            COPY_THIS(pitch_range);
            COPY_THIS(camera_tracks);
            COPY_THIS(seat_acceleration_scale);
            COPY_THIS(soft_ping_threshold);
            COPY_THIS(soft_ping_interrupt_time);
            COPY_THIS(hard_ping_threshold);
            COPY_THIS(hard_ping_interrupt_time);
            COPY_THIS(hard_death_threshold);
            COPY_THIS(feign_death_threshold);
            COPY_THIS(feign_death_time);
            COPY_THIS(distance_of_evade_anim);
            COPY_THIS(distance_of_dive_anim);
            COPY_THIS(stunned_movement_threshold);
            COPY_THIS(feign_death_chance);
            COPY_THIS(feign_repeat_chance);
            COPY_THIS(spawned_actor);
            COPY_THIS(spawned_actor_count);
            COPY_THIS(spawned_velocity);
            COPY_THIS(aiming_velocity_maximum);
            COPY_THIS(aiming_acceleration_maximum);
            COPY_THIS(casual_aiming_modifier);
            COPY_THIS(looking_velocity_maximum);
            COPY_THIS(looking_acceleration_maximum);
            COPY_THIS(ai_vehicle_radius);
            COPY_THIS(ai_danger_radius);
            COPY_THIS(melee_damage);
            COPY_THIS(motion_sensor_blip_size);
            COPY_THIS(metagame_type);
            COPY_THIS(metagame_class);
            COPY_THIS(new_hud_interfaces);
            COPY_THIS(dialogue_variants);
            COPY_THIS(grenade_velocity);
            COPY_THIS(grenade_type);
            COPY_THIS(grenade_count);
            COPY_THIS(soft_ping_interrupt_ticks);
            COPY_THIS(hard_ping_interrupt_ticks);
            COPY_THIS(powered_seats);
            COPY_THIS(weapons);
            COPY_THIS(seats);
            COPY_THIS(object_type);
            COPY_THIS(flags);
            COPY_THIS(bounding_radius);
            COPY_THIS(bounding_offset);
            COPY_THIS(origin_offset);
            COPY_THIS(acceleration_scale);
            COPY_THIS(scales_change_colors);
            COPY_THIS(model);
            COPY_THIS(animation_graph);
            COPY_THIS(collision_model);
            COPY_THIS(physics);
            COPY_THIS(modifier_shader);
            COPY_THIS(creation_effect);
            COPY_THIS(render_bounding_radius);
            COPY_THIS(a_in);
            COPY_THIS(b_in);
            COPY_THIS(c_in);
            COPY_THIS(d_in);
            COPY_THIS(hud_text_message_index);
            COPY_THIS(forced_shader_permutation_index);
            COPY_THIS(attachments);
            COPY_THIS(widgets);
            COPY_THIS(functions);
            COPY_THIS(change_colors);
            COPY_THIS(predicted_resources);
            return copy;
        }
    };
    static_assert(sizeof(Unit<NativeEndian>) == 0x2F0);

    ENDIAN_TEMPLATE(EndianType) struct Biped : Unit<EndianType> {
        EndianType<Angle> moving_turning_speed;
        EndianType<BipedFlags> biped_flags;
        EndianType<Angle> stationary_turning_threshold;
        PAD(0x10);
        EndianType<BipedFunctionIn> biped_a_in;
        EndianType<BipedFunctionIn> biped_b_in;
        EndianType<BipedFunctionIn> biped_c_in;
        EndianType<BipedFunctionIn> biped_d_in;
        TagDependency<EndianType> dont_use;
        EndianType<Angle> bank_angle;
        EndianType<float> bank_apply_time;
        EndianType<float> bank_decay_time;
        EndianType<float> pitch_ratio;
        EndianType<float> max_velocity;
        EndianType<float> max_sidestep_velocity;
        EndianType<float> acceleration;
        EndianType<float> deceleration;
        EndianType<Angle> angular_velocity_maximum;
        EndianType<Angle> angular_acceleration_maximum;
        EndianType<float> crouch_velocity_modifier;
        PAD(0x8);
        EndianType<Angle> maximum_slope_angle;
        EndianType<Angle> downhill_falloff_angle;
        EndianType<Angle> downhill_cutoff_angle;
        EndianType<float> downhill_velocity_scale;
        EndianType<Angle> uphill_falloff_angle;
        EndianType<Angle> uphill_cutoff_angle;
        EndianType<float> uphill_velocity_scale;
        PAD(0x18);
        TagDependency<EndianType> footsteps;
        PAD(0x18);
        EndianType<float> jump_velocity;
        PAD(0x1C);
        EndianType<float> maximum_soft_landing_time;
        EndianType<float> maximum_hard_landing_time;
        EndianType<float> minimum_soft_landing_velocity;
        EndianType<float> minimum_hard_landing_velocity;
        EndianType<float> maximum_hard_landing_velocity;
        EndianType<float> death_hard_landing_velocity;
        PAD(0x14);
        EndianType<float> standing_camera_height;
        EndianType<float> crouching_camera_height;
        EndianType<float> crouch_transition_time;
        PAD(0x18);
        EndianType<float> standing_collision_height;
        EndianType<float> crouching_collision_height;
        EndianType<float> collision_radius;
        PAD(0x28);
        EndianType<float> autoaim_width;
        PAD(0x6C);
        LittleEndian<float> cosine_stationary_turning_threshold;
        LittleEndian<float> crouch_camera_velocity;
        LittleEndian<float> cosine_maximum_slope_angle;
        LittleEndian<float> negative_sine_downhill_falloff_angle;
        LittleEndian<float> negative_sine_downhill_cutoff_angle;
        LittleEndian<float> sine_uphill_falloff_angle;
        LittleEndian<float> sine_uphill_cutoff_angle;
        LittleEndian<Index> pelvis_model_node_index;
        LittleEndian<Index> head_model_node_index;
        TagReflexive<EndianType, BipedContactPoint> contact_point;
        ENDIAN_TEMPLATE(NewEndian) operator Biped<NewEndian>() const {
            Biped<NewEndian> copy = {};
            COPY_THIS(moving_turning_speed);
            COPY_THIS(biped_flags);
            COPY_THIS(stationary_turning_threshold);
            COPY_THIS(biped_a_in);
            COPY_THIS(biped_b_in);
            COPY_THIS(biped_c_in);
            COPY_THIS(biped_d_in);
            COPY_THIS(dont_use);
            COPY_THIS(bank_angle);
            COPY_THIS(bank_apply_time);
            COPY_THIS(bank_decay_time);
            COPY_THIS(pitch_ratio);
            COPY_THIS(max_velocity);
            COPY_THIS(max_sidestep_velocity);
            COPY_THIS(acceleration);
            COPY_THIS(deceleration);
            COPY_THIS(angular_velocity_maximum);
            COPY_THIS(angular_acceleration_maximum);
            COPY_THIS(crouch_velocity_modifier);
            COPY_THIS(maximum_slope_angle);
            COPY_THIS(downhill_falloff_angle);
            COPY_THIS(downhill_cutoff_angle);
            COPY_THIS(downhill_velocity_scale);
            COPY_THIS(uphill_falloff_angle);
            COPY_THIS(uphill_cutoff_angle);
            COPY_THIS(uphill_velocity_scale);
            COPY_THIS(footsteps);
            COPY_THIS(jump_velocity);
            COPY_THIS(maximum_soft_landing_time);
            COPY_THIS(maximum_hard_landing_time);
            COPY_THIS(minimum_soft_landing_velocity);
            COPY_THIS(minimum_hard_landing_velocity);
            COPY_THIS(maximum_hard_landing_velocity);
            COPY_THIS(death_hard_landing_velocity);
            COPY_THIS(standing_camera_height);
            COPY_THIS(crouching_camera_height);
            COPY_THIS(crouch_transition_time);
            COPY_THIS(standing_collision_height);
            COPY_THIS(crouching_collision_height);
            COPY_THIS(collision_radius);
            COPY_THIS(autoaim_width);
            COPY_THIS(cosine_stationary_turning_threshold);
            COPY_THIS(crouch_camera_velocity);
            COPY_THIS(cosine_maximum_slope_angle);
            COPY_THIS(negative_sine_downhill_falloff_angle);
            COPY_THIS(negative_sine_downhill_cutoff_angle);
            COPY_THIS(sine_uphill_falloff_angle);
            COPY_THIS(sine_uphill_cutoff_angle);
            COPY_THIS(pelvis_model_node_index);
            COPY_THIS(head_model_node_index);
            COPY_THIS(contact_point);
            COPY_THIS(unit_flags);
            COPY_THIS(default_team);
            COPY_THIS(constant_sound_volume);
            COPY_THIS(rider_damage_fraction);
            COPY_THIS(integrated_light_toggle);
            COPY_THIS(unit_a_in);
            COPY_THIS(unit_b_in);
            COPY_THIS(unit_c_in);
            COPY_THIS(unit_d_in);
            COPY_THIS(camera_field_of_view);
            COPY_THIS(camera_stiffness);
            COPY_THIS(camera_marker_name);
            COPY_THIS(camera_submerged_marker_name);
            COPY_THIS(pitch_auto_level);
            COPY_THIS(pitch_range);
            COPY_THIS(camera_tracks);
            COPY_THIS(seat_acceleration_scale);
            COPY_THIS(soft_ping_threshold);
            COPY_THIS(soft_ping_interrupt_time);
            COPY_THIS(hard_ping_threshold);
            COPY_THIS(hard_ping_interrupt_time);
            COPY_THIS(hard_death_threshold);
            COPY_THIS(feign_death_threshold);
            COPY_THIS(feign_death_time);
            COPY_THIS(distance_of_evade_anim);
            COPY_THIS(distance_of_dive_anim);
            COPY_THIS(stunned_movement_threshold);
            COPY_THIS(feign_death_chance);
            COPY_THIS(feign_repeat_chance);
            COPY_THIS(spawned_actor);
            COPY_THIS(spawned_actor_count);
            COPY_THIS(spawned_velocity);
            COPY_THIS(aiming_velocity_maximum);
            COPY_THIS(aiming_acceleration_maximum);
            COPY_THIS(casual_aiming_modifier);
            COPY_THIS(looking_velocity_maximum);
            COPY_THIS(looking_acceleration_maximum);
            COPY_THIS(ai_vehicle_radius);
            COPY_THIS(ai_danger_radius);
            COPY_THIS(melee_damage);
            COPY_THIS(motion_sensor_blip_size);
            COPY_THIS(metagame_type);
            COPY_THIS(metagame_class);
            COPY_THIS(new_hud_interfaces);
            COPY_THIS(dialogue_variants);
            COPY_THIS(grenade_velocity);
            COPY_THIS(grenade_type);
            COPY_THIS(grenade_count);
            COPY_THIS(soft_ping_interrupt_ticks);
            COPY_THIS(hard_ping_interrupt_ticks);
            COPY_THIS(powered_seats);
            COPY_THIS(weapons);
            COPY_THIS(seats);
            COPY_THIS(object_type);
            COPY_THIS(flags);
            COPY_THIS(bounding_radius);
            COPY_THIS(bounding_offset);
            COPY_THIS(origin_offset);
            COPY_THIS(acceleration_scale);
            COPY_THIS(scales_change_colors);
            COPY_THIS(model);
            COPY_THIS(animation_graph);
            COPY_THIS(collision_model);
            COPY_THIS(physics);
            COPY_THIS(modifier_shader);
            COPY_THIS(creation_effect);
            COPY_THIS(render_bounding_radius);
            COPY_THIS(a_in);
            COPY_THIS(b_in);
            COPY_THIS(c_in);
            COPY_THIS(d_in);
            COPY_THIS(hud_text_message_index);
            COPY_THIS(forced_shader_permutation_index);
            COPY_THIS(attachments);
            COPY_THIS(widgets);
            COPY_THIS(functions);
            COPY_THIS(change_colors);
            COPY_THIS(predicted_resources);
            return copy;
        }
    };
    static_assert(sizeof(Biped<NativeEndian>) == 0x4F4);

    ENDIAN_TEMPLATE(EndianType) struct BitmapGroupSprite {
        EndianType<Index> bitmap_index;
        PAD(0x2);
        PAD(0x4);
        EndianType<float> left;
        EndianType<float> right;
        EndianType<float> top;
        EndianType<float> bottom;
        Point2D<EndianType> registration_point;
        ENDIAN_TEMPLATE(NewEndian) operator BitmapGroupSprite<NewEndian>() const {
            BitmapGroupSprite<NewEndian> copy = {};
            COPY_THIS(bitmap_index);
            COPY_THIS(left);
            COPY_THIS(right);
            COPY_THIS(top);
            COPY_THIS(bottom);
            COPY_THIS(registration_point);
            return copy;
        }
    };
    static_assert(sizeof(BitmapGroupSprite<NativeEndian>) == 0x20);

    ENDIAN_TEMPLATE(EndianType) struct BitmapGroupSequence {
        TagString name;
        EndianType<Index> first_bitmap_index;
        EndianType<std::uint16_t> bitmap_count;
        PAD(0x10);
        TagReflexive<EndianType, BitmapGroupSprite> sprites;
        ENDIAN_TEMPLATE(NewEndian) operator BitmapGroupSequence<NewEndian>() const {
            BitmapGroupSequence<NewEndian> copy = {};
            COPY_THIS(name);
            COPY_THIS(first_bitmap_index);
            COPY_THIS(bitmap_count);
            COPY_THIS(sprites);
            return copy;
        }
    };
    static_assert(sizeof(BitmapGroupSequence<NativeEndian>) == 0x40);

    ENDIAN_TEMPLATE(EndianType) struct BitmapData {
        EndianType<TagFourCC> bitmap_class;
        EndianType<std::uint16_t> width;
        EndianType<std::uint16_t> height;
        EndianType<std::uint16_t> depth;
        EndianType<BitmapDataType> type;
        EndianType<BitmapDataFormat> format;
        EndianType<BitmapDataFlags> flags;
        Point2DInt<EndianType> registration_point;
        EndianType<std::uint16_t> mipmap_count;
        PAD(0x2);
        EndianType<std::uint32_t> pixel_data_offset;
        LittleEndian<std::uint32_t> pixel_data_size;
        LittleEndian<TagID> bitmap_tag_id;
        LittleEndian<Pointer> pointer;
        PAD(0x4);
        PAD(0x4);
        ENDIAN_TEMPLATE(NewEndian) operator BitmapData<NewEndian>() const {
            BitmapData<NewEndian> copy = {};
            COPY_THIS(bitmap_class);
            COPY_THIS(width);
            COPY_THIS(height);
            COPY_THIS(depth);
            COPY_THIS(type);
            COPY_THIS(format);
            COPY_THIS(flags);
            COPY_THIS(registration_point);
            COPY_THIS(mipmap_count);
            COPY_THIS(pixel_data_offset);
            COPY_THIS(pixel_data_size);
            COPY_THIS(bitmap_tag_id);
            COPY_THIS(pointer);
            return copy;
        }
    };
    static_assert(sizeof(BitmapData<NativeEndian>) == 0x30);

    ENDIAN_TEMPLATE(EndianType) struct Bitmap {
        EndianType<BitmapType> type;
        EndianType<BitmapFormat> encoding_format;
        EndianType<BitmapUsage> usage;
        EndianType<BitmapFlags> flags;
        EndianType<Fraction> detail_fade_factor;
        EndianType<Fraction> sharpen_amount;
        EndianType<Fraction> bump_height;
        EndianType<BitmapSpriteBudgetSize> sprite_budget_size;
        EndianType<std::uint16_t> sprite_budget_count;
        EndianType<std::uint16_t> color_plate_width;
        EndianType<std::uint16_t> color_plate_height;
        TagDataOffset<EndianType> compressed_color_plate_data;
        TagDataOffset<EndianType> processed_pixel_data;
        EndianType<float> blur_filter_size;
        EndianType<float> alpha_bias;
        EndianType<std::uint16_t> mipmap_count;
        EndianType<BitmapSpriteUsage> sprite_usage;
        EndianType<std::uint16_t> sprite_spacing;
        PAD(0x2);
        TagReflexive<EndianType, BitmapGroupSequence> bitmap_group_sequence;
        TagReflexive<EndianType, BitmapData> bitmap_data;
        ENDIAN_TEMPLATE(NewEndian) operator Bitmap<NewEndian>() const {
            Bitmap<NewEndian> copy = {};
            COPY_THIS(type);
            COPY_THIS(encoding_format);
            COPY_THIS(usage);
            COPY_THIS(flags);
            COPY_THIS(detail_fade_factor);
            COPY_THIS(sharpen_amount);
            COPY_THIS(bump_height);
            COPY_THIS(sprite_budget_size);
            COPY_THIS(sprite_budget_count);
            COPY_THIS(color_plate_width);
            COPY_THIS(color_plate_height);
            COPY_THIS(compressed_color_plate_data);
            COPY_THIS(processed_pixel_data);
            COPY_THIS(blur_filter_size);
            COPY_THIS(alpha_bias);
            COPY_THIS(mipmap_count);
            COPY_THIS(sprite_usage);
            COPY_THIS(sprite_spacing);
            COPY_THIS(bitmap_group_sequence);
            COPY_THIS(bitmap_data);
            return copy;
        }
    };
    static_assert(sizeof(Bitmap<NativeEndian>) == 0x6C);

    ENDIAN_TEMPLATE(EndianType) struct CameraTrackControlPoint {
        Point3D<EndianType> position;
        Quaternion<EndianType> orientation;
        PAD(0x20);
        ENDIAN_TEMPLATE(NewEndian) operator CameraTrackControlPoint<NewEndian>() const {
            CameraTrackControlPoint<NewEndian> copy = {};
            COPY_THIS(position);
            COPY_THIS(orientation);
            return copy;
        }
    };
    static_assert(sizeof(CameraTrackControlPoint<NativeEndian>) == 0x3C);

    ENDIAN_TEMPLATE(EndianType) struct CameraTrack {
        EndianType<IsUnusedFlag> flags;
        TagReflexive<EndianType, CameraTrackControlPoint> control_points;
        PAD(0x20);
        ENDIAN_TEMPLATE(NewEndian) operator CameraTrack<NewEndian>() const {
            CameraTrack<NewEndian> copy = {};
            COPY_THIS(flags);
            COPY_THIS(control_points);
            return copy;
        }
    };
    static_assert(sizeof(CameraTrack<NativeEndian>) == 0x30);

    ENDIAN_TEMPLATE(EndianType) struct ColorTableColor {
        TagString name;
        ColorARGB<EndianType> color;
        ENDIAN_TEMPLATE(NewEndian) operator ColorTableColor<NewEndian>() const {
            ColorTableColor<NewEndian> copy;
            COPY_THIS(name);
            COPY_THIS(color);
            return copy;
        }
    };
    static_assert(sizeof(ColorTableColor<NativeEndian>) == 0x30);

    ENDIAN_TEMPLATE(EndianType) struct ColorTable {
        TagReflexive<EndianType, ColorTableColor> colors;
        ENDIAN_TEMPLATE(NewEndian) operator ColorTable<NewEndian>() const {
            ColorTable<NewEndian> copy;
            COPY_THIS(colors);
            return copy;
        }
    };
    static_assert(sizeof(ColorTable<NativeEndian>) == 0xC);

    ENDIAN_TEMPLATE(EndianType) struct ContinuousDamageEffect {
        Bounds<EndianType<float>> radius;
        EndianType<float> cutoff_scale;
        PAD(0x18);
        EndianType<float> low_frequency_vibrate_frequency;
        EndianType<float> high_frequency_vibrate_frequency;
        PAD(0x18);
        EndianType<float> camera_shaking_random_translation;
        EndianType<Angle> camera_shaking_random_rotation;
        PAD(0xC);
        EndianType<WaveFunction> camera_shaking_wobble_function;
        PAD(0x2);
        EndianType<float> camera_shaking_wobble_period;
        EndianType<float> camera_shaking_wobble_weight;
        PAD(0x4);
        PAD(0x14);
        PAD(0x8);
        PAD(0xA0);
        EndianType<DamageEffectSideEffect> damage_side_effect;
        EndianType<DamageEffectCategory> damage_category;
        EndianType<DamageEffectDamageFlags> damage_flags;
        PAD(0x4);
        EndianType<float> damage_lower_bound;
        Bounds<EndianType<float>> damage_upper_bound;
        EndianType<float> damage_vehicle_passthrough_penalty;
        PAD(0x4);
        EndianType<float> damage_stun;
        EndianType<float> damage_maximum_stun;
        EndianType<float> damage_stun_time;
        PAD(0x4);
        Vector3D<EndianType> damage_instantaneous_acceleration;
        EndianType<float> dirt;
        EndianType<float> sand;
        EndianType<float> stone;
        EndianType<float> snow;
        EndianType<float> wood;
        EndianType<float> metal_hollow;
        EndianType<float> metal_thin;
        EndianType<float> metal_thick;
        EndianType<float> rubber;
        EndianType<float> glass;
        EndianType<float> force_field;
        EndianType<float> grunt;
        EndianType<float> hunter_armor;
        EndianType<float> hunter_skin;
        EndianType<float> elite;
        EndianType<float> jackal;
        EndianType<float> jackal_energy_shield;
        EndianType<float> engineer_skin;
        EndianType<float> engineer_force_field;
        EndianType<float> flood_combat_form;
        EndianType<float> flood_carrier_form;
        EndianType<float> cyborg_armor;
        EndianType<float> cyborg_energy_shield;
        EndianType<float> human_armor;
        EndianType<float> human_skin;
        EndianType<float> sentinel;
        EndianType<float> monitor;
        EndianType<float> plastic;
        EndianType<float> water;
        EndianType<float> leaves;
        EndianType<float> elite_energy_shield;
        EndianType<float> ice;
        EndianType<float> hunter_shield;
        PAD(0x1C);
        ENDIAN_TEMPLATE(NewEndian) operator ContinuousDamageEffect<NewEndian>() const {
            ContinuousDamageEffect<NewEndian> copy = {};
            COPY_THIS(radius);
            COPY_THIS(cutoff_scale);
            COPY_THIS(low_frequency_vibrate_frequency);
            COPY_THIS(high_frequency_vibrate_frequency);
            COPY_THIS(camera_shaking_random_translation);
            COPY_THIS(camera_shaking_random_rotation);
            COPY_THIS(camera_shaking_wobble_function);
            COPY_THIS(camera_shaking_wobble_period);
            COPY_THIS(camera_shaking_wobble_weight);
            COPY_THIS(damage_side_effect);
            COPY_THIS(damage_category);
            COPY_THIS(damage_flags);
            COPY_THIS(damage_lower_bound);
            COPY_THIS(damage_upper_bound);
            COPY_THIS(damage_vehicle_passthrough_penalty);
            COPY_THIS(damage_stun);
            COPY_THIS(damage_maximum_stun);
            COPY_THIS(damage_stun_time);
            COPY_THIS(damage_instantaneous_acceleration);
            COPY_THIS(dirt);
            COPY_THIS(sand);
            COPY_THIS(stone);
            COPY_THIS(snow);
            COPY_THIS(wood);
            COPY_THIS(metal_hollow);
            COPY_THIS(metal_thin);
            COPY_THIS(metal_thick);
            COPY_THIS(rubber);
            COPY_THIS(glass);
            COPY_THIS(force_field);
            COPY_THIS(grunt);
            COPY_THIS(hunter_armor);
            COPY_THIS(hunter_skin);
            COPY_THIS(elite);
            COPY_THIS(jackal);
            COPY_THIS(jackal_energy_shield);
            COPY_THIS(engineer_skin);
            COPY_THIS(engineer_force_field);
            COPY_THIS(flood_combat_form);
            COPY_THIS(flood_carrier_form);
            COPY_THIS(cyborg_armor);
            COPY_THIS(cyborg_energy_shield);
            COPY_THIS(human_armor);
            COPY_THIS(human_skin);
            COPY_THIS(sentinel);
            COPY_THIS(monitor);
            COPY_THIS(plastic);
            COPY_THIS(water);
            COPY_THIS(leaves);
            COPY_THIS(elite_energy_shield);
            COPY_THIS(ice);
            COPY_THIS(hunter_shield);
            return copy;
        }
    };
    static_assert(sizeof(ContinuousDamageEffect<NativeEndian>) == 0x200);

    ENDIAN_TEMPLATE(EndianType) struct ContrailPointState {
        Bounds<EndianType<float>> duration;
        Bounds<EndianType<float>> transition_duration;
        TagDependency<EndianType> physics;
        PAD(0x20);
        EndianType<float> width;
        ColorARGB<EndianType> color_lower_bound;
        ColorARGB<EndianType> color_upper_bound;
        EndianType<ContrailPointStateScaleFlags> scale_flags;
        ENDIAN_TEMPLATE(NewEndian) operator ContrailPointState<NewEndian>() const {
            ContrailPointState<NewEndian> copy = {};
            COPY_THIS(duration);
            COPY_THIS(transition_duration);
            COPY_THIS(physics);
            COPY_THIS(width);
            COPY_THIS(color_lower_bound);
            COPY_THIS(color_upper_bound);
            COPY_THIS(scale_flags);
            return copy;
        }
    };
    static_assert(sizeof(ContrailPointState<NativeEndian>) == 0x68);

    ENDIAN_TEMPLATE(EndianType) struct Contrail {
        EndianType<ContrailFlags> flags;
        EndianType<ContrailScaleFlags> scale_flags;
        EndianType<float> point_generation_rate;
        Bounds<EndianType<float>> point_velocity;
        EndianType<Angle> point_velocity_cone_angle;
        EndianType<Fraction> inherited_velocity_fraction;
        EndianType<ContrailRenderType> render_type;
        PAD(0x2);
        EndianType<float> texture_repeats_u;
        EndianType<float> texture_repeats_v;
        EndianType<float> texture_animation_u;
        EndianType<float> texture_animation_v;
        EndianType<float> animation_rate;
        TagDependency<EndianType> bitmap;
        EndianType<Index> first_sequence_index;
        EndianType<std::int16_t> sequence_count;
        PAD(0x40);
        PAD(0x24);
        EndianType<std::uint32_t> unknown_int;
        EndianType<ParticleShaderFlags> shader_flags;
        EndianType<FramebufferBlendFunction> framebuffer_blend_function;
        EndianType<FramebufferFadeMode> framebuffer_fade_mode;
        EndianType<IsUnfilteredFlag> map_flags;
        PAD(0xC);
        PAD(0x10);
        TagDependency<EndianType> secondary_bitmap;
        EndianType<ParticleAnchor> anchor;
        EndianType<IsUnfilteredFlag> secondary_map_flags;
        EndianType<FunctionOut> u_animation_source;
        EndianType<WaveFunction> u_animation_function;
        EndianType<float> u_animation_period;
        EndianType<float> u_animation_phase;
        EndianType<float> u_animation_scale;
        EndianType<FunctionOut> v_animation_source;
        EndianType<WaveFunction> v_animation_function;
        EndianType<float> v_animation_period;
        EndianType<float> v_animation_phase;
        EndianType<float> v_animation_scale;
        EndianType<FunctionOut> rotation_animation_source;
        EndianType<WaveFunction> rotation_animation_function;
        EndianType<float> rotation_animation_period;
        EndianType<float> rotation_animation_phase;
        EndianType<Angle> rotation_animation_scale;
        Point2D<EndianType> rotation_animation_center;
        PAD(0x4);
        EndianType<float> zsprite_radius_scale;
        PAD(0x14);
        TagReflexive<EndianType, ContrailPointState> point_states;
        ENDIAN_TEMPLATE(NewEndian) operator Contrail<NewEndian>() const {
            Contrail<NewEndian> copy = {};
            COPY_THIS(flags);
            COPY_THIS(scale_flags);
            COPY_THIS(point_generation_rate);
            COPY_THIS(point_velocity);
            COPY_THIS(point_velocity_cone_angle);
            COPY_THIS(inherited_velocity_fraction);
            COPY_THIS(render_type);
            COPY_THIS(texture_repeats_u);
            COPY_THIS(texture_repeats_v);
            COPY_THIS(texture_animation_u);
            COPY_THIS(texture_animation_v);
            COPY_THIS(animation_rate);
            COPY_THIS(bitmap);
            COPY_THIS(first_sequence_index);
            COPY_THIS(sequence_count);
            COPY_THIS(unknown_int);
            COPY_THIS(shader_flags);
            COPY_THIS(framebuffer_blend_function);
            COPY_THIS(framebuffer_fade_mode);
            COPY_THIS(map_flags);
            COPY_THIS(secondary_bitmap);
            COPY_THIS(anchor);
            COPY_THIS(secondary_map_flags);
            COPY_THIS(u_animation_source);
            COPY_THIS(u_animation_function);
            COPY_THIS(u_animation_period);
            COPY_THIS(u_animation_phase);
            COPY_THIS(u_animation_scale);
            COPY_THIS(v_animation_source);
            COPY_THIS(v_animation_function);
            COPY_THIS(v_animation_period);
            COPY_THIS(v_animation_phase);
            COPY_THIS(v_animation_scale);
            COPY_THIS(rotation_animation_source);
            COPY_THIS(rotation_animation_function);
            COPY_THIS(rotation_animation_period);
            COPY_THIS(rotation_animation_phase);
            COPY_THIS(rotation_animation_scale);
            COPY_THIS(rotation_animation_center);
            COPY_THIS(zsprite_radius_scale);
            COPY_THIS(point_states);
            return copy;
        }
    };
    static_assert(sizeof(Contrail<NativeEndian>) == 0x144);

    ENDIAN_TEMPLATE(EndianType) struct DamageEffect {
        Bounds<EndianType<float>> radius;
        EndianType<float> cutoff_scale;
        EndianType<DamageEffectFlags> flags;
        PAD(0x10);
        PAD(0x4);
        EndianType<DamageEffectScreenFlashType> type;
        EndianType<DamageEffectScreenFlashPriority> priority;
        PAD(0x8);
        PAD(0x4);
        EndianType<float> duration;
        EndianType<FunctionType> fade_function;
        PAD(0x2);
        PAD(0x4);
        PAD(0x4);
        EndianType<float> maximum_intensity;
        PAD(0x4);
        ColorARGB<EndianType> color;
        EndianType<float> low_frequency_vibrate_frequency;
        EndianType<float> low_frequency_vibrate_duration;
        EndianType<FunctionType> low_frequency_vibrate_fade_function;
        PAD(0x2);
        PAD(0x8);
        EndianType<float> high_frequency_vibrate_frequency;
        EndianType<float> high_frequency_vibrate_duration;
        EndianType<FunctionType> high_frequency_vibrate_fade_function;
        PAD(0x2);
        PAD(0x4);
        PAD(0x10);
        PAD(0x8);
        EndianType<float> temporary_camera_impulse_duration;
        EndianType<FunctionType> temporary_camera_impulse_fade_function;
        PAD(0x2);
        EndianType<Angle> temporary_camera_impulse_rotation;
        EndianType<float> temporary_camera_impulse_pushback;
        Bounds<EndianType<float>> jitter;
        PAD(0x8);
        EndianType<Angle> permanent_camera_impulse_angle;
        PAD(0x4);
        PAD(0xC);
        EndianType<float> camera_shaking_duration;
        EndianType<FunctionType> camera_shaking_falloff_function;
        PAD(0x2);
        EndianType<float> camera_shaking_random_translation;
        EndianType<Angle> camera_shaking_random_rotation;
        PAD(0x4);
        PAD(0x8);
        EndianType<WaveFunction> camera_shaking_wobble_function;
        PAD(0x2);
        EndianType<float> camera_shaking_wobble_period;
        EndianType<float> camera_shaking_wobble_weight;
        PAD(0xC);
        PAD(0x10);
        PAD(0x4);
        TagDependency<EndianType> sound;
        PAD(0x6C);
        PAD(0x4);
        EndianType<float> breaking_effect_forward_velocity;
        EndianType<float> breaking_effect_forward_radius;
        EndianType<float> breaking_effect_forward_exponent;
        PAD(0x4);
        PAD(0x8);
        EndianType<float> breaking_effect_outward_velocity;
        EndianType<float> breaking_effect_outward_radius;
        EndianType<float> breaking_effect_outward_exponent;
        PAD(0x8);
        PAD(0x4);
        EndianType<DamageEffectSideEffect> damage_side_effect;
        EndianType<DamageEffectCategory> damage_category;
        EndianType<DamageEffectDamageFlags> damage_flags;
        EndianType<float> damage_aoe_core_radius;
        EndianType<float> damage_lower_bound;
        Bounds<EndianType<float>> damage_upper_bound;
        EndianType<float> damage_vehicle_passthrough_penalty;
        EndianType<float> damage_active_camouflage_damage;
        EndianType<float> damage_stun;
        EndianType<float> damage_maximum_stun;
        EndianType<float> damage_stun_time;
        PAD(0x4);
        Vector3D<EndianType> damage_instantaneous_acceleration;
        EndianType<float> dirt;
        EndianType<float> sand;
        EndianType<float> stone;
        EndianType<float> snow;
        EndianType<float> wood;
        EndianType<float> metal_hollow;
        EndianType<float> metal_thin;
        EndianType<float> metal_thick;
        EndianType<float> rubber;
        EndianType<float> glass;
        EndianType<float> force_field;
        EndianType<float> grunt;
        EndianType<float> hunter_armor;
        EndianType<float> hunter_skin;
        EndianType<float> elite;
        EndianType<float> jackal;
        EndianType<float> jackal_energy_shield;
        EndianType<float> engineer_skin;
        EndianType<float> engineer_force_field;
        EndianType<float> flood_combat_form;
        EndianType<float> flood_carrier_form;
        EndianType<float> cyborg_armor;
        EndianType<float> cyborg_energy_shield;
        EndianType<float> human_armor;
        EndianType<float> human_skin;
        EndianType<float> sentinel;
        EndianType<float> monitor;
        EndianType<float> plastic;
        EndianType<float> water;
        EndianType<float> leaves;
        EndianType<float> elite_energy_shield;
        EndianType<float> ice;
        EndianType<float> hunter_shield;
        PAD(0xC);
        PAD(0x10);
        ENDIAN_TEMPLATE(NewEndian) operator DamageEffect<NewEndian>() const {
            DamageEffect<NewEndian> copy = {};
            COPY_THIS(radius);
            COPY_THIS(cutoff_scale);
            COPY_THIS(flags);
            COPY_THIS(type);
            COPY_THIS(priority);
            COPY_THIS(duration);
            COPY_THIS(fade_function);
            COPY_THIS(maximum_intensity);
            COPY_THIS(color);
            COPY_THIS(low_frequency_vibrate_frequency);
            COPY_THIS(low_frequency_vibrate_duration);
            COPY_THIS(low_frequency_vibrate_fade_function);
            COPY_THIS(high_frequency_vibrate_frequency);
            COPY_THIS(high_frequency_vibrate_duration);
            COPY_THIS(high_frequency_vibrate_fade_function);
            COPY_THIS(temporary_camera_impulse_duration);
            COPY_THIS(temporary_camera_impulse_fade_function);
            COPY_THIS(temporary_camera_impulse_rotation);
            COPY_THIS(temporary_camera_impulse_pushback);
            COPY_THIS(jitter);
            COPY_THIS(permanent_camera_impulse_angle);
            COPY_THIS(camera_shaking_duration);
            COPY_THIS(camera_shaking_falloff_function);
            COPY_THIS(camera_shaking_random_translation);
            COPY_THIS(camera_shaking_random_rotation);
            COPY_THIS(camera_shaking_wobble_function);
            COPY_THIS(camera_shaking_wobble_period);
            COPY_THIS(camera_shaking_wobble_weight);
            COPY_THIS(sound);
            COPY_THIS(breaking_effect_forward_velocity);
            COPY_THIS(breaking_effect_forward_radius);
            COPY_THIS(breaking_effect_forward_exponent);
            COPY_THIS(breaking_effect_outward_velocity);
            COPY_THIS(breaking_effect_outward_radius);
            COPY_THIS(breaking_effect_outward_exponent);
            COPY_THIS(damage_side_effect);
            COPY_THIS(damage_category);
            COPY_THIS(damage_flags);
            COPY_THIS(damage_aoe_core_radius);
            COPY_THIS(damage_lower_bound);
            COPY_THIS(damage_upper_bound);
            COPY_THIS(damage_vehicle_passthrough_penalty);
            COPY_THIS(damage_active_camouflage_damage);
            COPY_THIS(damage_stun);
            COPY_THIS(damage_maximum_stun);
            COPY_THIS(damage_stun_time);
            COPY_THIS(damage_instantaneous_acceleration);
            COPY_THIS(dirt);
            COPY_THIS(sand);
            COPY_THIS(stone);
            COPY_THIS(snow);
            COPY_THIS(wood);
            COPY_THIS(metal_hollow);
            COPY_THIS(metal_thin);
            COPY_THIS(metal_thick);
            COPY_THIS(rubber);
            COPY_THIS(glass);
            COPY_THIS(force_field);
            COPY_THIS(grunt);
            COPY_THIS(hunter_armor);
            COPY_THIS(hunter_skin);
            COPY_THIS(elite);
            COPY_THIS(jackal);
            COPY_THIS(jackal_energy_shield);
            COPY_THIS(engineer_skin);
            COPY_THIS(engineer_force_field);
            COPY_THIS(flood_combat_form);
            COPY_THIS(flood_carrier_form);
            COPY_THIS(cyborg_armor);
            COPY_THIS(cyborg_energy_shield);
            COPY_THIS(human_armor);
            COPY_THIS(human_skin);
            COPY_THIS(sentinel);
            COPY_THIS(monitor);
            COPY_THIS(plastic);
            COPY_THIS(water);
            COPY_THIS(leaves);
            COPY_THIS(elite_energy_shield);
            COPY_THIS(ice);
            COPY_THIS(hunter_shield);
            return copy;
        }
    };
    static_assert(sizeof(DamageEffect<NativeEndian>) == 0x2A0);

    ENDIAN_TEMPLATE(EndianType) struct Decal {
        EndianType<DecalFlags> flags;
        EndianType<DecalType> type;
        EndianType<DecalLayer> layer;
        PAD(0x2);
        TagDependency<EndianType> next_decal_in_chain;
        Bounds<EndianType<float>> radius;
        PAD(0xC);
        Bounds<EndianType<Fraction>> intensity;
        ColorRGB<EndianType> color_lower_bounds;
        ColorRGB<EndianType> color_upper_bounds;
        PAD(0xC);
        EndianType<std::int16_t> animation_loop_frame;
        EndianType<std::int16_t> animation_speed;
        PAD(0x1C);
        Bounds<EndianType<float>> lifetime;
        Bounds<EndianType<float>> decay_time;
        PAD(0xC);
        PAD(0x28);
        PAD(0x2);
        PAD(0x2);
        EndianType<FramebufferBlendFunction> framebuffer_blend_function;
        PAD(0x2);
        PAD(0x14);
        TagDependency<EndianType> map;
        PAD(0x14);
        EndianType<float> maximum_sprite_extent;
        PAD(0x4);
        PAD(0x8);
        ENDIAN_TEMPLATE(NewEndian) operator Decal<NewEndian>() const {
            Decal<NewEndian> copy = {};
            COPY_THIS(flags);
            COPY_THIS(type);
            COPY_THIS(layer);
            COPY_THIS(next_decal_in_chain);
            COPY_THIS(radius);
            COPY_THIS(intensity);
            COPY_THIS(color_lower_bounds);
            COPY_THIS(color_upper_bounds);
            COPY_THIS(animation_loop_frame);
            COPY_THIS(animation_speed);
            COPY_THIS(lifetime);
            COPY_THIS(decay_time);
            COPY_THIS(framebuffer_blend_function);
            COPY_THIS(map);
            COPY_THIS(maximum_sprite_extent);
            return copy;
        }
    };
    static_assert(sizeof(Decal<NativeEndian>) == 0x10C);

    ENDIAN_TEMPLATE(EndianType) struct DetailObjectCollectionObjectType {
        TagString name;
        std::uint8_t sequence_index;
        DetailObjectCollectionTypeFlags flags;
        std::uint8_t first_sprite_index;
        std::uint8_t sprite_count;
        EndianType<Fraction> color_override_factor;
        PAD(0x8);
        EndianType<float> near_fade_distance;
        EndianType<float> far_fade_distance;
        EndianType<float> size;
        PAD(0x4);
        ColorRGB<EndianType> minimum_color;
        ColorRGB<EndianType> maximum_color;
        EndianType<ColorARGBInt> ambient_color;
        PAD(0x4);
        ENDIAN_TEMPLATE(NewEndian) operator DetailObjectCollectionObjectType<NewEndian>() const {
            DetailObjectCollectionObjectType<NewEndian> copy = {};
            COPY_THIS(name);
            COPY_THIS(sequence_index);
            COPY_THIS(flags);
            COPY_THIS(first_sprite_index);
            COPY_THIS(sprite_count);
            COPY_THIS(color_override_factor);
            COPY_THIS(near_fade_distance);
            COPY_THIS(far_fade_distance);
            COPY_THIS(size);
            COPY_THIS(minimum_color);
            COPY_THIS(maximum_color);
            COPY_THIS(ambient_color);
            return copy;
        }
    };
    static_assert(sizeof(DetailObjectCollectionObjectType<NativeEndian>) == 0x60);

    ENDIAN_TEMPLATE(EndianType) struct DetailObjectCollection {
        EndianType<DetailObjectCollectionType> collection_type;
        PAD(0x2);
        EndianType<float> global_z_offset;
        PAD(0x2C);
        TagDependency<EndianType> sprite_plate;
        TagReflexive<EndianType, DetailObjectCollectionObjectType> types;
        PAD(0x30);
        ENDIAN_TEMPLATE(NewEndian) operator DetailObjectCollection<NewEndian>() const {
            DetailObjectCollection<NewEndian> copy = {};
            COPY_THIS(collection_type);
            COPY_THIS(global_z_offset);
            COPY_THIS(sprite_plate);
            COPY_THIS(types);
            return copy;
        }
    };
    static_assert(sizeof(DetailObjectCollection<NativeEndian>) == 0x80);

    ENDIAN_TEMPLATE(EndianType) struct Device : Object<EndianType> {
        EndianType<DeviceFlags> device_flags;
        EndianType<float> power_transition_time;
        EndianType<float> power_acceleration_time;
        EndianType<float> position_transition_time;
        EndianType<float> position_acceleration_time;
        EndianType<float> depowered_position_transition_time;
        EndianType<float> depowered_position_acceleration_time;
        EndianType<DeviceIn> device_a_in;
        EndianType<DeviceIn> device_b_in;
        EndianType<DeviceIn> device_c_in;
        EndianType<DeviceIn> device_d_in;
        TagDependency<EndianType> open;
        TagDependency<EndianType> close;
        TagDependency<EndianType> opened;
        TagDependency<EndianType> closed;
        TagDependency<EndianType> depowered;
        TagDependency<EndianType> repowered;
        EndianType<float> delay_time;
        PAD(0x8);
        TagDependency<EndianType> delay_effect;
        EndianType<float> automatic_activation_radius;
        PAD(0x54);
        LittleEndian<float> inverse_power_acceleration_time;
        LittleEndian<float> inverse_power_transition_time;
        LittleEndian<float> inverse_depowered_position_acceleration_time;
        LittleEndian<float> inverse_depowered_position_transition_time;
        LittleEndian<float> inverse_position_acceleration_time;
        LittleEndian<float> inverse_position_transition_time;
        LittleEndian<float> delay_time_ticks;
        ENDIAN_TEMPLATE(NewEndian) operator Device<NewEndian>() const {
            Device<NewEndian> copy = {};
            COPY_THIS(device_flags);
            COPY_THIS(power_transition_time);
            COPY_THIS(power_acceleration_time);
            COPY_THIS(position_transition_time);
            COPY_THIS(position_acceleration_time);
            COPY_THIS(depowered_position_transition_time);
            COPY_THIS(depowered_position_acceleration_time);
            COPY_THIS(device_a_in);
            COPY_THIS(device_b_in);
            COPY_THIS(device_c_in);
            COPY_THIS(device_d_in);
            COPY_THIS(open);
            COPY_THIS(close);
            COPY_THIS(opened);
            COPY_THIS(closed);
            COPY_THIS(depowered);
            COPY_THIS(repowered);
            COPY_THIS(delay_time);
            COPY_THIS(delay_effect);
            COPY_THIS(automatic_activation_radius);
            COPY_THIS(inverse_power_acceleration_time);
            COPY_THIS(inverse_power_transition_time);
            COPY_THIS(inverse_depowered_position_acceleration_time);
            COPY_THIS(inverse_depowered_position_transition_time);
            COPY_THIS(inverse_position_acceleration_time);
            COPY_THIS(inverse_position_transition_time);
            COPY_THIS(delay_time_ticks);
            COPY_THIS(object_type);
            COPY_THIS(flags);
            COPY_THIS(bounding_radius);
            COPY_THIS(bounding_offset);
            COPY_THIS(origin_offset);
            COPY_THIS(acceleration_scale);
            COPY_THIS(scales_change_colors);
            COPY_THIS(model);
            COPY_THIS(animation_graph);
            COPY_THIS(collision_model);
            COPY_THIS(physics);
            COPY_THIS(modifier_shader);
            COPY_THIS(creation_effect);
            COPY_THIS(render_bounding_radius);
            COPY_THIS(a_in);
            COPY_THIS(b_in);
            COPY_THIS(c_in);
            COPY_THIS(d_in);
            COPY_THIS(hud_text_message_index);
            COPY_THIS(forced_shader_permutation_index);
            COPY_THIS(attachments);
            COPY_THIS(widgets);
            COPY_THIS(functions);
            COPY_THIS(change_colors);
            COPY_THIS(predicted_resources);
            return copy;
        }
    };
    static_assert(sizeof(Device<NativeEndian>) == 0x290);

    ENDIAN_TEMPLATE(EndianType) struct DeviceControl : Device<EndianType> {
        EndianType<DeviceType> type;
        EndianType<DeviceTriggersWhen> triggers_when;
        EndianType<float> call_value;
        PAD(0x50);
        TagDependency<EndianType> on;
        TagDependency<EndianType> off;
        TagDependency<EndianType> deny;
        ENDIAN_TEMPLATE(NewEndian) operator DeviceControl<NewEndian>() const {
            DeviceControl<NewEndian> copy = {};
            COPY_THIS(type);
            COPY_THIS(triggers_when);
            COPY_THIS(call_value);
            COPY_THIS(on);
            COPY_THIS(off);
            COPY_THIS(deny);
            COPY_THIS(device_flags);
            COPY_THIS(power_transition_time);
            COPY_THIS(power_acceleration_time);
            COPY_THIS(position_transition_time);
            COPY_THIS(position_acceleration_time);
            COPY_THIS(depowered_position_transition_time);
            COPY_THIS(depowered_position_acceleration_time);
            COPY_THIS(device_a_in);
            COPY_THIS(device_b_in);
            COPY_THIS(device_c_in);
            COPY_THIS(device_d_in);
            COPY_THIS(open);
            COPY_THIS(close);
            COPY_THIS(opened);
            COPY_THIS(closed);
            COPY_THIS(depowered);
            COPY_THIS(repowered);
            COPY_THIS(delay_time);
            COPY_THIS(delay_effect);
            COPY_THIS(automatic_activation_radius);
            COPY_THIS(inverse_power_acceleration_time);
            COPY_THIS(inverse_power_transition_time);
            COPY_THIS(inverse_depowered_position_acceleration_time);
            COPY_THIS(inverse_depowered_position_transition_time);
            COPY_THIS(inverse_position_acceleration_time);
            COPY_THIS(inverse_position_transition_time);
            COPY_THIS(delay_time_ticks);
            COPY_THIS(object_type);
            COPY_THIS(flags);
            COPY_THIS(bounding_radius);
            COPY_THIS(bounding_offset);
            COPY_THIS(origin_offset);
            COPY_THIS(acceleration_scale);
            COPY_THIS(scales_change_colors);
            COPY_THIS(model);
            COPY_THIS(animation_graph);
            COPY_THIS(collision_model);
            COPY_THIS(physics);
            COPY_THIS(modifier_shader);
            COPY_THIS(creation_effect);
            COPY_THIS(render_bounding_radius);
            COPY_THIS(a_in);
            COPY_THIS(b_in);
            COPY_THIS(c_in);
            COPY_THIS(d_in);
            COPY_THIS(hud_text_message_index);
            COPY_THIS(forced_shader_permutation_index);
            COPY_THIS(attachments);
            COPY_THIS(widgets);
            COPY_THIS(functions);
            COPY_THIS(change_colors);
            COPY_THIS(predicted_resources);
            return copy;
        }
    };
    static_assert(sizeof(DeviceControl<NativeEndian>) == 0x318);

    ENDIAN_TEMPLATE(EndianType) struct DeviceLightFixture : Device<EndianType> {
        PAD(0x40);
        ENDIAN_TEMPLATE(NewEndian) operator DeviceLightFixture<NewEndian>() const {
            DeviceLightFixture<NewEndian> copy = {};
            COPY_THIS(device_flags);
            COPY_THIS(power_transition_time);
            COPY_THIS(power_acceleration_time);
            COPY_THIS(position_transition_time);
            COPY_THIS(position_acceleration_time);
            COPY_THIS(depowered_position_transition_time);
            COPY_THIS(depowered_position_acceleration_time);
            COPY_THIS(device_a_in);
            COPY_THIS(device_b_in);
            COPY_THIS(device_c_in);
            COPY_THIS(device_d_in);
            COPY_THIS(open);
            COPY_THIS(close);
            COPY_THIS(opened);
            COPY_THIS(closed);
            COPY_THIS(depowered);
            COPY_THIS(repowered);
            COPY_THIS(delay_time);
            COPY_THIS(delay_effect);
            COPY_THIS(automatic_activation_radius);
            COPY_THIS(inverse_power_acceleration_time);
            COPY_THIS(inverse_power_transition_time);
            COPY_THIS(inverse_depowered_position_acceleration_time);
            COPY_THIS(inverse_depowered_position_transition_time);
            COPY_THIS(inverse_position_acceleration_time);
            COPY_THIS(inverse_position_transition_time);
            COPY_THIS(delay_time_ticks);
            COPY_THIS(object_type);
            COPY_THIS(flags);
            COPY_THIS(bounding_radius);
            COPY_THIS(bounding_offset);
            COPY_THIS(origin_offset);
            COPY_THIS(acceleration_scale);
            COPY_THIS(scales_change_colors);
            COPY_THIS(model);
            COPY_THIS(animation_graph);
            COPY_THIS(collision_model);
            COPY_THIS(physics);
            COPY_THIS(modifier_shader);
            COPY_THIS(creation_effect);
            COPY_THIS(render_bounding_radius);
            COPY_THIS(a_in);
            COPY_THIS(b_in);
            COPY_THIS(c_in);
            COPY_THIS(d_in);
            COPY_THIS(hud_text_message_index);
            COPY_THIS(forced_shader_permutation_index);
            COPY_THIS(attachments);
            COPY_THIS(widgets);
            COPY_THIS(functions);
            COPY_THIS(change_colors);
            COPY_THIS(predicted_resources);
            return copy;
        }
    };
    static_assert(sizeof(DeviceLightFixture<NativeEndian>) == 0x2D0);

    ENDIAN_TEMPLATE(EndianType) struct DeviceMachine : Device<EndianType> {
        EndianType<MachineType> machine_type;
        EndianType<MachineFlags> machine_flags;
        EndianType<float> door_open_time;
        PAD(0x50);
        EndianType<MachineCollisionResponse> collision_response;
        EndianType<Index> elevator_node;
        PAD(0x34);
        LittleEndian<std::uint32_t> door_open_time_ticks;
        ENDIAN_TEMPLATE(NewEndian) operator DeviceMachine<NewEndian>() const {
            DeviceMachine<NewEndian> copy = {};
            COPY_THIS(machine_type);
            COPY_THIS(machine_flags);
            COPY_THIS(door_open_time);
            COPY_THIS(collision_response);
            COPY_THIS(elevator_node);
            COPY_THIS(door_open_time_ticks);
            COPY_THIS(device_flags);
            COPY_THIS(power_transition_time);
            COPY_THIS(power_acceleration_time);
            COPY_THIS(position_transition_time);
            COPY_THIS(position_acceleration_time);
            COPY_THIS(depowered_position_transition_time);
            COPY_THIS(depowered_position_acceleration_time);
            COPY_THIS(device_a_in);
            COPY_THIS(device_b_in);
            COPY_THIS(device_c_in);
            COPY_THIS(device_d_in);
            COPY_THIS(open);
            COPY_THIS(close);
            COPY_THIS(opened);
            COPY_THIS(closed);
            COPY_THIS(depowered);
            COPY_THIS(repowered);
            COPY_THIS(delay_time);
            COPY_THIS(delay_effect);
            COPY_THIS(automatic_activation_radius);
            COPY_THIS(inverse_power_acceleration_time);
            COPY_THIS(inverse_power_transition_time);
            COPY_THIS(inverse_depowered_position_acceleration_time);
            COPY_THIS(inverse_depowered_position_transition_time);
            COPY_THIS(inverse_position_acceleration_time);
            COPY_THIS(inverse_position_transition_time);
            COPY_THIS(delay_time_ticks);
            COPY_THIS(object_type);
            COPY_THIS(flags);
            COPY_THIS(bounding_radius);
            COPY_THIS(bounding_offset);
            COPY_THIS(origin_offset);
            COPY_THIS(acceleration_scale);
            COPY_THIS(scales_change_colors);
            COPY_THIS(model);
            COPY_THIS(animation_graph);
            COPY_THIS(collision_model);
            COPY_THIS(physics);
            COPY_THIS(modifier_shader);
            COPY_THIS(creation_effect);
            COPY_THIS(render_bounding_radius);
            COPY_THIS(a_in);
            COPY_THIS(b_in);
            COPY_THIS(c_in);
            COPY_THIS(d_in);
            COPY_THIS(hud_text_message_index);
            COPY_THIS(forced_shader_permutation_index);
            COPY_THIS(attachments);
            COPY_THIS(widgets);
            COPY_THIS(functions);
            COPY_THIS(change_colors);
            COPY_THIS(predicted_resources);
            return copy;
        }
    };
    static_assert(sizeof(DeviceMachine<NativeEndian>) == 0x324);

    ENDIAN_TEMPLATE(EndianType) struct Dialogue {
        PAD(0x2);
        PAD(0x2);
        PAD(0xC);
        TagDependency<EndianType> idle_noncombat;
        TagDependency<EndianType> idle_combat;
        TagDependency<EndianType> idle_flee;
        PAD(0x10);
        PAD(0x10);
        PAD(0x10);
        TagDependency<EndianType> pain_body_minor;
        TagDependency<EndianType> pain_body_major;
        TagDependency<EndianType> pain_shield;
        TagDependency<EndianType> pain_falling;
        TagDependency<EndianType> scream_fear;
        TagDependency<EndianType> scream_pain;
        TagDependency<EndianType> maimed_limb;
        TagDependency<EndianType> maimed_head;
        TagDependency<EndianType> death_quiet;
        TagDependency<EndianType> death_violent;
        TagDependency<EndianType> death_falling;
        TagDependency<EndianType> death_agonizing;
        TagDependency<EndianType> death_instant;
        TagDependency<EndianType> death_flying;
        PAD(0x10);
        TagDependency<EndianType> damaged_friend;
        TagDependency<EndianType> damaged_friend_player;
        TagDependency<EndianType> damaged_enemy;
        TagDependency<EndianType> damaged_enemy_cm;
        PAD(0x10);
        PAD(0x10);
        PAD(0x10);
        PAD(0x10);
        TagDependency<EndianType> hurt_friend;
        TagDependency<EndianType> hurt_friend_re;
        TagDependency<EndianType> hurt_friend_player;
        TagDependency<EndianType> hurt_enemy;
        TagDependency<EndianType> hurt_enemy_re;
        TagDependency<EndianType> hurt_enemy_cm;
        TagDependency<EndianType> hurt_enemy_bullet;
        TagDependency<EndianType> hurt_enemy_needler;
        TagDependency<EndianType> hurt_enemy_plasma;
        TagDependency<EndianType> hurt_enemy_sniper;
        TagDependency<EndianType> hurt_enemy_grenade;
        TagDependency<EndianType> hurt_enemy_explosion;
        TagDependency<EndianType> hurt_enemy_melee;
        TagDependency<EndianType> hurt_enemy_flame;
        TagDependency<EndianType> hurt_enemy_shotgun;
        TagDependency<EndianType> hurt_enemy_vehicle;
        TagDependency<EndianType> hurt_enemy_mountedweapon;
        PAD(0x10);
        PAD(0x10);
        PAD(0x10);
        TagDependency<EndianType> killed_friend;
        TagDependency<EndianType> killed_friend_cm;
        TagDependency<EndianType> killed_friend_player;
        TagDependency<EndianType> killed_friend_player_cm;
        TagDependency<EndianType> killed_enemy;
        TagDependency<EndianType> killed_enemy_cm;
        TagDependency<EndianType> killed_enemy_player;
        TagDependency<EndianType> killed_enemy_player_cm;
        TagDependency<EndianType> killed_enemy_covenant;
        TagDependency<EndianType> killed_enemy_covenant_cm;
        TagDependency<EndianType> killed_enemy_floodcombat;
        TagDependency<EndianType> killed_enemy_floodcombat_cm;
        TagDependency<EndianType> killed_enemy_floodcarrier;
        TagDependency<EndianType> killed_enemy_floodcarrier_cm;
        TagDependency<EndianType> killed_enemy_sentinel;
        TagDependency<EndianType> killed_enemy_sentinel_cm;
        TagDependency<EndianType> killed_enemy_bullet;
        TagDependency<EndianType> killed_enemy_needler;
        TagDependency<EndianType> killed_enemy_plasma;
        TagDependency<EndianType> killed_enemy_sniper;
        TagDependency<EndianType> killed_enemy_grenade;
        TagDependency<EndianType> killed_enemy_explosion;
        TagDependency<EndianType> killed_enemy_melee;
        TagDependency<EndianType> killed_enemy_flame;
        TagDependency<EndianType> killed_enemy_shotgun;
        TagDependency<EndianType> killed_enemy_vehicle;
        TagDependency<EndianType> killed_enemy_mountedweapon;
        TagDependency<EndianType> killing_spree;
        PAD(0x10);
        PAD(0x10);
        PAD(0x10);
        TagDependency<EndianType> player_kill_cm;
        TagDependency<EndianType> player_kill_bullet_cm;
        TagDependency<EndianType> player_kill_needler_cm;
        TagDependency<EndianType> player_kill_plasma_cm;
        TagDependency<EndianType> player_kill_sniper_cm;
        TagDependency<EndianType> anyone_kill_grenade_cm;
        TagDependency<EndianType> player_kill_explosion_cm;
        TagDependency<EndianType> player_kill_melee_cm;
        TagDependency<EndianType> player_kill_flame_cm;
        TagDependency<EndianType> player_kill_shotgun_cm;
        TagDependency<EndianType> player_kill_vehicle_cm;
        TagDependency<EndianType> player_kill_mountedweapon_cm;
        TagDependency<EndianType> player_killling_spree_cm;
        PAD(0x10);
        PAD(0x10);
        PAD(0x10);
        TagDependency<EndianType> friend_died;
        TagDependency<EndianType> friend_player_died;
        TagDependency<EndianType> friend_killed_by_friend;
        TagDependency<EndianType> friend_killed_by_friendly_player;
        TagDependency<EndianType> friend_killed_by_enemy;
        TagDependency<EndianType> friend_killed_by_enemy_player;
        TagDependency<EndianType> friend_killed_by_covenant;
        TagDependency<EndianType> friend_killed_by_flood;
        TagDependency<EndianType> friend_killed_by_sentinel;
        TagDependency<EndianType> friend_betrayed;
        PAD(0x10);
        PAD(0x10);
        TagDependency<EndianType> new_combat_alone;
        TagDependency<EndianType> new_enemy_recent_combat;
        TagDependency<EndianType> old_enemy_sighted;
        TagDependency<EndianType> unexpected_enemy;
        TagDependency<EndianType> dead_friend_found;
        TagDependency<EndianType> alliance_broken;
        TagDependency<EndianType> alliance_reformed;
        TagDependency<EndianType> grenade_throwing;
        TagDependency<EndianType> grenade_sighted;
        TagDependency<EndianType> grenade_startle;
        TagDependency<EndianType> grenade_danger_enemy;
        TagDependency<EndianType> grenade_danger_self;
        TagDependency<EndianType> grenade_danger_friend;
        PAD(0x10);
        PAD(0x10);
        TagDependency<EndianType> new_combat_group_re;
        TagDependency<EndianType> new_combat_nearby_re;
        TagDependency<EndianType> alert_friend;
        TagDependency<EndianType> alert_friend_re;
        TagDependency<EndianType> alert_lost_contact;
        TagDependency<EndianType> alert_lost_contact_re;
        TagDependency<EndianType> blocked;
        TagDependency<EndianType> blocked_re;
        TagDependency<EndianType> search_start;
        TagDependency<EndianType> search_query;
        TagDependency<EndianType> search_query_re;
        TagDependency<EndianType> search_report;
        TagDependency<EndianType> search_abandon;
        TagDependency<EndianType> search_group_abandon;
        TagDependency<EndianType> group_uncover;
        TagDependency<EndianType> group_uncover_re;
        TagDependency<EndianType> advance;
        TagDependency<EndianType> advance_re;
        TagDependency<EndianType> retreat;
        TagDependency<EndianType> retreat_re;
        TagDependency<EndianType> cover;
        PAD(0x10);
        PAD(0x10);
        PAD(0x10);
        PAD(0x10);
        TagDependency<EndianType> sighted_friend_player;
        TagDependency<EndianType> shooting;
        TagDependency<EndianType> shooting_vehicle;
        TagDependency<EndianType> shooting_berserk;
        TagDependency<EndianType> shooting_group;
        TagDependency<EndianType> shooting_traitor;
        TagDependency<EndianType> taunt;
        TagDependency<EndianType> taunt_re;
        TagDependency<EndianType> flee;
        TagDependency<EndianType> flee_re;
        TagDependency<EndianType> flee_leader_died;
        TagDependency<EndianType> attempted_flee;
        TagDependency<EndianType> attempted_flee_re;
        TagDependency<EndianType> lost_contact;
        TagDependency<EndianType> hiding_finished;
        TagDependency<EndianType> vehicle_entry;
        TagDependency<EndianType> vehicle_exit;
        TagDependency<EndianType> vehicle_woohoo;
        TagDependency<EndianType> vehicle_scared;
        TagDependency<EndianType> vehicle_collision;
        TagDependency<EndianType> partially_sighted;
        TagDependency<EndianType> nothing_there;
        TagDependency<EndianType> pleading;
        PAD(0x10);
        PAD(0x10);
        PAD(0x10);
        PAD(0x10);
        PAD(0x10);
        PAD(0x10);
        TagDependency<EndianType> surprise;
        TagDependency<EndianType> berserk;
        TagDependency<EndianType> melee_attack;
        TagDependency<EndianType> dive;
        TagDependency<EndianType> uncover_exclamation;
        TagDependency<EndianType> leap_attack;
        TagDependency<EndianType> resurrection;
        PAD(0x10);
        PAD(0x10);
        PAD(0x10);
        PAD(0x10);
        TagDependency<EndianType> celebration;
        TagDependency<EndianType> check_body_enemy;
        TagDependency<EndianType> check_body_friend;
        TagDependency<EndianType> shooting_dead_enemy;
        TagDependency<EndianType> shooting_dead_enemy_player;
        PAD(0x10);
        PAD(0x10);
        PAD(0x10);
        PAD(0x10);
        TagDependency<EndianType> alone;
        TagDependency<EndianType> unscathed;
        TagDependency<EndianType> seriously_wounded;
        TagDependency<EndianType> seriously_wounded_re;
        TagDependency<EndianType> massacre;
        TagDependency<EndianType> massacre_re;
        TagDependency<EndianType> rout;
        TagDependency<EndianType> rout_re;
        PAD(0x10);
        PAD(0x10);
        PAD(0x10);
        PAD(0x10);
        PAD(0x2F0);
        ENDIAN_TEMPLATE(NewEndian) operator Dialogue<NewEndian>() const {
            Dialogue<NewEndian> copy = {};
            COPY_THIS(idle_noncombat);
            COPY_THIS(idle_combat);
            COPY_THIS(idle_flee);
            COPY_THIS(pain_body_minor);
            COPY_THIS(pain_body_major);
            COPY_THIS(pain_shield);
            COPY_THIS(pain_falling);
            COPY_THIS(scream_fear);
            COPY_THIS(scream_pain);
            COPY_THIS(maimed_limb);
            COPY_THIS(maimed_head);
            COPY_THIS(death_quiet);
            COPY_THIS(death_violent);
            COPY_THIS(death_falling);
            COPY_THIS(death_agonizing);
            COPY_THIS(death_instant);
            COPY_THIS(death_flying);
            COPY_THIS(damaged_friend);
            COPY_THIS(damaged_friend_player);
            COPY_THIS(damaged_enemy);
            COPY_THIS(damaged_enemy_cm);
            COPY_THIS(hurt_friend);
            COPY_THIS(hurt_friend_re);
            COPY_THIS(hurt_friend_player);
            COPY_THIS(hurt_enemy);
            COPY_THIS(hurt_enemy_re);
            COPY_THIS(hurt_enemy_cm);
            COPY_THIS(hurt_enemy_bullet);
            COPY_THIS(hurt_enemy_needler);
            COPY_THIS(hurt_enemy_plasma);
            COPY_THIS(hurt_enemy_sniper);
            COPY_THIS(hurt_enemy_grenade);
            COPY_THIS(hurt_enemy_explosion);
            COPY_THIS(hurt_enemy_melee);
            COPY_THIS(hurt_enemy_flame);
            COPY_THIS(hurt_enemy_shotgun);
            COPY_THIS(hurt_enemy_vehicle);
            COPY_THIS(hurt_enemy_mountedweapon);
            COPY_THIS(killed_friend);
            COPY_THIS(killed_friend_cm);
            COPY_THIS(killed_friend_player);
            COPY_THIS(killed_friend_player_cm);
            COPY_THIS(killed_enemy);
            COPY_THIS(killed_enemy_cm);
            COPY_THIS(killed_enemy_player);
            COPY_THIS(killed_enemy_player_cm);
            COPY_THIS(killed_enemy_covenant);
            COPY_THIS(killed_enemy_covenant_cm);
            COPY_THIS(killed_enemy_floodcombat);
            COPY_THIS(killed_enemy_floodcombat_cm);
            COPY_THIS(killed_enemy_floodcarrier);
            COPY_THIS(killed_enemy_floodcarrier_cm);
            COPY_THIS(killed_enemy_sentinel);
            COPY_THIS(killed_enemy_sentinel_cm);
            COPY_THIS(killed_enemy_bullet);
            COPY_THIS(killed_enemy_needler);
            COPY_THIS(killed_enemy_plasma);
            COPY_THIS(killed_enemy_sniper);
            COPY_THIS(killed_enemy_grenade);
            COPY_THIS(killed_enemy_explosion);
            COPY_THIS(killed_enemy_melee);
            COPY_THIS(killed_enemy_flame);
            COPY_THIS(killed_enemy_shotgun);
            COPY_THIS(killed_enemy_vehicle);
            COPY_THIS(killed_enemy_mountedweapon);
            COPY_THIS(killing_spree);
            COPY_THIS(player_kill_cm);
            COPY_THIS(player_kill_bullet_cm);
            COPY_THIS(player_kill_needler_cm);
            COPY_THIS(player_kill_plasma_cm);
            COPY_THIS(player_kill_sniper_cm);
            COPY_THIS(anyone_kill_grenade_cm);
            COPY_THIS(player_kill_explosion_cm);
            COPY_THIS(player_kill_melee_cm);
            COPY_THIS(player_kill_flame_cm);
            COPY_THIS(player_kill_shotgun_cm);
            COPY_THIS(player_kill_vehicle_cm);
            COPY_THIS(player_kill_mountedweapon_cm);
            COPY_THIS(player_killling_spree_cm);
            COPY_THIS(friend_died);
            COPY_THIS(friend_player_died);
            COPY_THIS(friend_killed_by_friend);
            COPY_THIS(friend_killed_by_friendly_player);
            COPY_THIS(friend_killed_by_enemy);
            COPY_THIS(friend_killed_by_enemy_player);
            COPY_THIS(friend_killed_by_covenant);
            COPY_THIS(friend_killed_by_flood);
            COPY_THIS(friend_killed_by_sentinel);
            COPY_THIS(friend_betrayed);
            COPY_THIS(new_combat_alone);
            COPY_THIS(new_enemy_recent_combat);
            COPY_THIS(old_enemy_sighted);
            COPY_THIS(unexpected_enemy);
            COPY_THIS(dead_friend_found);
            COPY_THIS(alliance_broken);
            COPY_THIS(alliance_reformed);
            COPY_THIS(grenade_throwing);
            COPY_THIS(grenade_sighted);
            COPY_THIS(grenade_startle);
            COPY_THIS(grenade_danger_enemy);
            COPY_THIS(grenade_danger_self);
            COPY_THIS(grenade_danger_friend);
            COPY_THIS(new_combat_group_re);
            COPY_THIS(new_combat_nearby_re);
            COPY_THIS(alert_friend);
            COPY_THIS(alert_friend_re);
            COPY_THIS(alert_lost_contact);
            COPY_THIS(alert_lost_contact_re);
            COPY_THIS(blocked);
            COPY_THIS(blocked_re);
            COPY_THIS(search_start);
            COPY_THIS(search_query);
            COPY_THIS(search_query_re);
            COPY_THIS(search_report);
            COPY_THIS(search_abandon);
            COPY_THIS(search_group_abandon);
            COPY_THIS(group_uncover);
            COPY_THIS(group_uncover_re);
            COPY_THIS(advance);
            COPY_THIS(advance_re);
            COPY_THIS(retreat);
            COPY_THIS(retreat_re);
            COPY_THIS(cover);
            COPY_THIS(sighted_friend_player);
            COPY_THIS(shooting);
            COPY_THIS(shooting_vehicle);
            COPY_THIS(shooting_berserk);
            COPY_THIS(shooting_group);
            COPY_THIS(shooting_traitor);
            COPY_THIS(taunt);
            COPY_THIS(taunt_re);
            COPY_THIS(flee);
            COPY_THIS(flee_re);
            COPY_THIS(flee_leader_died);
            COPY_THIS(attempted_flee);
            COPY_THIS(attempted_flee_re);
            COPY_THIS(lost_contact);
            COPY_THIS(hiding_finished);
            COPY_THIS(vehicle_entry);
            COPY_THIS(vehicle_exit);
            COPY_THIS(vehicle_woohoo);
            COPY_THIS(vehicle_scared);
            COPY_THIS(vehicle_collision);
            COPY_THIS(partially_sighted);
            COPY_THIS(nothing_there);
            COPY_THIS(pleading);
            COPY_THIS(surprise);
            COPY_THIS(berserk);
            COPY_THIS(melee_attack);
            COPY_THIS(dive);
            COPY_THIS(uncover_exclamation);
            COPY_THIS(leap_attack);
            COPY_THIS(resurrection);
            COPY_THIS(celebration);
            COPY_THIS(check_body_enemy);
            COPY_THIS(check_body_friend);
            COPY_THIS(shooting_dead_enemy);
            COPY_THIS(shooting_dead_enemy_player);
            COPY_THIS(alone);
            COPY_THIS(unscathed);
            COPY_THIS(seriously_wounded);
            COPY_THIS(seriously_wounded_re);
            COPY_THIS(massacre);
            COPY_THIS(massacre_re);
            COPY_THIS(rout);
            COPY_THIS(rout_re);
            return copy;
        }
    };
    static_assert(sizeof(Dialogue<NativeEndian>) == 0x1010);

    ENDIAN_TEMPLATE(EndianType) struct EffectLocation {
        TagString marker_name;
        ENDIAN_TEMPLATE(NewEndian) operator EffectLocation<NewEndian>() const {
            EffectLocation<NewEndian> copy;
            COPY_THIS(marker_name);
            return copy;
        }
    };
    static_assert(sizeof(EffectLocation<NativeEndian>) == 0x20);

    ENDIAN_TEMPLATE(EndianType) struct EffectPart {
        EndianType<EffectCreateIn> create_in;
        EndianType<EffectViolenceMode> violence_mode;
        EndianType<Index> location;
        EndianType<EffectPartFlags> flags;
        PAD(0xC);
        EndianType<std::uint32_t> type_class;
        TagDependency<EndianType> type;
        PAD(0x18);
        Bounds<EndianType<float>> velocity_bounds;
        EndianType<Angle> velocity_cone_angle;
        Bounds<EndianType<Angle>> angular_velocity_bounds;
        Bounds<EndianType<float>> radius_modifier_bounds;
        PAD(0x4);
        EndianType<EffectPartScalesValues> a_scales_values;
        EndianType<EffectPartScalesValues> b_scales_values;
        ENDIAN_TEMPLATE(NewEndian) operator EffectPart<NewEndian>() const {
            EffectPart<NewEndian> copy = {};
            COPY_THIS(create_in);
            COPY_THIS(violence_mode);
            COPY_THIS(location);
            COPY_THIS(flags);
            COPY_THIS(type_class);
            COPY_THIS(type);
            COPY_THIS(velocity_bounds);
            COPY_THIS(velocity_cone_angle);
            COPY_THIS(angular_velocity_bounds);
            COPY_THIS(radius_modifier_bounds);
            COPY_THIS(a_scales_values);
            COPY_THIS(b_scales_values);
            return copy;
        }
    };
    static_assert(sizeof(EffectPart<NativeEndian>) == 0x68);

    ENDIAN_TEMPLATE(EndianType) struct EffectParticle {
        EndianType<EffectCreateIn> create_in;
        EndianType<EffectViolenceMode> violence_mode;
        EndianType<EffectCreate> create;
        PAD(0x2);
        EndianType<Index> location;
        PAD(0x2);
        Euler2D<EndianType> relative_direction;
        Point3D<EndianType> relative_offset;
        Vector3D<LittleEndian> relative_direction_vector;
        PAD(0x28);
        TagDependency<EndianType> particle_type;
        EndianType<EffectParticleFlags> flags;
        EndianType<EffectDistributionFunction> distribution_function;
        PAD(0x2);
        Bounds<EndianType<std::int16_t>> count;
        Bounds<EndianType<float>> distribution_radius;
        PAD(0xC);
        Bounds<EndianType<float>> velocity;
        EndianType<Angle> velocity_cone_angle;
        Bounds<EndianType<Angle>> angular_velocity;
        PAD(0x8);
        Bounds<EndianType<float>> radius;
        PAD(0x8);
        ColorARGB<EndianType> tint_lower_bound;
        ColorARGB<EndianType> tint_upper_bound;
        PAD(0x10);
        EndianType<EffectParticleScalesValues> a_scales_values;
        EndianType<EffectParticleScalesValues> b_scales_values;
        ENDIAN_TEMPLATE(NewEndian) operator EffectParticle<NewEndian>() const {
            EffectParticle<NewEndian> copy = {};
            COPY_THIS(create_in);
            COPY_THIS(violence_mode);
            COPY_THIS(create);
            COPY_THIS(location);
            COPY_THIS(relative_direction);
            COPY_THIS(relative_offset);
            COPY_THIS(relative_direction_vector);
            COPY_THIS(particle_type);
            COPY_THIS(flags);
            COPY_THIS(distribution_function);
            COPY_THIS(count);
            COPY_THIS(distribution_radius);
            COPY_THIS(velocity);
            COPY_THIS(velocity_cone_angle);
            COPY_THIS(angular_velocity);
            COPY_THIS(radius);
            COPY_THIS(tint_lower_bound);
            COPY_THIS(tint_upper_bound);
            COPY_THIS(a_scales_values);
            COPY_THIS(b_scales_values);
            return copy;
        }
    };
    static_assert(sizeof(EffectParticle<NativeEndian>) == 0xE8);

    ENDIAN_TEMPLATE(EndianType) struct EffectEvent {
        PAD(0x4);
        EndianType<Fraction> skip_fraction;
        Bounds<EndianType<float>> delay_bounds;
        Bounds<EndianType<float>> duration_bounds;
        PAD(0x14);
        TagReflexive<EndianType, EffectPart> parts;
        TagReflexive<EndianType, EffectParticle> particles;
        ENDIAN_TEMPLATE(NewEndian) operator EffectEvent<NewEndian>() const {
            EffectEvent<NewEndian> copy = {};
            COPY_THIS(skip_fraction);
            COPY_THIS(delay_bounds);
            COPY_THIS(duration_bounds);
            COPY_THIS(parts);
            COPY_THIS(particles);
            return copy;
        }
    };
    static_assert(sizeof(EffectEvent<NativeEndian>) == 0x44);

    ENDIAN_TEMPLATE(EndianType) struct Effect {
        EndianType<EffectFlags> flags;
        EndianType<Index> loop_start_event;
        EndianType<Index> loop_stop_event;
        LittleEndian<float> maximum_damage_radius;
        PAD(0x1C);
        TagReflexive<EndianType, EffectLocation> locations;
        TagReflexive<EndianType, EffectEvent> events;
        ENDIAN_TEMPLATE(NewEndian) operator Effect<NewEndian>() const {
            Effect<NewEndian> copy = {};
            COPY_THIS(flags);
            COPY_THIS(loop_start_event);
            COPY_THIS(loop_stop_event);
            COPY_THIS(maximum_damage_radius);
            COPY_THIS(locations);
            COPY_THIS(events);
            return copy;
        }
    };
    static_assert(sizeof(Effect<NativeEndian>) == 0x40);

    ENDIAN_TEMPLATE(EndianType) struct Item : Object<EndianType> {
        EndianType<ItemFlags> item_flags;
        EndianType<Index> pickup_text_index;
        EndianType<std::int16_t> sort_order;
        EndianType<float> scale;
        EndianType<std::int16_t> hud_message_value_scale;
        PAD(0x2);
        PAD(0x10);
        EndianType<ItemFunctionIn> item_a_in;
        EndianType<ItemFunctionIn> item_b_in;
        EndianType<ItemFunctionIn> item_c_in;
        EndianType<ItemFunctionIn> item_d_in;
        PAD(0xA4);
        TagDependency<EndianType> material_effects;
        TagDependency<EndianType> collision_sound;
        PAD(0x78);
        Bounds<EndianType<float>> detonation_delay;
        TagDependency<EndianType> detonating_effect;
        TagDependency<EndianType> detonation_effect;
        ENDIAN_TEMPLATE(NewEndian) operator Item<NewEndian>() const {
            Item<NewEndian> copy = {};
            COPY_THIS(item_flags);
            COPY_THIS(pickup_text_index);
            COPY_THIS(sort_order);
            COPY_THIS(scale);
            COPY_THIS(hud_message_value_scale);
            COPY_THIS(item_a_in);
            COPY_THIS(item_b_in);
            COPY_THIS(item_c_in);
            COPY_THIS(item_d_in);
            COPY_THIS(material_effects);
            COPY_THIS(collision_sound);
            COPY_THIS(detonation_delay);
            COPY_THIS(detonating_effect);
            COPY_THIS(detonation_effect);
            COPY_THIS(object_type);
            COPY_THIS(flags);
            COPY_THIS(bounding_radius);
            COPY_THIS(bounding_offset);
            COPY_THIS(origin_offset);
            COPY_THIS(acceleration_scale);
            COPY_THIS(scales_change_colors);
            COPY_THIS(model);
            COPY_THIS(animation_graph);
            COPY_THIS(collision_model);
            COPY_THIS(physics);
            COPY_THIS(modifier_shader);
            COPY_THIS(creation_effect);
            COPY_THIS(render_bounding_radius);
            COPY_THIS(a_in);
            COPY_THIS(b_in);
            COPY_THIS(c_in);
            COPY_THIS(d_in);
            COPY_THIS(hud_text_message_index);
            COPY_THIS(forced_shader_permutation_index);
            COPY_THIS(attachments);
            COPY_THIS(widgets);
            COPY_THIS(functions);
            COPY_THIS(change_colors);
            COPY_THIS(predicted_resources);
            return copy;
        }
    };
    static_assert(sizeof(Item<NativeEndian>) == 0x308);

    ENDIAN_TEMPLATE(EndianType) struct Equipment : Item<EndianType> {
        EndianType<EquipmentPowerupType> powerup_type;
        EndianType<GrenadeType> grenade_type;
        EndianType<float> powerup_time;
        TagDependency<EndianType> pickup_sound;
        PAD(0x90);
        ENDIAN_TEMPLATE(NewEndian) operator Equipment<NewEndian>() const {
            Equipment<NewEndian> copy = {};
            COPY_THIS(powerup_type);
            COPY_THIS(grenade_type);
            COPY_THIS(powerup_time);
            COPY_THIS(pickup_sound);
            COPY_THIS(item_flags);
            COPY_THIS(pickup_text_index);
            COPY_THIS(sort_order);
            COPY_THIS(scale);
            COPY_THIS(hud_message_value_scale);
            COPY_THIS(item_a_in);
            COPY_THIS(item_b_in);
            COPY_THIS(item_c_in);
            COPY_THIS(item_d_in);
            COPY_THIS(material_effects);
            COPY_THIS(collision_sound);
            COPY_THIS(detonation_delay);
            COPY_THIS(detonating_effect);
            COPY_THIS(detonation_effect);
            COPY_THIS(object_type);
            COPY_THIS(flags);
            COPY_THIS(bounding_radius);
            COPY_THIS(bounding_offset);
            COPY_THIS(origin_offset);
            COPY_THIS(acceleration_scale);
            COPY_THIS(scales_change_colors);
            COPY_THIS(model);
            COPY_THIS(animation_graph);
            COPY_THIS(collision_model);
            COPY_THIS(physics);
            COPY_THIS(modifier_shader);
            COPY_THIS(creation_effect);
            COPY_THIS(render_bounding_radius);
            COPY_THIS(a_in);
            COPY_THIS(b_in);
            COPY_THIS(c_in);
            COPY_THIS(d_in);
            COPY_THIS(hud_text_message_index);
            COPY_THIS(forced_shader_permutation_index);
            COPY_THIS(attachments);
            COPY_THIS(widgets);
            COPY_THIS(functions);
            COPY_THIS(change_colors);
            COPY_THIS(predicted_resources);
            return copy;
        }
    };
    static_assert(sizeof(Equipment<NativeEndian>) == 0x3B0);

    ENDIAN_TEMPLATE(EndianType) struct FlagAttachmentPoint {
        EndianType<std::int16_t> height_to_next_attachment;
        PAD(0x2);
        PAD(0x10);
        TagString marker_name;
        ENDIAN_TEMPLATE(NewEndian) operator FlagAttachmentPoint<NewEndian>() const {
            FlagAttachmentPoint<NewEndian> copy = {};
            COPY_THIS(height_to_next_attachment);
            COPY_THIS(marker_name);
            return copy;
        }
    };
    static_assert(sizeof(FlagAttachmentPoint<NativeEndian>) == 0x34);

    ENDIAN_TEMPLATE(EndianType) struct Flag {
        EndianType<IsUnusedFlag> flags;
        EndianType<FlagTrailingEdgeShape> trailing_edge_shape;
        EndianType<std::int16_t> trailing_edge_shape_offset;
        EndianType<FlagAttachedEdgeShape> attached_edge_shape;
        PAD(0x2);
        EndianType<std::int16_t> width;
        EndianType<std::int16_t> height;
        EndianType<float> cell_width;
        EndianType<float> cell_height;
        TagDependency<EndianType> red_flag_shader;
        TagDependency<EndianType> physics;
        EndianType<float> wind_noise;
        PAD(0x8);
        TagDependency<EndianType> blue_flag_shader;
        TagReflexive<EndianType, FlagAttachmentPoint> attachment_points;
        ENDIAN_TEMPLATE(NewEndian) operator Flag<NewEndian>() const {
            Flag<NewEndian> copy = {};
            COPY_THIS(flags);
            COPY_THIS(trailing_edge_shape);
            COPY_THIS(trailing_edge_shape_offset);
            COPY_THIS(attached_edge_shape);
            COPY_THIS(width);
            COPY_THIS(height);
            COPY_THIS(cell_width);
            COPY_THIS(cell_height);
            COPY_THIS(red_flag_shader);
            COPY_THIS(physics);
            COPY_THIS(wind_noise);
            COPY_THIS(blue_flag_shader);
            COPY_THIS(attachment_points);
            return copy;
        }
    };
    static_assert(sizeof(Flag<NativeEndian>) == 0x60);

    ENDIAN_TEMPLATE(EndianType) struct Fog {
        EndianType<FogFlags> flags;
        PAD(0x4);
        PAD(0x4C);
        PAD(0x4);
        EndianType<Fraction> maximum_density;
        PAD(0x4);
        EndianType<float> opaque_distance;
        PAD(0x4);
        EndianType<float> opaque_depth;
        PAD(0x8);
        EndianType<float> distance_to_water_plane;
        ColorRGB<EndianType> color;
        EndianType<FogScreenFlags> flags_1;
        EndianType<std::int16_t> layer_count;
        Bounds<EndianType<float>> distance_gradient;
        Bounds<EndianType<Fraction>> density_gradient;
        EndianType<float> start_distance_from_fog_plane;
        PAD(0x4);
        EndianType<ColorARGBInt> screen_layers_color;
        EndianType<Fraction> rotation_multiplier;
        EndianType<Fraction> strafing_multiplier;
        EndianType<Fraction> zoom_multiplier;
        PAD(0x8);
        EndianType<float> map_scale;
        TagDependency<EndianType> map;
        EndianType<float> animation_period;
        PAD(0x4);
        Bounds<EndianType<float>> wind_velocity;
        Bounds<EndianType<float>> wind_period;
        EndianType<Fraction> wind_acceleration_weight;
        EndianType<Fraction> wind_perpendicular_weight;
        PAD(0x8);
        TagDependency<EndianType> background_sound;
        TagDependency<EndianType> sound_environment;
        PAD(0x78);
        ENDIAN_TEMPLATE(NewEndian) operator Fog<NewEndian>() const {
            Fog<NewEndian> copy = {};
            COPY_THIS(flags);
            COPY_THIS(maximum_density);
            COPY_THIS(opaque_distance);
            COPY_THIS(opaque_depth);
            COPY_THIS(distance_to_water_plane);
            COPY_THIS(color);
            COPY_THIS(flags_1);
            COPY_THIS(layer_count);
            COPY_THIS(distance_gradient);
            COPY_THIS(density_gradient);
            COPY_THIS(start_distance_from_fog_plane);
            COPY_THIS(screen_layers_color);
            COPY_THIS(rotation_multiplier);
            COPY_THIS(strafing_multiplier);
            COPY_THIS(zoom_multiplier);
            COPY_THIS(map_scale);
            COPY_THIS(map);
            COPY_THIS(animation_period);
            COPY_THIS(wind_velocity);
            COPY_THIS(wind_period);
            COPY_THIS(wind_acceleration_weight);
            COPY_THIS(wind_perpendicular_weight);
            COPY_THIS(background_sound);
            COPY_THIS(sound_environment);
            return copy;
        }
    };
    static_assert(sizeof(Fog<NativeEndian>) == 0x18C);

    ENDIAN_TEMPLATE(EndianType) struct FontCharacterIndex {
        EndianType<Index> character_index;
        ENDIAN_TEMPLATE(NewEndian) operator FontCharacterIndex<NewEndian>() const {
            FontCharacterIndex<NewEndian> copy;
            COPY_THIS(character_index);
            return copy;
        }
    };
    static_assert(sizeof(FontCharacterIndex<NativeEndian>) == 0x2);

    ENDIAN_TEMPLATE(EndianType) struct FontCharacterTables {
        TagReflexive<EndianType, FontCharacterIndex> character_table;
        ENDIAN_TEMPLATE(NewEndian) operator FontCharacterTables<NewEndian>() const {
            FontCharacterTables<NewEndian> copy;
            COPY_THIS(character_table);
            return copy;
        }
    };
    static_assert(sizeof(FontCharacterTables<NativeEndian>) == 0xC);

    ENDIAN_TEMPLATE(EndianType) struct FontCharacter {
        EndianType<std::uint16_t> character;
        EndianType<std::int16_t> character_width;
        EndianType<std::int16_t> bitmap_width;
        EndianType<std::int16_t> bitmap_height;
        EndianType<std::int16_t> bitmap_origin_x;
        EndianType<std::int16_t> bitmap_origin_y;
        EndianType<std::uint16_t> hardware_character_index;
        PAD(0x2);
        EndianType<std::int32_t> pixels_offset;
        ENDIAN_TEMPLATE(NewEndian) operator FontCharacter<NewEndian>() const {
            FontCharacter<NewEndian> copy = {};
            COPY_THIS(character);
            COPY_THIS(character_width);
            COPY_THIS(bitmap_width);
            COPY_THIS(bitmap_height);
            COPY_THIS(bitmap_origin_x);
            COPY_THIS(bitmap_origin_y);
            COPY_THIS(hardware_character_index);
            COPY_THIS(pixels_offset);
            return copy;
        }
    };
    static_assert(sizeof(FontCharacter<NativeEndian>) == 0x14);

    ENDIAN_TEMPLATE(EndianType) struct Font {
        EndianType<FontFlags> flags;
        EndianType<std::int16_t> ascending_height;
        EndianType<std::int16_t> descending_height;
        EndianType<std::int16_t> leading_height;
        EndianType<std::int16_t> leading_width;
        PAD(0x24);
        TagReflexive<EndianType, FontCharacterTables> character_tables;
        TagDependency<EndianType> bold;
        TagDependency<EndianType> italic;
        TagDependency<EndianType> condense;
        TagDependency<EndianType> underline;
        TagReflexive<EndianType, FontCharacter> characters;
        TagDataOffset<EndianType> pixels;
        ENDIAN_TEMPLATE(NewEndian) operator Font<NewEndian>() const {
            Font<NewEndian> copy = {};
            COPY_THIS(flags);
            COPY_THIS(ascending_height);
            COPY_THIS(descending_height);
            COPY_THIS(leading_height);
            COPY_THIS(leading_width);
            COPY_THIS(character_tables);
            COPY_THIS(bold);
            COPY_THIS(italic);
            COPY_THIS(condense);
            COPY_THIS(underline);
            COPY_THIS(characters);
            COPY_THIS(pixels);
            return copy;
        }
    };
    static_assert(sizeof(Font<NativeEndian>) == 0x9C);

    ENDIAN_TEMPLATE(EndianType) struct Garbage : Item<EndianType> {
        PAD(0xA8);
        ENDIAN_TEMPLATE(NewEndian) operator Garbage<NewEndian>() const {
            Garbage<NewEndian> copy = {};
            COPY_THIS(item_flags);
            COPY_THIS(pickup_text_index);
            COPY_THIS(sort_order);
            COPY_THIS(scale);
            COPY_THIS(hud_message_value_scale);
            COPY_THIS(item_a_in);
            COPY_THIS(item_b_in);
            COPY_THIS(item_c_in);
            COPY_THIS(item_d_in);
            COPY_THIS(material_effects);
            COPY_THIS(collision_sound);
            COPY_THIS(detonation_delay);
            COPY_THIS(detonating_effect);
            COPY_THIS(detonation_effect);
            COPY_THIS(object_type);
            COPY_THIS(flags);
            COPY_THIS(bounding_radius);
            COPY_THIS(bounding_offset);
            COPY_THIS(origin_offset);
            COPY_THIS(acceleration_scale);
            COPY_THIS(scales_change_colors);
            COPY_THIS(model);
            COPY_THIS(animation_graph);
            COPY_THIS(collision_model);
            COPY_THIS(physics);
            COPY_THIS(modifier_shader);
            COPY_THIS(creation_effect);
            COPY_THIS(render_bounding_radius);
            COPY_THIS(a_in);
            COPY_THIS(b_in);
            COPY_THIS(c_in);
            COPY_THIS(d_in);
            COPY_THIS(hud_text_message_index);
            COPY_THIS(forced_shader_permutation_index);
            COPY_THIS(attachments);
            COPY_THIS(widgets);
            COPY_THIS(functions);
            COPY_THIS(change_colors);
            COPY_THIS(predicted_resources);
            return copy;
        }
    };
    static_assert(sizeof(Garbage<NativeEndian>) == 0x3B0);

    ENDIAN_TEMPLATE(EndianType) struct ModelVertexUncompressed {
        Point3D<EndianType> position;
        Vector3D<EndianType> normal;
        Vector3D<EndianType> binormal;
        Vector3D<EndianType> tangent;
        Point2D<EndianType> texture_coords;
        EndianType<Index> node0_index;
        EndianType<Index> node1_index;
        EndianType<float> node0_weight;
        EndianType<float> node1_weight;
        ENDIAN_TEMPLATE(NewEndian) operator ModelVertexUncompressed<NewEndian>() const {
            ModelVertexUncompressed<NewEndian> copy;
            COPY_THIS(position);
            COPY_THIS(normal);
            COPY_THIS(binormal);
            COPY_THIS(tangent);
            COPY_THIS(texture_coords);
            COPY_THIS(node0_index);
            COPY_THIS(node1_index);
            COPY_THIS(node0_weight);
            COPY_THIS(node1_weight);
            return copy;
        }
    };
    static_assert(sizeof(ModelVertexUncompressed<NativeEndian>) == 0x44);

    ENDIAN_TEMPLATE(EndianType) struct ModelVertexCompressed {
        Point3D<EndianType> position;
        EndianType<std::uint32_t> normal;
        EndianType<std::uint32_t> binormal;
        EndianType<std::uint32_t> tangent;
        EndianType<std::int16_t> texture_coordinate_u;
        EndianType<std::int16_t> texture_coordinate_v;
        std::int8_t node0_index;
        std::int8_t node1_index;
        EndianType<std::uint16_t> node0_weight;
        ENDIAN_TEMPLATE(NewEndian) operator ModelVertexCompressed<NewEndian>() const {
            ModelVertexCompressed<NewEndian> copy;
            COPY_THIS(position);
            COPY_THIS(normal);
            COPY_THIS(binormal);
            COPY_THIS(tangent);
            COPY_THIS(texture_coordinate_u);
            COPY_THIS(texture_coordinate_v);
            COPY_THIS(node0_index);
            COPY_THIS(node1_index);
            COPY_THIS(node0_weight);
            return copy;
        }
    };
    static_assert(sizeof(ModelVertexCompressed<NativeEndian>) == 0x20);

    ENDIAN_TEMPLATE(EndianType) struct ModelTriangle {
        EndianType<Index> vertex0_index;
        EndianType<Index> vertex1_index;
        EndianType<Index> vertex2_index;
        ENDIAN_TEMPLATE(NewEndian) operator ModelTriangle<NewEndian>() const {
            ModelTriangle<NewEndian> copy;
            COPY_THIS(vertex0_index);
            COPY_THIS(vertex1_index);
            COPY_THIS(vertex2_index);
            return copy;
        }
    };
    static_assert(sizeof(ModelTriangle<NativeEndian>) == 0x6);

    ENDIAN_TEMPLATE(EndianType) struct ModelGeometryPart {
        EndianType<ModelGeometryPartFlags> flags;
        EndianType<Index> shader_index;
        std::uint8_t prev_filthy_part_index;
        std::uint8_t next_filthy_part_index;
        EndianType<Index> centroid_primary_node;
        EndianType<Index> centroid_secondary_node;
        EndianType<Fraction> centroid_primary_weight;
        EndianType<Fraction> centroid_secondary_weight;
        Point3D<EndianType> centroid;
        TagReflexive<EndianType, ModelVertexUncompressed> uncompressed_vertices;
        TagReflexive<EndianType, ModelVertexCompressed> compressed_vertices;
        TagReflexive<EndianType, ModelTriangle> triangles;
        LittleEndian<TriangleBufferType> triangle_buffer_type;
        PAD(0x2);
        LittleEndian<std::uint32_t> triangle_count;
        LittleEndian<std::uint32_t> triangle_offset;
        LittleEndian<std::uint32_t> triangle_offset_2;
        LittleEndian<VertexType> vertex_type;
        PAD(0x2);
        LittleEndian<std::uint32_t> vertex_count;
        PAD(0x4);
        LittleEndian<Pointer> vertex_pointer;
        EndianType<std::uint32_t> vertex_offset;
        ENDIAN_TEMPLATE(NewEndian) operator ModelGeometryPart<NewEndian>() const {
            ModelGeometryPart<NewEndian> copy = {};
            COPY_THIS(flags);
            COPY_THIS(shader_index);
            COPY_THIS(prev_filthy_part_index);
            COPY_THIS(next_filthy_part_index);
            COPY_THIS(centroid_primary_node);
            COPY_THIS(centroid_secondary_node);
            COPY_THIS(centroid_primary_weight);
            COPY_THIS(centroid_secondary_weight);
            COPY_THIS(centroid);
            COPY_THIS(uncompressed_vertices);
            COPY_THIS(compressed_vertices);
            COPY_THIS(triangles);
            COPY_THIS(triangle_buffer_type);
            COPY_THIS(triangle_count);
            COPY_THIS(triangle_offset);
            COPY_THIS(triangle_offset_2);
            COPY_THIS(vertex_type);
            COPY_THIS(vertex_count);
            COPY_THIS(vertex_pointer);
            COPY_THIS(vertex_offset);
            return copy;
        }
    };
    static_assert(sizeof(ModelGeometryPart<NativeEndian>) == 0x68);

    ENDIAN_TEMPLATE(EndianType) struct GBXModelGeometryPart : ModelGeometryPart<EndianType> {
        PAD(0x1);
        PAD(0x1);
        PAD(0x1);
        std::uint8_t local_node_count;
        std::uint8_t local_node_indices[22];
        PAD(0x2);
        ENDIAN_TEMPLATE(NewEndian) operator GBXModelGeometryPart<NewEndian>() const {
            GBXModelGeometryPart<NewEndian> copy = {};
            COPY_THIS(local_node_count);
            COPY_THIS_ARRAY(local_node_indices);
            COPY_THIS(flags);
            COPY_THIS(shader_index);
            COPY_THIS(prev_filthy_part_index);
            COPY_THIS(next_filthy_part_index);
            COPY_THIS(centroid_primary_node);
            COPY_THIS(centroid_secondary_node);
            COPY_THIS(centroid_primary_weight);
            COPY_THIS(centroid_secondary_weight);
            COPY_THIS(centroid);
            COPY_THIS(uncompressed_vertices);
            COPY_THIS(compressed_vertices);
            COPY_THIS(triangles);
            COPY_THIS(triangle_buffer_type);
            COPY_THIS(triangle_count);
            COPY_THIS(triangle_offset);
            COPY_THIS(triangle_offset_2);
            COPY_THIS(vertex_type);
            COPY_THIS(vertex_count);
            COPY_THIS(vertex_pointer);
            COPY_THIS(vertex_offset);
            return copy;
        }
    };
    static_assert(sizeof(GBXModelGeometryPart<NativeEndian>) == 0x84);

    ENDIAN_TEMPLATE(EndianType) struct GBXModelGeometry {
        EndianType<IsUnusedFlag> flags;
        PAD(0x20);
        TagReflexive<EndianType, GBXModelGeometryPart> parts;
        ENDIAN_TEMPLATE(NewEndian) operator GBXModelGeometry<NewEndian>() const {
            GBXModelGeometry<NewEndian> copy = {};
            COPY_THIS(flags);
            COPY_THIS(parts);
            return copy;
        }
    };
    static_assert(sizeof(GBXModelGeometry<NativeEndian>) == 0x30);

    ENDIAN_TEMPLATE(EndianType) struct ModelMarkerInstance {
        std::uint8_t region_index;
        std::uint8_t permutation_index;
        std::uint8_t node_index;
        PAD(0x1);
        Point3D<EndianType> translation;
        Quaternion<EndianType> rotation;
        ENDIAN_TEMPLATE(NewEndian) operator ModelMarkerInstance<NewEndian>() const {
            ModelMarkerInstance<NewEndian> copy = {};
            COPY_THIS(region_index);
            COPY_THIS(permutation_index);
            COPY_THIS(node_index);
            COPY_THIS(translation);
            COPY_THIS(rotation);
            return copy;
        }
    };
    static_assert(sizeof(ModelMarkerInstance<NativeEndian>) == 0x20);

    ENDIAN_TEMPLATE(EndianType) struct ModelMarker {
        TagString name;
        EndianType<std::int16_t> magic_identifier;
        PAD(0x2);
        PAD(0x10);
        TagReflexive<EndianType, ModelMarkerInstance> instances;
        ENDIAN_TEMPLATE(NewEndian) operator ModelMarker<NewEndian>() const {
            ModelMarker<NewEndian> copy = {};
            COPY_THIS(name);
            COPY_THIS(magic_identifier);
            COPY_THIS(instances);
            return copy;
        }
    };
    static_assert(sizeof(ModelMarker<NativeEndian>) == 0x40);

    ENDIAN_TEMPLATE(EndianType) struct ModelNode {
        TagString name;
        EndianType<Index> next_sibling_node_index;
        EndianType<Index> first_child_node_index;
        EndianType<Index> parent_node_index;
        PAD(0x2);
        Point3D<EndianType> default_translation;
        Quaternion<EndianType> default_rotation;
        EndianType<float> node_distance_from_parent;
        PAD(0x20);
        LittleEndian<float> scale;
        Matrix<LittleEndian> rotation;
        Point3D<LittleEndian> translation;
        ENDIAN_TEMPLATE(NewEndian) operator ModelNode<NewEndian>() const {
            ModelNode<NewEndian> copy = {};
            COPY_THIS(name);
            COPY_THIS(next_sibling_node_index);
            COPY_THIS(first_child_node_index);
            COPY_THIS(parent_node_index);
            COPY_THIS(default_translation);
            COPY_THIS(default_rotation);
            COPY_THIS(node_distance_from_parent);
            COPY_THIS(scale);
            COPY_THIS(rotation);
            COPY_THIS(translation);
            return copy;
        }
    };
    static_assert(sizeof(ModelNode<NativeEndian>) == 0x9C);

    ENDIAN_TEMPLATE(EndianType) struct ModelRegionPermutationMarker {
        TagString name;
        EndianType<Index> node_index;
        PAD(0x2);
        Quaternion<EndianType> rotation;
        Point3D<EndianType> translation;
        PAD(0x10);
        ENDIAN_TEMPLATE(NewEndian) operator ModelRegionPermutationMarker<NewEndian>() const {
            ModelRegionPermutationMarker<NewEndian> copy = {};
            COPY_THIS(name);
            COPY_THIS(node_index);
            COPY_THIS(rotation);
            COPY_THIS(translation);
            return copy;
        }
    };
    static_assert(sizeof(ModelRegionPermutationMarker<NativeEndian>) == 0x50);

    ENDIAN_TEMPLATE(EndianType) struct ModelRegionPermutation {
        TagString name;
        EndianType<ModelRegionPermutationFlags> flags;
        EndianType<std::uint16_t> permutation_number;
        PAD(0x2);
        PAD(0x18);
        EndianType<Index> super_low;
        EndianType<Index> low;
        EndianType<Index> medium;
        EndianType<Index> high;
        EndianType<Index> super_high;
        PAD(0x2);
        TagReflexive<EndianType, ModelRegionPermutationMarker> markers;
        ENDIAN_TEMPLATE(NewEndian) operator ModelRegionPermutation<NewEndian>() const {
            ModelRegionPermutation<NewEndian> copy = {};
            COPY_THIS(name);
            COPY_THIS(flags);
            COPY_THIS(permutation_number);
            COPY_THIS(super_low);
            COPY_THIS(low);
            COPY_THIS(medium);
            COPY_THIS(high);
            COPY_THIS(super_high);
            COPY_THIS(markers);
            return copy;
        }
    };
    static_assert(sizeof(ModelRegionPermutation<NativeEndian>) == 0x58);

    ENDIAN_TEMPLATE(EndianType) struct ModelRegion {
        TagString name;
        PAD(0x20);
        TagReflexive<EndianType, ModelRegionPermutation> permutations;
        ENDIAN_TEMPLATE(NewEndian) operator ModelRegion<NewEndian>() const {
            ModelRegion<NewEndian> copy = {};
            COPY_THIS(name);
            COPY_THIS(permutations);
            return copy;
        }
    };
    static_assert(sizeof(ModelRegion<NativeEndian>) == 0x4C);

    ENDIAN_TEMPLATE(EndianType) struct ModelShaderReference {
        TagDependency<EndianType> shader;
        EndianType<Index> permutation;
        PAD(0x2);
        PAD(0xC);
        ENDIAN_TEMPLATE(NewEndian) operator ModelShaderReference<NewEndian>() const {
            ModelShaderReference<NewEndian> copy = {};
            COPY_THIS(shader);
            COPY_THIS(permutation);
            return copy;
        }
    };
    static_assert(sizeof(ModelShaderReference<NativeEndian>) == 0x20);

    ENDIAN_TEMPLATE(EndianType) struct GBXModel {
        EndianType<ModelFlags> flags;
        EndianType<std::int32_t> node_list_checksum;
        EndianType<float> super_high_detail_cutoff;
        EndianType<float> high_detail_cutoff;
        EndianType<float> medium_detail_cutoff;
        EndianType<float> low_detail_cutoff;
        EndianType<float> super_low_detail_cutoff;
        EndianType<std::uint16_t> super_low_detail_node_count;
        EndianType<std::uint16_t> low_detail_node_count;
        EndianType<std::uint16_t> medium_detail_node_count;
        EndianType<std::uint16_t> high_detail_node_count;
        EndianType<std::uint16_t> super_high_detail_node_count;
        PAD(0x2);
        PAD(0x8);
        EndianType<float> base_map_u_scale;
        EndianType<float> base_map_v_scale;
        PAD(0x74);
        TagReflexive<EndianType, ModelMarker> markers;
        TagReflexive<EndianType, ModelNode> nodes;
        TagReflexive<EndianType, ModelRegion> regions;
        TagReflexive<EndianType, GBXModelGeometry> geometries;
        TagReflexive<EndianType, ModelShaderReference> shaders;
        ENDIAN_TEMPLATE(NewEndian) operator GBXModel<NewEndian>() const {
            GBXModel<NewEndian> copy = {};
            COPY_THIS(flags);
            COPY_THIS(node_list_checksum);
            COPY_THIS(super_high_detail_cutoff);
            COPY_THIS(high_detail_cutoff);
            COPY_THIS(medium_detail_cutoff);
            COPY_THIS(low_detail_cutoff);
            COPY_THIS(super_low_detail_cutoff);
            COPY_THIS(super_low_detail_node_count);
            COPY_THIS(low_detail_node_count);
            COPY_THIS(medium_detail_node_count);
            COPY_THIS(high_detail_node_count);
            COPY_THIS(super_high_detail_node_count);
            COPY_THIS(base_map_u_scale);
            COPY_THIS(base_map_v_scale);
            COPY_THIS(markers);
            COPY_THIS(nodes);
            COPY_THIS(regions);
            COPY_THIS(geometries);
            COPY_THIS(shaders);
            return copy;
        }
    };
    static_assert(sizeof(GBXModel<NativeEndian>) == 0xE8);

    ENDIAN_TEMPLATE(EndianType) struct GlobalsSound {
        TagDependency<EndianType> sound;
        ENDIAN_TEMPLATE(NewEndian) operator GlobalsSound<NewEndian>() const {
            GlobalsSound<NewEndian> copy;
            COPY_THIS(sound);
            return copy;
        }
    };
    static_assert(sizeof(GlobalsSound<NativeEndian>) == 0x10);

    ENDIAN_TEMPLATE(EndianType) struct GlobalsCamera {
        TagDependency<EndianType> default_unit_camera_track;
        ENDIAN_TEMPLATE(NewEndian) operator GlobalsCamera<NewEndian>() const {
            GlobalsCamera<NewEndian> copy;
            COPY_THIS(default_unit_camera_track);
            return copy;
        }
    };
    static_assert(sizeof(GlobalsCamera<NativeEndian>) == 0x10);

    ENDIAN_TEMPLATE(EndianType) struct GlobalsLookFunction {
        EndianType<float> scale;
        ENDIAN_TEMPLATE(NewEndian) operator GlobalsLookFunction<NewEndian>() const {
            GlobalsLookFunction<NewEndian> copy;
            COPY_THIS(scale);
            return copy;
        }
    };
    static_assert(sizeof(GlobalsLookFunction<NativeEndian>) == 0x4);

    ENDIAN_TEMPLATE(EndianType) struct GlobalsPlayerControl {
        EndianType<float> magnetism_friction;
        EndianType<float> magnetism_adhesion;
        EndianType<float> inconsequential_target_scale;
        PAD(0x34);
        EndianType<float> look_acceleration_time;
        EndianType<float> look_acceleration_scale;
        EndianType<float> look_peg_threshold;
        EndianType<float> look_default_pitch_rate;
        EndianType<float> look_default_yaw_rate;
        EndianType<float> look_autolevelling_scale;
        PAD(0x14);
        EndianType<std::int16_t> minimum_weapon_swap_ticks;
        EndianType<std::int16_t> minimum_autolevelling_ticks;
        EndianType<Angle> minimum_angle_for_vehicle_flipping;
        TagReflexive<EndianType, GlobalsLookFunction> look_function;
        ENDIAN_TEMPLATE(NewEndian) operator GlobalsPlayerControl<NewEndian>() const {
            GlobalsPlayerControl<NewEndian> copy = {};
            COPY_THIS(magnetism_friction);
            COPY_THIS(magnetism_adhesion);
            COPY_THIS(inconsequential_target_scale);
            COPY_THIS(look_acceleration_time);
            COPY_THIS(look_acceleration_scale);
            COPY_THIS(look_peg_threshold);
            COPY_THIS(look_default_pitch_rate);
            COPY_THIS(look_default_yaw_rate);
            COPY_THIS(look_autolevelling_scale);
            COPY_THIS(minimum_weapon_swap_ticks);
            COPY_THIS(minimum_autolevelling_ticks);
            COPY_THIS(minimum_angle_for_vehicle_flipping);
            COPY_THIS(look_function);
            return copy;
        }
    };
    static_assert(sizeof(GlobalsPlayerControl<NativeEndian>) == 0x80);

    ENDIAN_TEMPLATE(EndianType) struct GlobalsDifficulty {
        EndianType<float> easy_enemy_damage;
        EndianType<float> normal_enemy_damage;
        EndianType<float> hard_enemy_damage;
        EndianType<float> imposs_enemy_damage;
        EndianType<float> easy_enemy_vitality;
        EndianType<float> normal_enemy_vitality;
        EndianType<float> hard_enemy_vitality;
        EndianType<float> imposs_enemy_vitality;
        EndianType<float> easy_enemy_shield;
        EndianType<float> normal_enemy_shield;
        EndianType<float> hard_enemy_shield;
        EndianType<float> imposs_enemy_shield;
        EndianType<float> easy_enemy_recharge;
        EndianType<float> normal_enemy_recharge;
        EndianType<float> hard_enemy_recharge;
        EndianType<float> imposs_enemy_recharge;
        EndianType<float> easy_friend_damage;
        EndianType<float> normal_friend_damage;
        EndianType<float> hard_friend_damage;
        EndianType<float> imposs_friend_damage;
        EndianType<float> easy_friend_vitality;
        EndianType<float> normal_friend_vitality;
        EndianType<float> hard_friend_vitality;
        EndianType<float> imposs_friend_vitality;
        EndianType<float> easy_friend_shield;
        EndianType<float> normal_friend_shield;
        EndianType<float> hard_friend_shield;
        EndianType<float> imposs_friend_shield;
        EndianType<float> easy_friend_recharge;
        EndianType<float> normal_friend_recharge;
        EndianType<float> hard_friend_recharge;
        EndianType<float> imposs_friend_recharge;
        EndianType<float> easy_infection_forms;
        EndianType<float> normal_infection_forms;
        EndianType<float> hard_infection_forms;
        EndianType<float> imposs_infection_forms;
        PAD(0x10);
        EndianType<float> easy_rate_of_fire;
        EndianType<float> normal_rate_of_fire;
        EndianType<float> hard_rate_of_fire;
        EndianType<float> imposs_rate_of_fire;
        EndianType<float> easy_projectile_error;
        EndianType<float> normal_projectile_error;
        EndianType<float> hard_projectile_error;
        EndianType<float> imposs_projectile_error;
        EndianType<float> easy_burst_error;
        EndianType<float> normal_burst_error;
        EndianType<float> hard_burst_error;
        EndianType<float> imposs_burst_error;
        EndianType<float> easy_new_target_delay;
        EndianType<float> normal_new_target_delay;
        EndianType<float> hard_new_target_delay;
        EndianType<float> imposs_new_target_delay;
        EndianType<float> easy_burst_separation;
        EndianType<float> normal_burst_separation;
        EndianType<float> hard_burst_separation;
        EndianType<float> imposs_burst_separation;
        EndianType<float> easy_target_tracking;
        EndianType<float> normal_target_tracking;
        EndianType<float> hard_target_tracking;
        EndianType<float> imposs_target_tracking;
        EndianType<float> easy_target_leading;
        EndianType<float> normal_target_leading;
        EndianType<float> hard_target_leading;
        EndianType<float> imposs_target_leading;
        EndianType<float> easy_overcharge_chance;
        EndianType<float> normal_overcharge_chance;
        EndianType<float> hard_overcharge_chance;
        EndianType<float> imposs_overcharge_chance;
        EndianType<float> easy_special_fire_delay;
        EndianType<float> normal_special_fire_delay;
        EndianType<float> hard_special_fire_delay;
        EndianType<float> imposs_special_fire_delay;
        EndianType<float> easy_guidance_vs_player;
        EndianType<float> normal_guidance_vs_player;
        EndianType<float> hard_guidance_vs_player;
        EndianType<float> imposs_guidance_vs_player;
        EndianType<float> easy_melee_delay_base;
        EndianType<float> normal_melee_delay_base;
        EndianType<float> hard_melee_delay_base;
        EndianType<float> imposs_melee_delay_base;
        EndianType<float> easy_melee_delay_scale;
        EndianType<float> normal_melee_delay_scale;
        EndianType<float> hard_melee_delay_scale;
        EndianType<float> imposs_melee_delay_scale;
        PAD(0x10);
        EndianType<float> easy_grenade_chance_scale;
        EndianType<float> normal_grenade_chance_scale;
        EndianType<float> hard_grenade_chance_scale;
        EndianType<float> imposs_grenade_chance_scale;
        EndianType<float> easy_grenade_timer_scale;
        EndianType<float> normal_grenade_timer_scale;
        EndianType<float> hard_grenade_timer_scale;
        EndianType<float> imposs_grenade_timer_scale;
        PAD(0x10);
        PAD(0x10);
        PAD(0x10);
        EndianType<float> easy_major_upgrade;
        EndianType<float> normal_major_upgrade;
        EndianType<float> hard_major_upgrade;
        EndianType<float> imposs_major_upgrade;
        EndianType<float> easy_major_upgrade_1;
        EndianType<float> normal_major_upgrade_1;
        EndianType<float> hard_major_upgrade_1;
        EndianType<float> imposs_major_upgrade_1;
        EndianType<float> easy_major_upgrade_2;
        EndianType<float> normal_major_upgrade_2;
        EndianType<float> hard_major_upgrade_2;
        EndianType<float> imposs_major_upgrade_2;
        PAD(0x10);
        PAD(0x10);
        PAD(0x10);
        PAD(0x10);
        PAD(0x54);
        ENDIAN_TEMPLATE(NewEndian) operator GlobalsDifficulty<NewEndian>() const {
            GlobalsDifficulty<NewEndian> copy = {};
            COPY_THIS(easy_enemy_damage);
            COPY_THIS(normal_enemy_damage);
            COPY_THIS(hard_enemy_damage);
            COPY_THIS(imposs_enemy_damage);
            COPY_THIS(easy_enemy_vitality);
            COPY_THIS(normal_enemy_vitality);
            COPY_THIS(hard_enemy_vitality);
            COPY_THIS(imposs_enemy_vitality);
            COPY_THIS(easy_enemy_shield);
            COPY_THIS(normal_enemy_shield);
            COPY_THIS(hard_enemy_shield);
            COPY_THIS(imposs_enemy_shield);
            COPY_THIS(easy_enemy_recharge);
            COPY_THIS(normal_enemy_recharge);
            COPY_THIS(hard_enemy_recharge);
            COPY_THIS(imposs_enemy_recharge);
            COPY_THIS(easy_friend_damage);
            COPY_THIS(normal_friend_damage);
            COPY_THIS(hard_friend_damage);
            COPY_THIS(imposs_friend_damage);
            COPY_THIS(easy_friend_vitality);
            COPY_THIS(normal_friend_vitality);
            COPY_THIS(hard_friend_vitality);
            COPY_THIS(imposs_friend_vitality);
            COPY_THIS(easy_friend_shield);
            COPY_THIS(normal_friend_shield);
            COPY_THIS(hard_friend_shield);
            COPY_THIS(imposs_friend_shield);
            COPY_THIS(easy_friend_recharge);
            COPY_THIS(normal_friend_recharge);
            COPY_THIS(hard_friend_recharge);
            COPY_THIS(imposs_friend_recharge);
            COPY_THIS(easy_infection_forms);
            COPY_THIS(normal_infection_forms);
            COPY_THIS(hard_infection_forms);
            COPY_THIS(imposs_infection_forms);
            COPY_THIS(easy_rate_of_fire);
            COPY_THIS(normal_rate_of_fire);
            COPY_THIS(hard_rate_of_fire);
            COPY_THIS(imposs_rate_of_fire);
            COPY_THIS(easy_projectile_error);
            COPY_THIS(normal_projectile_error);
            COPY_THIS(hard_projectile_error);
            COPY_THIS(imposs_projectile_error);
            COPY_THIS(easy_burst_error);
            COPY_THIS(normal_burst_error);
            COPY_THIS(hard_burst_error);
            COPY_THIS(imposs_burst_error);
            COPY_THIS(easy_new_target_delay);
            COPY_THIS(normal_new_target_delay);
            COPY_THIS(hard_new_target_delay);
            COPY_THIS(imposs_new_target_delay);
            COPY_THIS(easy_burst_separation);
            COPY_THIS(normal_burst_separation);
            COPY_THIS(hard_burst_separation);
            COPY_THIS(imposs_burst_separation);
            COPY_THIS(easy_target_tracking);
            COPY_THIS(normal_target_tracking);
            COPY_THIS(hard_target_tracking);
            COPY_THIS(imposs_target_tracking);
            COPY_THIS(easy_target_leading);
            COPY_THIS(normal_target_leading);
            COPY_THIS(hard_target_leading);
            COPY_THIS(imposs_target_leading);
            COPY_THIS(easy_overcharge_chance);
            COPY_THIS(normal_overcharge_chance);
            COPY_THIS(hard_overcharge_chance);
            COPY_THIS(imposs_overcharge_chance);
            COPY_THIS(easy_special_fire_delay);
            COPY_THIS(normal_special_fire_delay);
            COPY_THIS(hard_special_fire_delay);
            COPY_THIS(imposs_special_fire_delay);
            COPY_THIS(easy_guidance_vs_player);
            COPY_THIS(normal_guidance_vs_player);
            COPY_THIS(hard_guidance_vs_player);
            COPY_THIS(imposs_guidance_vs_player);
            COPY_THIS(easy_melee_delay_base);
            COPY_THIS(normal_melee_delay_base);
            COPY_THIS(hard_melee_delay_base);
            COPY_THIS(imposs_melee_delay_base);
            COPY_THIS(easy_melee_delay_scale);
            COPY_THIS(normal_melee_delay_scale);
            COPY_THIS(hard_melee_delay_scale);
            COPY_THIS(imposs_melee_delay_scale);
            COPY_THIS(easy_grenade_chance_scale);
            COPY_THIS(normal_grenade_chance_scale);
            COPY_THIS(hard_grenade_chance_scale);
            COPY_THIS(imposs_grenade_chance_scale);
            COPY_THIS(easy_grenade_timer_scale);
            COPY_THIS(normal_grenade_timer_scale);
            COPY_THIS(hard_grenade_timer_scale);
            COPY_THIS(imposs_grenade_timer_scale);
            COPY_THIS(easy_major_upgrade);
            COPY_THIS(normal_major_upgrade);
            COPY_THIS(hard_major_upgrade);
            COPY_THIS(imposs_major_upgrade);
            COPY_THIS(easy_major_upgrade_1);
            COPY_THIS(normal_major_upgrade_1);
            COPY_THIS(hard_major_upgrade_1);
            COPY_THIS(imposs_major_upgrade_1);
            COPY_THIS(easy_major_upgrade_2);
            COPY_THIS(normal_major_upgrade_2);
            COPY_THIS(hard_major_upgrade_2);
            COPY_THIS(imposs_major_upgrade_2);
            return copy;
        }
    };
    static_assert(sizeof(GlobalsDifficulty<NativeEndian>) == 0x284);

    ENDIAN_TEMPLATE(EndianType) struct GlobalsGrenade {
        EndianType<std::int16_t> maximum_count;
        EndianType<std::int16_t> mp_spawn_default;
        TagDependency<EndianType> throwing_effect;
        TagDependency<EndianType> hud_interface;
        TagDependency<EndianType> equipment;
        TagDependency<EndianType> projectile;
        ENDIAN_TEMPLATE(NewEndian) operator GlobalsGrenade<NewEndian>() const {
            GlobalsGrenade<NewEndian> copy;
            COPY_THIS(maximum_count);
            COPY_THIS(mp_spawn_default);
            COPY_THIS(throwing_effect);
            COPY_THIS(hud_interface);
            COPY_THIS(equipment);
            COPY_THIS(projectile);
            return copy;
        }
    };
    static_assert(sizeof(GlobalsGrenade<NativeEndian>) == 0x44);

    ENDIAN_TEMPLATE(EndianType) struct GlobalsRasterizerData {
        TagDependency<EndianType> distance_attenuation;
        TagDependency<EndianType> vector_normalization;
        TagDependency<EndianType> atmospheric_fog_density;
        TagDependency<EndianType> planar_fog_density;
        TagDependency<EndianType> linear_corner_fade;
        TagDependency<EndianType> active_camouflage_distortion;
        TagDependency<EndianType> glow;
        PAD(0x3C);
        TagDependency<EndianType> default_2d;
        TagDependency<EndianType> default_3d;
        TagDependency<EndianType> default_cube_map;
        TagDependency<EndianType> test_0;
        TagDependency<EndianType> test_1;
        TagDependency<EndianType> test_2;
        TagDependency<EndianType> test_3;
        TagDependency<EndianType> video_scanline_map;
        TagDependency<EndianType> video_noise_map;
        PAD(0x34);
        EndianType<GlobalsRasterizerDataFlags> flags;
        PAD(0x2);
        EndianType<float> refraction_amount;
        EndianType<float> distance_falloff;
        ColorRGB<EndianType> tint_color;
        EndianType<float> hyper_stealth_refraction;
        EndianType<float> hyper_stealth_distance_falloff;
        ColorRGB<EndianType> hyper_stealth_tint_color;
        TagDependency<EndianType> distance_attenuation_2d;
        ENDIAN_TEMPLATE(NewEndian) operator GlobalsRasterizerData<NewEndian>() const {
            GlobalsRasterizerData<NewEndian> copy = {};
            COPY_THIS(distance_attenuation);
            COPY_THIS(vector_normalization);
            COPY_THIS(atmospheric_fog_density);
            COPY_THIS(planar_fog_density);
            COPY_THIS(linear_corner_fade);
            COPY_THIS(active_camouflage_distortion);
            COPY_THIS(glow);
            COPY_THIS(default_2d);
            COPY_THIS(default_3d);
            COPY_THIS(default_cube_map);
            COPY_THIS(test_0);
            COPY_THIS(test_1);
            COPY_THIS(test_2);
            COPY_THIS(test_3);
            COPY_THIS(video_scanline_map);
            COPY_THIS(video_noise_map);
            COPY_THIS(flags);
            COPY_THIS(refraction_amount);
            COPY_THIS(distance_falloff);
            COPY_THIS(tint_color);
            COPY_THIS(hyper_stealth_refraction);
            COPY_THIS(hyper_stealth_distance_falloff);
            COPY_THIS(hyper_stealth_tint_color);
            COPY_THIS(distance_attenuation_2d);
            return copy;
        }
    };
    static_assert(sizeof(GlobalsRasterizerData<NativeEndian>) == 0x1AC);

    ENDIAN_TEMPLATE(EndianType) struct GlobalsInterfaceBitmaps {
        TagDependency<EndianType> font_system;
        TagDependency<EndianType> font_terminal;
        TagDependency<EndianType> screen_color_table;
        TagDependency<EndianType> hud_color_table;
        TagDependency<EndianType> editor_color_table;
        TagDependency<EndianType> dialog_color_table;
        TagDependency<EndianType> hud_globals;
        TagDependency<EndianType> motion_sensor_sweep_bitmap;
        TagDependency<EndianType> motion_sensor_sweep_bitmap_mask;
        TagDependency<EndianType> multiplayer_hud_bitmap;
        TagDependency<EndianType> localization;
        TagDependency<EndianType> hud_digits_definition;
        TagDependency<EndianType> motion_sensor_blip_bitmap;
        TagDependency<EndianType> interface_goo_map1;
        TagDependency<EndianType> interface_goo_map2;
        TagDependency<EndianType> interface_goo_map3;
        PAD(0x30);
        ENDIAN_TEMPLATE(NewEndian) operator GlobalsInterfaceBitmaps<NewEndian>() const {
            GlobalsInterfaceBitmaps<NewEndian> copy = {};
            COPY_THIS(font_system);
            COPY_THIS(font_terminal);
            COPY_THIS(screen_color_table);
            COPY_THIS(hud_color_table);
            COPY_THIS(editor_color_table);
            COPY_THIS(dialog_color_table);
            COPY_THIS(hud_globals);
            COPY_THIS(motion_sensor_sweep_bitmap);
            COPY_THIS(motion_sensor_sweep_bitmap_mask);
            COPY_THIS(multiplayer_hud_bitmap);
            COPY_THIS(localization);
            COPY_THIS(hud_digits_definition);
            COPY_THIS(motion_sensor_blip_bitmap);
            COPY_THIS(interface_goo_map1);
            COPY_THIS(interface_goo_map2);
            COPY_THIS(interface_goo_map3);
            return copy;
        }
    };
    static_assert(sizeof(GlobalsInterfaceBitmaps<NativeEndian>) == 0x130);

    ENDIAN_TEMPLATE(EndianType) struct GlobalsWeapon {
        TagDependency<EndianType> weapon;
        ENDIAN_TEMPLATE(NewEndian) operator GlobalsWeapon<NewEndian>() const {
            GlobalsWeapon<NewEndian> copy;
            COPY_THIS(weapon);
            return copy;
        }
    };
    static_assert(sizeof(GlobalsWeapon<NativeEndian>) == 0x10);

    ENDIAN_TEMPLATE(EndianType) struct GlobalsCheatPowerup {
        TagDependency<EndianType> powerup;
        ENDIAN_TEMPLATE(NewEndian) operator GlobalsCheatPowerup<NewEndian>() const {
            GlobalsCheatPowerup<NewEndian> copy;
            COPY_THIS(powerup);
            return copy;
        }
    };
    static_assert(sizeof(GlobalsCheatPowerup<NativeEndian>) == 0x10);

    ENDIAN_TEMPLATE(EndianType) struct GlobalsVehicle {
        TagDependency<EndianType> vehicle;
        ENDIAN_TEMPLATE(NewEndian) operator GlobalsVehicle<NewEndian>() const {
            GlobalsVehicle<NewEndian> copy;
            COPY_THIS(vehicle);
            return copy;
        }
    };
    static_assert(sizeof(GlobalsVehicle<NativeEndian>) == 0x10);

    ENDIAN_TEMPLATE(EndianType) struct GlobalsMultiplayerInformation {
        TagDependency<EndianType> flag;
        TagDependency<EndianType> unit;
        TagReflexive<EndianType, GlobalsVehicle> vehicles;
        TagDependency<EndianType> hill_shader;
        TagDependency<EndianType> flag_shader;
        TagDependency<EndianType> ball;
        TagReflexive<EndianType, GlobalsSound> sounds;
        PAD(0x38);
        ENDIAN_TEMPLATE(NewEndian) operator GlobalsMultiplayerInformation<NewEndian>() const {
            GlobalsMultiplayerInformation<NewEndian> copy = {};
            COPY_THIS(flag);
            COPY_THIS(unit);
            COPY_THIS(vehicles);
            COPY_THIS(hill_shader);
            COPY_THIS(flag_shader);
            COPY_THIS(ball);
            COPY_THIS(sounds);
            return copy;
        }
    };
    static_assert(sizeof(GlobalsMultiplayerInformation<NativeEndian>) == 0xA0);

    ENDIAN_TEMPLATE(EndianType) struct GlobalsPlayerInformation {
        TagDependency<EndianType> unit;
        PAD(0x1C);
        EndianType<float> walking_speed;
        EndianType<float> double_speed_multiplier;
        EndianType<float> run_forward;
        EndianType<float> run_backward;
        EndianType<float> run_sideways;
        EndianType<float> run_acceleration;
        EndianType<float> sneak_forward;
        EndianType<float> sneak_backward;
        EndianType<float> sneak_sideways;
        EndianType<float> sneak_acceleration;
        EndianType<float> airborne_acceleration;
        EndianType<float> speed_multiplier;
        PAD(0xC);
        Point3D<EndianType> grenade_origin;
        PAD(0xC);
        EndianType<float> stun_movement_penalty;
        EndianType<float> stun_turning_penalty;
        EndianType<float> stun_jumping_penalty;
        EndianType<float> minimum_stun_time;
        EndianType<float> maximum_stun_time;
        PAD(0x8);
        Bounds<EndianType<float>> first_person_idle_time;
        EndianType<float> first_person_skip_fraction;
        PAD(0x10);
        TagDependency<EndianType> coop_respawn_effect;
        PAD(0x2C);
        ENDIAN_TEMPLATE(NewEndian) operator GlobalsPlayerInformation<NewEndian>() const {
            GlobalsPlayerInformation<NewEndian> copy = {};
            COPY_THIS(unit);
            COPY_THIS(walking_speed);
            COPY_THIS(double_speed_multiplier);
            COPY_THIS(run_forward);
            COPY_THIS(run_backward);
            COPY_THIS(run_sideways);
            COPY_THIS(run_acceleration);
            COPY_THIS(sneak_forward);
            COPY_THIS(sneak_backward);
            COPY_THIS(sneak_sideways);
            COPY_THIS(sneak_acceleration);
            COPY_THIS(airborne_acceleration);
            COPY_THIS(speed_multiplier);
            COPY_THIS(grenade_origin);
            COPY_THIS(stun_movement_penalty);
            COPY_THIS(stun_turning_penalty);
            COPY_THIS(stun_jumping_penalty);
            COPY_THIS(minimum_stun_time);
            COPY_THIS(maximum_stun_time);
            COPY_THIS(first_person_idle_time);
            COPY_THIS(first_person_skip_fraction);
            COPY_THIS(coop_respawn_effect);
            return copy;
        }
    };
    static_assert(sizeof(GlobalsPlayerInformation<NativeEndian>) == 0xF4);

    ENDIAN_TEMPLATE(EndianType) struct GlobalsFirstPersonInterface {
        TagDependency<EndianType> first_person_hands;
        TagDependency<EndianType> base_bitmap;
        TagDependency<EndianType> shield_meter;
        Point2DInt<EndianType> shield_meter_origin;
        TagDependency<EndianType> body_meter;
        Point2DInt<EndianType> body_meter_origin;
        TagDependency<EndianType> night_vision_on_effect;
        TagDependency<EndianType> night_vision_off_effect;
        PAD(0x58);
        ENDIAN_TEMPLATE(NewEndian) operator GlobalsFirstPersonInterface<NewEndian>() const {
            GlobalsFirstPersonInterface<NewEndian> copy = {};
            COPY_THIS(first_person_hands);
            COPY_THIS(base_bitmap);
            COPY_THIS(shield_meter);
            COPY_THIS(shield_meter_origin);
            COPY_THIS(body_meter);
            COPY_THIS(body_meter_origin);
            COPY_THIS(night_vision_on_effect);
            COPY_THIS(night_vision_off_effect);
            return copy;
        }
    };
    static_assert(sizeof(GlobalsFirstPersonInterface<NativeEndian>) == 0xC0);

    ENDIAN_TEMPLATE(EndianType) struct GlobalsFallingDamage {
        PAD(0x8);
        Bounds<EndianType<float>> harmful_falling_distance;
        TagDependency<EndianType> falling_damage;
        PAD(0x8);
        EndianType<float> maximum_falling_distance;
        TagDependency<EndianType> distance_damage;
        TagDependency<EndianType> vehicle_environment_collision_damage;
        TagDependency<EndianType> vehicle_killed_unit_damage;
        TagDependency<EndianType> vehicle_collision_damage;
        TagDependency<EndianType> flaming_death_damage;
        PAD(0x10);
        LittleEndian<float> maximum_falling_velocity;
        Bounds<LittleEndian<float>> harmful_falling_velocity;
        ENDIAN_TEMPLATE(NewEndian) operator GlobalsFallingDamage<NewEndian>() const {
            GlobalsFallingDamage<NewEndian> copy = {};
            COPY_THIS(harmful_falling_distance);
            COPY_THIS(falling_damage);
            COPY_THIS(maximum_falling_distance);
            COPY_THIS(distance_damage);
            COPY_THIS(vehicle_environment_collision_damage);
            COPY_THIS(vehicle_killed_unit_damage);
            COPY_THIS(vehicle_collision_damage);
            COPY_THIS(flaming_death_damage);
            COPY_THIS(maximum_falling_velocity);
            COPY_THIS(harmful_falling_velocity);
            return copy;
        }
    };
    static_assert(sizeof(GlobalsFallingDamage<NativeEndian>) == 0x98);

    ENDIAN_TEMPLATE(EndianType) struct GlobalsBreakableSurfaceParticleEffect {
        TagDependency<EndianType> particle_type;
        EndianType<GlobalsBreakableSurfaceParticleEffectFlags> flags;
        EndianType<float> density;
        Bounds<EndianType<float>> velocity_scale;
        PAD(0x4);
        Bounds<EndianType<float>> angular_velocity;
        PAD(0x8);
        Bounds<EndianType<float>> radius;
        PAD(0x8);
        ColorARGB<EndianType> tint_lower_bound;
        ColorARGB<EndianType> tint_upper_bound;
        PAD(0x1C);
        ENDIAN_TEMPLATE(NewEndian) operator GlobalsBreakableSurfaceParticleEffect<NewEndian>() const {
            GlobalsBreakableSurfaceParticleEffect<NewEndian> copy = {};
            COPY_THIS(particle_type);
            COPY_THIS(flags);
            COPY_THIS(density);
            COPY_THIS(velocity_scale);
            COPY_THIS(angular_velocity);
            COPY_THIS(radius);
            COPY_THIS(tint_lower_bound);
            COPY_THIS(tint_upper_bound);
            return copy;
        }
    };
    static_assert(sizeof(GlobalsBreakableSurfaceParticleEffect<NativeEndian>) == 0x80);

    ENDIAN_TEMPLATE(EndianType) struct GlobalsMaterial {
        PAD(0x64);
        PAD(0x30);
        EndianType<float> ground_friction_scale;
        EndianType<float> ground_friction_normal_k1_scale;
        EndianType<float> ground_friction_normal_k0_scale;
        EndianType<float> ground_depth_scale;
        EndianType<float> ground_damp_fraction_scale;
        PAD(0x4C);
        PAD(0x1E0);
        EndianType<float> maximum_vitality;
        PAD(0x8);
        PAD(0x4);
        TagDependency<EndianType> effect;
        TagDependency<EndianType> sound;
        PAD(0x18);
        TagReflexive<EndianType, GlobalsBreakableSurfaceParticleEffect> particle_effects;
        PAD(0x3C);
        TagDependency<EndianType> melee_hit_sound;
        ENDIAN_TEMPLATE(NewEndian) operator GlobalsMaterial<NewEndian>() const {
            GlobalsMaterial<NewEndian> copy = {};
            COPY_THIS(ground_friction_scale);
            COPY_THIS(ground_friction_normal_k1_scale);
            COPY_THIS(ground_friction_normal_k0_scale);
            COPY_THIS(ground_depth_scale);
            COPY_THIS(ground_damp_fraction_scale);
            COPY_THIS(maximum_vitality);
            COPY_THIS(effect);
            COPY_THIS(sound);
            COPY_THIS(particle_effects);
            COPY_THIS(melee_hit_sound);
            return copy;
        }
    };
    static_assert(sizeof(GlobalsMaterial<NativeEndian>) == 0x374);

    ENDIAN_TEMPLATE(EndianType) struct GlobalsPlaylistMember {
        TagString map_name;
        TagString game_variant;
        EndianType<std::int32_t> minimum_experience;
        EndianType<std::int32_t> maximum_experience;
        EndianType<std::int32_t> minimum_player_count;
        EndianType<std::int32_t> maximum_player_count;
        EndianType<std::int32_t> rating;
        PAD(0x40);
        ENDIAN_TEMPLATE(NewEndian) operator GlobalsPlaylistMember<NewEndian>() const {
            GlobalsPlaylistMember<NewEndian> copy = {};
            COPY_THIS(map_name);
            COPY_THIS(game_variant);
            COPY_THIS(minimum_experience);
            COPY_THIS(maximum_experience);
            COPY_THIS(minimum_player_count);
            COPY_THIS(maximum_player_count);
            COPY_THIS(rating);
            return copy;
        }
    };
    static_assert(sizeof(GlobalsPlaylistMember<NativeEndian>) == 0x94);

    ENDIAN_TEMPLATE(EndianType) struct Globals {
        PAD(0xF8);
        TagReflexive<EndianType, GlobalsSound> sounds;
        TagReflexive<EndianType, GlobalsCamera> camera;
        TagReflexive<EndianType, GlobalsPlayerControl> player_control;
        TagReflexive<EndianType, GlobalsDifficulty> difficulty;
        TagReflexive<EndianType, GlobalsGrenade> grenades;
        TagReflexive<EndianType, GlobalsRasterizerData> rasterizer_data;
        TagReflexive<EndianType, GlobalsInterfaceBitmaps> interface_bitmaps;
        TagReflexive<EndianType, GlobalsWeapon> weapon_list;
        TagReflexive<EndianType, GlobalsCheatPowerup> cheat_powerups;
        TagReflexive<EndianType, GlobalsMultiplayerInformation> multiplayer_information;
        TagReflexive<EndianType, GlobalsPlayerInformation> player_information;
        TagReflexive<EndianType, GlobalsFirstPersonInterface> first_person_interface;
        TagReflexive<EndianType, GlobalsFallingDamage> falling_damage;
        TagReflexive<EndianType, GlobalsMaterial> materials;
        TagReflexive<EndianType, GlobalsPlaylistMember> playlist_members;
        ENDIAN_TEMPLATE(NewEndian) operator Globals<NewEndian>() const {
            Globals<NewEndian> copy = {};
            COPY_THIS(sounds);
            COPY_THIS(camera);
            COPY_THIS(player_control);
            COPY_THIS(difficulty);
            COPY_THIS(grenades);
            COPY_THIS(rasterizer_data);
            COPY_THIS(interface_bitmaps);
            COPY_THIS(weapon_list);
            COPY_THIS(cheat_powerups);
            COPY_THIS(multiplayer_information);
            COPY_THIS(player_information);
            COPY_THIS(first_person_interface);
            COPY_THIS(falling_damage);
            COPY_THIS(materials);
            COPY_THIS(playlist_members);
            return copy;
        }
    };
    static_assert(sizeof(Globals<NativeEndian>) == 0x1AC);

    ENDIAN_TEMPLATE(EndianType) struct Glow {
        TagString attachment_marker;
        EndianType<std::int16_t> number_of_particles;
        EndianType<GlowBoundaryEffect> boundary_effect;
        EndianType<GlowNormalParticleDistribution> normal_particle_distribution;
        EndianType<GlowTrailingParticleDistribution> trailing_particle_distribution;
        EndianType<GlowFlags> glow_flags;
        PAD(0x1C);
        PAD(0x2);
        PAD(0x2);
        PAD(0x4);
        EndianType<FunctionOut> attachment_0;
        PAD(0x2);
        EndianType<float> particle_rotational_velocity;
        EndianType<float> particle_rot_vel_mul_low;
        EndianType<float> particle_rot_vel_mul_high;
        EndianType<FunctionOut> attachment_1;
        PAD(0x2);
        EndianType<float> effect_rotational_velocity;
        EndianType<float> effect_rot_vel_mul_low;
        EndianType<float> effect_rot_vel_mul_high;
        EndianType<FunctionOut> attachment_2;
        PAD(0x2);
        EndianType<float> effect_translational_velocity;
        EndianType<float> effect_trans_vel_mul_low;
        EndianType<float> effect_trans_vel_mul_high;
        EndianType<FunctionOut> attachment_3;
        PAD(0x2);
        EndianType<float> min_distance_particle_to_object;
        EndianType<float> max_distance_particle_to_object;
        EndianType<float> distance_to_object_mul_low;
        EndianType<float> distance_to_object_mul_high;
        PAD(0x8);
        EndianType<FunctionOut> attachment_4;
        PAD(0x2);
        Bounds<EndianType<float>> particle_size_bounds;
        Bounds<EndianType<float>> size_attachment_multiplier;
        EndianType<FunctionOut> attachment_5;
        PAD(0x2);
        ColorARGB<EndianType> color_bound_0;
        ColorARGB<EndianType> color_bound_1;
        ColorARGB<EndianType> scale_color_0;
        ColorARGB<EndianType> scale_color_1;
        EndianType<float> color_rate_of_change;
        EndianType<float> fading_percentage_of_glow;
        EndianType<float> particle_generation_freq;
        EndianType<float> lifetime_of_trailing_particles;
        EndianType<float> velocity_of_trailing_particles;
        EndianType<float> trailing_particle_minimum_t;
        EndianType<float> trailing_particle_maximum_t;
        PAD(0x34);
        TagDependency<EndianType> texture;
        ENDIAN_TEMPLATE(NewEndian) operator Glow<NewEndian>() const {
            Glow<NewEndian> copy = {};
            COPY_THIS(attachment_marker);
            COPY_THIS(number_of_particles);
            COPY_THIS(boundary_effect);
            COPY_THIS(normal_particle_distribution);
            COPY_THIS(trailing_particle_distribution);
            COPY_THIS(glow_flags);
            COPY_THIS(attachment_0);
            COPY_THIS(particle_rotational_velocity);
            COPY_THIS(particle_rot_vel_mul_low);
            COPY_THIS(particle_rot_vel_mul_high);
            COPY_THIS(attachment_1);
            COPY_THIS(effect_rotational_velocity);
            COPY_THIS(effect_rot_vel_mul_low);
            COPY_THIS(effect_rot_vel_mul_high);
            COPY_THIS(attachment_2);
            COPY_THIS(effect_translational_velocity);
            COPY_THIS(effect_trans_vel_mul_low);
            COPY_THIS(effect_trans_vel_mul_high);
            COPY_THIS(attachment_3);
            COPY_THIS(min_distance_particle_to_object);
            COPY_THIS(max_distance_particle_to_object);
            COPY_THIS(distance_to_object_mul_low);
            COPY_THIS(distance_to_object_mul_high);
            COPY_THIS(attachment_4);
            COPY_THIS(particle_size_bounds);
            COPY_THIS(size_attachment_multiplier);
            COPY_THIS(attachment_5);
            COPY_THIS(color_bound_0);
            COPY_THIS(color_bound_1);
            COPY_THIS(scale_color_0);
            COPY_THIS(scale_color_1);
            COPY_THIS(color_rate_of_change);
            COPY_THIS(fading_percentage_of_glow);
            COPY_THIS(particle_generation_freq);
            COPY_THIS(lifetime_of_trailing_particles);
            COPY_THIS(velocity_of_trailing_particles);
            COPY_THIS(trailing_particle_minimum_t);
            COPY_THIS(trailing_particle_maximum_t);
            COPY_THIS(texture);
            return copy;
        }
    };
    static_assert(sizeof(Glow<NativeEndian>) == 0x154);

    ENDIAN_TEMPLATE(EndianType) struct GrenadeHUDInterfaceOverlay {
        Point2DInt<EndianType> anchor_offset;
        EndianType<float> width_scale;
        EndianType<float> height_scale;
        EndianType<HUDInterfaceScalingFlags> scaling_flags;
        PAD(0x2);
        PAD(0x14);
        EndianType<ColorARGBInt> default_color;
        EndianType<ColorARGBInt> flashing_color;
        EndianType<float> flash_period;
        EndianType<float> flash_delay;
        EndianType<std::int16_t> number_of_flashes;
        EndianType<HUDInterfaceFlashFlags> flash_flags;
        EndianType<float> flash_length;
        EndianType<ColorARGBInt> disabled_color;
        PAD(0x4);
        EndianType<float> frame_rate;
        EndianType<Index> sequence_index;
        EndianType<GrenadeHUDInterfaceOverlayType> type;
        EndianType<HUDInterfaceOverlayFlashFlags> flags;
        PAD(0x10);
        PAD(0x28);
        ENDIAN_TEMPLATE(NewEndian) operator GrenadeHUDInterfaceOverlay<NewEndian>() const {
            GrenadeHUDInterfaceOverlay<NewEndian> copy = {};
            COPY_THIS(anchor_offset);
            COPY_THIS(width_scale);
            COPY_THIS(height_scale);
            COPY_THIS(scaling_flags);
            COPY_THIS(default_color);
            COPY_THIS(flashing_color);
            COPY_THIS(flash_period);
            COPY_THIS(flash_delay);
            COPY_THIS(number_of_flashes);
            COPY_THIS(flash_flags);
            COPY_THIS(flash_length);
            COPY_THIS(disabled_color);
            COPY_THIS(frame_rate);
            COPY_THIS(sequence_index);
            COPY_THIS(type);
            COPY_THIS(flags);
            return copy;
        }
    };
    static_assert(sizeof(GrenadeHUDInterfaceOverlay<NativeEndian>) == 0x88);

    ENDIAN_TEMPLATE(EndianType) struct GrenadeHUDInterfaceSound {
        TagDependency<EndianType> sound;
        EndianType<GrenadeHUDInterfaceSoundLatchedTo> latched_to;
        EndianType<float> scale;
        PAD(0x20);
        ENDIAN_TEMPLATE(NewEndian) operator GrenadeHUDInterfaceSound<NewEndian>() const {
            GrenadeHUDInterfaceSound<NewEndian> copy = {};
            COPY_THIS(sound);
            COPY_THIS(latched_to);
            COPY_THIS(scale);
            return copy;
        }
    };
    static_assert(sizeof(GrenadeHUDInterfaceSound<NativeEndian>) == 0x38);

    ENDIAN_TEMPLATE(EndianType) struct HUDInterfaceMultitextureOverlayEffector {
        PAD(0x40);
        EndianType<HUDInterfaceDestinationType> destination_type;
        EndianType<HUDInterfaceDestination> destination;
        EndianType<HUDInterfaceSource> source;
        PAD(0x2);
        Bounds<EndianType<float>> in_bounds;
        Bounds<EndianType<float>> out_bounds;
        PAD(0x40);
        ColorRGB<EndianType> tint_color_lower_bound;
        ColorRGB<EndianType> tint_color_upper_bound;
        EndianType<WaveFunction> periodic_function;
        PAD(0x2);
        EndianType<float> function_period;
        EndianType<float> function_phase;
        PAD(0x20);
        ENDIAN_TEMPLATE(NewEndian) operator HUDInterfaceMultitextureOverlayEffector<NewEndian>() const {
            HUDInterfaceMultitextureOverlayEffector<NewEndian> copy = {};
            COPY_THIS(destination_type);
            COPY_THIS(destination);
            COPY_THIS(source);
            COPY_THIS(in_bounds);
            COPY_THIS(out_bounds);
            COPY_THIS(tint_color_lower_bound);
            COPY_THIS(tint_color_upper_bound);
            COPY_THIS(periodic_function);
            COPY_THIS(function_period);
            COPY_THIS(function_phase);
            return copy;
        }
    };
    static_assert(sizeof(HUDInterfaceMultitextureOverlayEffector<NativeEndian>) == 0xDC);

    ENDIAN_TEMPLATE(EndianType) struct HUDInterfaceMultitextureOverlay {
        PAD(0x2);
        EndianType<std::int16_t> type;
        EndianType<FramebufferBlendFunction> framebuffer_blend_function;
        PAD(0x2);
        PAD(0x20);
        EndianType<HUDInterfaceMultitextureOverlayAnchor> primary_anchor;
        EndianType<HUDInterfaceMultitextureOverlayAnchor> secondary_anchor;
        EndianType<HUDInterfaceMultitextureOverlayAnchor> tertiary_anchor;
        EndianType<HUDInterfaceZeroToOneBlendFunction> zero_to_one_blend_function;
        EndianType<HUDInterfaceZeroToOneBlendFunction> one_to_two_blend_function;
        PAD(0x2);
        Point2D<EndianType> primary_scale;
        Point2D<EndianType> secondary_scale;
        Point2D<EndianType> tertiary_scale;
        Point2D<EndianType> primary_offset;
        Point2D<EndianType> secondary_offset;
        Point2D<EndianType> tertiary_offset;
        TagDependency<EndianType> primary;
        TagDependency<EndianType> secondary;
        TagDependency<EndianType> tertiary;
        EndianType<HUDInterfaceWrapMode> primary_wrap_mode;
        EndianType<HUDInterfaceWrapMode> secondary_wrap_mode;
        EndianType<HUDInterfaceWrapMode> tertiary_wrap_mode;
        PAD(0x2);
        PAD(0xB8);
        TagReflexive<EndianType, HUDInterfaceMultitextureOverlayEffector> effectors;
        PAD(0x80);
        ENDIAN_TEMPLATE(NewEndian) operator HUDInterfaceMultitextureOverlay<NewEndian>() const {
            HUDInterfaceMultitextureOverlay<NewEndian> copy = {};
            COPY_THIS(type);
            COPY_THIS(framebuffer_blend_function);
            COPY_THIS(primary_anchor);
            COPY_THIS(secondary_anchor);
            COPY_THIS(tertiary_anchor);
            COPY_THIS(zero_to_one_blend_function);
            COPY_THIS(one_to_two_blend_function);
            COPY_THIS(primary_scale);
            COPY_THIS(secondary_scale);
            COPY_THIS(tertiary_scale);
            COPY_THIS(primary_offset);
            COPY_THIS(secondary_offset);
            COPY_THIS(tertiary_offset);
            COPY_THIS(primary);
            COPY_THIS(secondary);
            COPY_THIS(tertiary);
            COPY_THIS(primary_wrap_mode);
            COPY_THIS(secondary_wrap_mode);
            COPY_THIS(tertiary_wrap_mode);
            COPY_THIS(effectors);
            return copy;
        }
    };
    static_assert(sizeof(HUDInterfaceMultitextureOverlay<NativeEndian>) == 0x1E0);

    ENDIAN_TEMPLATE(EndianType) struct GrenadeHUDInterface {
        EndianType<HUDInterfaceAnchor> anchor;
        PAD(0x2);
        PAD(0x20);
        Point2DInt<EndianType> background_anchor_offset;
        EndianType<float> background_width_scale;
        EndianType<float> background_height_scale;
        EndianType<HUDInterfaceScalingFlags> background_scaling_flags;
        PAD(0x2);
        PAD(0x14);
        TagDependency<EndianType> background_interface_bitmap;
        EndianType<ColorARGBInt> background_default_color;
        EndianType<ColorARGBInt> background_flashing_color;
        EndianType<float> background_flash_period;
        EndianType<float> background_flash_delay;
        EndianType<std::int16_t> background_number_of_flashes;
        EndianType<HUDInterfaceFlashFlags> background_flash_flags;
        EndianType<float> background_flash_length;
        EndianType<ColorARGBInt> background_disabled_color;
        PAD(0x4);
        EndianType<Index> background_sequence_index;
        PAD(0x2);
        TagReflexive<EndianType, HUDInterfaceMultitextureOverlay> background_multitexture_overlays;
        PAD(0x4);
        Point2DInt<EndianType> total_grenades_background_anchor_offset;
        EndianType<float> total_grenades_background_width_scale;
        EndianType<float> total_grenades_background_height_scale;
        EndianType<HUDInterfaceScalingFlags> total_grenades_background_scaling_flags;
        PAD(0x2);
        PAD(0x14);
        TagDependency<EndianType> total_grenades_background_interface_bitmap;
        EndianType<ColorARGBInt> total_grenades_background_default_color;
        EndianType<ColorARGBInt> total_grenades_background_flashing_color;
        EndianType<float> total_grenades_background_flash_period;
        EndianType<float> total_grenades_background_flash_delay;
        EndianType<std::int16_t> total_grenades_background_number_of_flashes;
        EndianType<HUDInterfaceFlashFlags> total_grenades_background_flash_flags;
        EndianType<float> total_grenades_background_flash_length;
        EndianType<ColorARGBInt> total_grenades_background_disabled_color;
        PAD(0x4);
        EndianType<Index> total_grenades_background_sequence_index;
        PAD(0x2);
        TagReflexive<EndianType, HUDInterfaceMultitextureOverlay> total_grenades_background_multitexture_overlays;
        PAD(0x4);
        Point2DInt<EndianType> total_grenades_numbers_anchor_offset;
        EndianType<float> total_grenades_numbers_width_scale;
        EndianType<float> total_grenades_numbers_height_scale;
        EndianType<HUDInterfaceScalingFlags> total_grenades_numbers_scaling_flags;
        PAD(0x2);
        PAD(0x14);
        EndianType<ColorARGBInt> total_grenades_numbers_default_color;
        EndianType<ColorARGBInt> total_grenades_numbers_flashing_color;
        EndianType<float> total_grenades_numbers_flash_period;
        EndianType<float> total_grenades_numbers_flash_delay;
        EndianType<std::int16_t> total_grenades_numbers_number_of_flashes;
        EndianType<HUDInterfaceFlashFlags> total_grenades_numbers_flash_flags;
        EndianType<float> total_grenades_numbers_flash_length;
        EndianType<ColorARGBInt> total_grenades_numbers_disabled_color;
        PAD(0x4);
        std::int8_t total_grenades_numbers_maximum_number_of_digits;
        HUDInterfaceNumberFlags total_grenades_numbers_flags;
        std::int8_t total_grenades_numbers_number_of_fractional_digits;
        PAD(0x1);
        PAD(0xC);
        EndianType<std::int16_t> flash_cutoff;
        PAD(0x2);
        TagDependency<EndianType> total_grenades_overlay_bitmap;
        TagReflexive<EndianType, GrenadeHUDInterfaceOverlay> total_grenades_overlays;
        TagReflexive<EndianType, GrenadeHUDInterfaceSound> total_grenades_warning_sounds;
        PAD(0x44);
        EndianType<Index> messaging_information_sequence_index;
        EndianType<std::int16_t> messaging_information_width_offset;
        Point2DInt<EndianType> messaging_information_offset_from_reference_corner;
        EndianType<ColorARGBInt> messaging_information_override_icon_color;
        std::int8_t messaging_information_frame_rate;
        HUDInterfaceMessagingFlags messaging_information_flags;
        EndianType<Index> messaging_information_text_index;
        PAD(0x30);
        ENDIAN_TEMPLATE(NewEndian) operator GrenadeHUDInterface<NewEndian>() const {
            GrenadeHUDInterface<NewEndian> copy = {};
            COPY_THIS(anchor);
            COPY_THIS(background_anchor_offset);
            COPY_THIS(background_width_scale);
            COPY_THIS(background_height_scale);
            COPY_THIS(background_scaling_flags);
            COPY_THIS(background_interface_bitmap);
            COPY_THIS(background_default_color);
            COPY_THIS(background_flashing_color);
            COPY_THIS(background_flash_period);
            COPY_THIS(background_flash_delay);
            COPY_THIS(background_number_of_flashes);
            COPY_THIS(background_flash_flags);
            COPY_THIS(background_flash_length);
            COPY_THIS(background_disabled_color);
            COPY_THIS(background_sequence_index);
            COPY_THIS(background_multitexture_overlays);
            COPY_THIS(total_grenades_background_anchor_offset);
            COPY_THIS(total_grenades_background_width_scale);
            COPY_THIS(total_grenades_background_height_scale);
            COPY_THIS(total_grenades_background_scaling_flags);
            COPY_THIS(total_grenades_background_interface_bitmap);
            COPY_THIS(total_grenades_background_default_color);
            COPY_THIS(total_grenades_background_flashing_color);
            COPY_THIS(total_grenades_background_flash_period);
            COPY_THIS(total_grenades_background_flash_delay);
            COPY_THIS(total_grenades_background_number_of_flashes);
            COPY_THIS(total_grenades_background_flash_flags);
            COPY_THIS(total_grenades_background_flash_length);
            COPY_THIS(total_grenades_background_disabled_color);
            COPY_THIS(total_grenades_background_sequence_index);
            COPY_THIS(total_grenades_background_multitexture_overlays);
            COPY_THIS(total_grenades_numbers_anchor_offset);
            COPY_THIS(total_grenades_numbers_width_scale);
            COPY_THIS(total_grenades_numbers_height_scale);
            COPY_THIS(total_grenades_numbers_scaling_flags);
            COPY_THIS(total_grenades_numbers_default_color);
            COPY_THIS(total_grenades_numbers_flashing_color);
            COPY_THIS(total_grenades_numbers_flash_period);
            COPY_THIS(total_grenades_numbers_flash_delay);
            COPY_THIS(total_grenades_numbers_number_of_flashes);
            COPY_THIS(total_grenades_numbers_flash_flags);
            COPY_THIS(total_grenades_numbers_flash_length);
            COPY_THIS(total_grenades_numbers_disabled_color);
            COPY_THIS(total_grenades_numbers_maximum_number_of_digits);
            COPY_THIS(total_grenades_numbers_flags);
            COPY_THIS(total_grenades_numbers_number_of_fractional_digits);
            COPY_THIS(flash_cutoff);
            COPY_THIS(total_grenades_overlay_bitmap);
            COPY_THIS(total_grenades_overlays);
            COPY_THIS(total_grenades_warning_sounds);
            COPY_THIS(messaging_information_sequence_index);
            COPY_THIS(messaging_information_width_offset);
            COPY_THIS(messaging_information_offset_from_reference_corner);
            COPY_THIS(messaging_information_override_icon_color);
            COPY_THIS(messaging_information_frame_rate);
            COPY_THIS(messaging_information_flags);
            COPY_THIS(messaging_information_text_index);
            return copy;
        }
    };
    static_assert(sizeof(GrenadeHUDInterface<NativeEndian>) == 0x1F8);

    ENDIAN_TEMPLATE(EndianType) struct HUDGlobalsButtonIcon {
        EndianType<Index> sequence_index;
        EndianType<std::int16_t> width_offset;
        Point2DInt<EndianType> offset_from_reference_corner;
        EndianType<ColorARGBInt> override_icon_color;
        std::int8_t frame_rate;
        HUDInterfaceMessagingFlags flags;
        EndianType<Index> text_index;
        ENDIAN_TEMPLATE(NewEndian) operator HUDGlobalsButtonIcon<NewEndian>() const {
            HUDGlobalsButtonIcon<NewEndian> copy;
            COPY_THIS(sequence_index);
            COPY_THIS(width_offset);
            COPY_THIS(offset_from_reference_corner);
            COPY_THIS(override_icon_color);
            COPY_THIS(frame_rate);
            COPY_THIS(flags);
            COPY_THIS(text_index);
            return copy;
        }
    };
    static_assert(sizeof(HUDGlobalsButtonIcon<NativeEndian>) == 0x10);

    ENDIAN_TEMPLATE(EndianType) struct HUDGlobalsAnniversaryRemapTarget {
        TagDependency<EndianType> target_bitmap;
        EndianType<HUDGlobalsAnniversaryRemapTargetLanguage> language;
        EndianType<HUDGlobalsAnniversaryRemapTargetFlags> flags;
        ENDIAN_TEMPLATE(NewEndian) operator HUDGlobalsAnniversaryRemapTarget<NewEndian>() const {
            HUDGlobalsAnniversaryRemapTarget<NewEndian> copy;
            COPY_THIS(target_bitmap);
            COPY_THIS(language);
            COPY_THIS(flags);
            return copy;
        }
    };
    static_assert(sizeof(HUDGlobalsAnniversaryRemapTarget<NativeEndian>) == 0x14);

    ENDIAN_TEMPLATE(EndianType) struct HUDGlobalsAnniversaryRemap {
        TagDependency<EndianType> source_bitmap;
        TagReflexive<EndianType, HUDGlobalsAnniversaryRemapTarget> targets;
        ENDIAN_TEMPLATE(NewEndian) operator HUDGlobalsAnniversaryRemap<NewEndian>() const {
            HUDGlobalsAnniversaryRemap<NewEndian> copy;
            COPY_THIS(source_bitmap);
            COPY_THIS(targets);
            return copy;
        }
    };
    static_assert(sizeof(HUDGlobalsAnniversaryRemap<NativeEndian>) == 0x1C);

    ENDIAN_TEMPLATE(EndianType) struct HUDGlobalsWaypointArrow {
        TagString name;
        PAD(0x8);
        EndianType<ColorARGBInt> color;
        EndianType<float> opacity;
        EndianType<float> translucency;
        EndianType<Index> on_screen_sequence_index;
        EndianType<Index> off_screen_sequence_index;
        EndianType<Index> occluded_sequence_index;
        PAD(0x2);
        PAD(0x10);
        EndianType<HUDGlobalsWaypointArrowFlags> flags;
        PAD(0x18);
        ENDIAN_TEMPLATE(NewEndian) operator HUDGlobalsWaypointArrow<NewEndian>() const {
            HUDGlobalsWaypointArrow<NewEndian> copy = {};
            COPY_THIS(name);
            COPY_THIS(color);
            COPY_THIS(opacity);
            COPY_THIS(translucency);
            COPY_THIS(on_screen_sequence_index);
            COPY_THIS(off_screen_sequence_index);
            COPY_THIS(occluded_sequence_index);
            COPY_THIS(flags);
            return copy;
        }
    };
    static_assert(sizeof(HUDGlobalsWaypointArrow<NativeEndian>) == 0x68);

    ENDIAN_TEMPLATE(EndianType) struct HUDGlobals {
        EndianType<HUDInterfaceAnchor> anchor;
        PAD(0x2);
        PAD(0x20);
        Point2DInt<EndianType> anchor_offset;
        EndianType<float> width_scale;
        EndianType<float> height_scale;
        EndianType<HUDInterfaceScalingFlags> scaling_flags;
        PAD(0x2);
        PAD(0x14);
        TagDependency<EndianType> fullscreen_font;
        TagDependency<EndianType> splitscreen_font;
        EndianType<float> up_time;
        EndianType<float> fade_time;
        ColorARGB<EndianType> icon_color;
        ColorARGB<EndianType> text_color;
        EndianType<float> text_spacing;
        TagDependency<EndianType> item_message_text;
        TagDependency<EndianType> icon_bitmap;
        TagDependency<EndianType> alternate_icon_text;
        TagReflexive<EndianType, HUDGlobalsButtonIcon> button_icons;
        EndianType<ColorARGBInt> hud_help_default_color;
        EndianType<ColorARGBInt> hud_help_flashing_color;
        EndianType<float> hud_help_flash_period;
        EndianType<float> hud_help_flash_delay;
        EndianType<std::int16_t> hud_help_number_of_flashes;
        EndianType<HUDInterfaceFlashFlags> hud_help_flash_flags;
        EndianType<float> hud_help_flash_length;
        EndianType<ColorARGBInt> hud_help_disabled_color;
        PAD(0x4);
        TagDependency<EndianType> hud_messages;
        EndianType<ColorARGBInt> objective_default_color;
        EndianType<ColorARGBInt> objective_flashing_color;
        EndianType<float> objective_flash_period;
        EndianType<float> objective_flash_delay;
        EndianType<std::int16_t> objective_number_of_flashes;
        EndianType<HUDInterfaceFlashFlags> objective_flash_flags;
        EndianType<float> objective_flash_length;
        EndianType<ColorARGBInt> objective_disabled_color;
        EndianType<std::int16_t> objective_uptime_ticks;
        EndianType<std::int16_t> objective_fade_ticks;
        EndianType<float> top_offset;
        EndianType<float> bottom_offset;
        EndianType<float> left_offset;
        EndianType<float> right_offset;
        PAD(0x20);
        TagDependency<EndianType> arrow_bitmap;
        TagReflexive<EndianType, HUDGlobalsWaypointArrow> waypoint_arrows;
        PAD(0x50);
        EndianType<float> hud_scale_in_multiplayer;
        PAD(0x100);
        TagDependency<EndianType> default_weapon_hud;
        EndianType<float> motion_sensor_range;
        EndianType<float> motion_sensor_velocity_sensitivity;
        EndianType<float> motion_sensor_scale;
        Rectangle2D<EndianType> default_chapter_title_bounds;
        PAD(0x2C);
        EndianType<std::int16_t> hud_damage_top_offset;
        EndianType<std::int16_t> hud_damage_bottom_offset;
        EndianType<std::int16_t> hud_damage_left_offset;
        EndianType<std::int16_t> hud_damage_right_offset;
        PAD(0x20);
        TagDependency<EndianType> hud_damage_indicator_bitmap;
        EndianType<Index> hud_damage_sequence_index;
        EndianType<Index> hud_damage_multiplayer_sequence_index;
        EndianType<ColorARGBInt> hud_damage_color;
        PAD(0x10);
        EndianType<ColorARGBInt> not_much_time_left_default_color;
        EndianType<ColorARGBInt> not_much_time_left_flashing_color;
        EndianType<float> not_much_time_left_flash_period;
        EndianType<float> not_much_time_left_flash_delay;
        EndianType<std::int16_t> not_much_time_left_number_of_flashes;
        EndianType<HUDInterfaceFlashFlags> not_much_time_left_flash_flags;
        EndianType<float> not_much_time_left_flash_length;
        EndianType<ColorARGBInt> not_much_time_left_disabled_color;
        PAD(0x4);
        EndianType<ColorARGBInt> time_out_flash_default_color;
        EndianType<ColorARGBInt> time_out_flash_flashing_color;
        EndianType<float> time_out_flash_flash_period;
        EndianType<float> time_out_flash_flash_delay;
        EndianType<std::int16_t> time_out_flash_number_of_flashes;
        EndianType<HUDInterfaceFlashFlags> time_out_flash_flash_flags;
        EndianType<float> time_out_flash_flash_length;
        EndianType<ColorARGBInt> time_out_flash_disabled_color;
        PAD(0x4);
        PAD(0x28);
        TagDependency<EndianType> carnage_report_bitmap;
        EndianType<Index> loading_begin_text;
        EndianType<Index> loading_end_text;
        EndianType<Index> checkpoint_begin_text;
        EndianType<Index> checkpoint_end_text;
        TagDependency<EndianType> checkpoint_sound;
        TagReflexive<EndianType, HUDGlobalsAnniversaryRemap> anniversary_hud_remaps;
        PAD(0x54);
        ENDIAN_TEMPLATE(NewEndian) operator HUDGlobals<NewEndian>() const {
            HUDGlobals<NewEndian> copy = {};
            COPY_THIS(anchor);
            COPY_THIS(anchor_offset);
            COPY_THIS(width_scale);
            COPY_THIS(height_scale);
            COPY_THIS(scaling_flags);
            COPY_THIS(fullscreen_font);
            COPY_THIS(splitscreen_font);
            COPY_THIS(up_time);
            COPY_THIS(fade_time);
            COPY_THIS(icon_color);
            COPY_THIS(text_color);
            COPY_THIS(text_spacing);
            COPY_THIS(item_message_text);
            COPY_THIS(icon_bitmap);
            COPY_THIS(alternate_icon_text);
            COPY_THIS(button_icons);
            COPY_THIS(hud_help_default_color);
            COPY_THIS(hud_help_flashing_color);
            COPY_THIS(hud_help_flash_period);
            COPY_THIS(hud_help_flash_delay);
            COPY_THIS(hud_help_number_of_flashes);
            COPY_THIS(hud_help_flash_flags);
            COPY_THIS(hud_help_flash_length);
            COPY_THIS(hud_help_disabled_color);
            COPY_THIS(hud_messages);
            COPY_THIS(objective_default_color);
            COPY_THIS(objective_flashing_color);
            COPY_THIS(objective_flash_period);
            COPY_THIS(objective_flash_delay);
            COPY_THIS(objective_number_of_flashes);
            COPY_THIS(objective_flash_flags);
            COPY_THIS(objective_flash_length);
            COPY_THIS(objective_disabled_color);
            COPY_THIS(objective_uptime_ticks);
            COPY_THIS(objective_fade_ticks);
            COPY_THIS(top_offset);
            COPY_THIS(bottom_offset);
            COPY_THIS(left_offset);
            COPY_THIS(right_offset);
            COPY_THIS(arrow_bitmap);
            COPY_THIS(waypoint_arrows);
            COPY_THIS(hud_scale_in_multiplayer);
            COPY_THIS(default_weapon_hud);
            COPY_THIS(motion_sensor_range);
            COPY_THIS(motion_sensor_velocity_sensitivity);
            COPY_THIS(motion_sensor_scale);
            COPY_THIS(default_chapter_title_bounds);
            COPY_THIS(hud_damage_top_offset);
            COPY_THIS(hud_damage_bottom_offset);
            COPY_THIS(hud_damage_left_offset);
            COPY_THIS(hud_damage_right_offset);
            COPY_THIS(hud_damage_indicator_bitmap);
            COPY_THIS(hud_damage_sequence_index);
            COPY_THIS(hud_damage_multiplayer_sequence_index);
            COPY_THIS(hud_damage_color);
            COPY_THIS(not_much_time_left_default_color);
            COPY_THIS(not_much_time_left_flashing_color);
            COPY_THIS(not_much_time_left_flash_period);
            COPY_THIS(not_much_time_left_flash_delay);
            COPY_THIS(not_much_time_left_number_of_flashes);
            COPY_THIS(not_much_time_left_flash_flags);
            COPY_THIS(not_much_time_left_flash_length);
            COPY_THIS(not_much_time_left_disabled_color);
            COPY_THIS(time_out_flash_default_color);
            COPY_THIS(time_out_flash_flashing_color);
            COPY_THIS(time_out_flash_flash_period);
            COPY_THIS(time_out_flash_flash_delay);
            COPY_THIS(time_out_flash_number_of_flashes);
            COPY_THIS(time_out_flash_flash_flags);
            COPY_THIS(time_out_flash_flash_length);
            COPY_THIS(time_out_flash_disabled_color);
            COPY_THIS(carnage_report_bitmap);
            COPY_THIS(loading_begin_text);
            COPY_THIS(loading_end_text);
            COPY_THIS(checkpoint_begin_text);
            COPY_THIS(checkpoint_end_text);
            COPY_THIS(checkpoint_sound);
            COPY_THIS(anniversary_hud_remaps);
            return copy;
        }
    };
    static_assert(sizeof(HUDGlobals<NativeEndian>) == 0x450);

    ENDIAN_TEMPLATE(EndianType) struct HUDMessageTextElement {
        std::int8_t type;
        std::uint8_t data;
        ENDIAN_TEMPLATE(NewEndian) operator HUDMessageTextElement<NewEndian>() const {
            HUDMessageTextElement<NewEndian> copy;
            COPY_THIS(type);
            COPY_THIS(data);
            return copy;
        }
    };
    static_assert(sizeof(HUDMessageTextElement<NativeEndian>) == 0x2);

    ENDIAN_TEMPLATE(EndianType) struct HUDMessageTextMessage {
        TagString name;
        EndianType<Index> start_index_into_text_blob;
        EndianType<Index> start_index_of_message_block;
        std::uint8_t panel_count;
        PAD(0x3);
        PAD(0x18);
        ENDIAN_TEMPLATE(NewEndian) operator HUDMessageTextMessage<NewEndian>() const {
            HUDMessageTextMessage<NewEndian> copy = {};
            COPY_THIS(name);
            COPY_THIS(start_index_into_text_blob);
            COPY_THIS(start_index_of_message_block);
            COPY_THIS(panel_count);
            return copy;
        }
    };
    static_assert(sizeof(HUDMessageTextMessage<NativeEndian>) == 0x40);

    ENDIAN_TEMPLATE(EndianType) struct HUDMessageText {
        TagDataOffset<EndianType> text_data;
        TagReflexive<EndianType, HUDMessageTextElement> message_elements;
        TagReflexive<EndianType, HUDMessageTextMessage> messages;
        PAD(0x54);
        ENDIAN_TEMPLATE(NewEndian) operator HUDMessageText<NewEndian>() const {
            HUDMessageText<NewEndian> copy = {};
            COPY_THIS(text_data);
            COPY_THIS(message_elements);
            COPY_THIS(messages);
            return copy;
        }
    };
    static_assert(sizeof(HUDMessageText<NativeEndian>) == 0x80);

    ENDIAN_TEMPLATE(EndianType) struct HUDNumber {
        TagDependency<EndianType> digits_bitmap;
        std::int8_t bitmap_digit_width;
        std::int8_t screen_digit_width;
        std::int8_t x_offset;
        std::int8_t y_offset;
        std::int8_t decimal_point_width;
        std::int8_t colon_width;
        PAD(0x2);
        PAD(0x4C);
        ENDIAN_TEMPLATE(NewEndian) operator HUDNumber<NewEndian>() const {
            HUDNumber<NewEndian> copy = {};
            COPY_THIS(digits_bitmap);
            COPY_THIS(bitmap_digit_width);
            COPY_THIS(screen_digit_width);
            COPY_THIS(x_offset);
            COPY_THIS(y_offset);
            COPY_THIS(decimal_point_width);
            COPY_THIS(colon_width);
            return copy;
        }
    };
    static_assert(sizeof(HUDNumber<NativeEndian>) == 0x64);

    ENDIAN_TEMPLATE(EndianType) struct InputDeviceDefaults {
        EndianType<InputDeviceDefaultsDeviceType> device_type;
        EndianType<InputDeviceDefaultsFlags> flags;
        TagDataOffset<EndianType> device_id;
        TagDataOffset<EndianType> profile;
        ENDIAN_TEMPLATE(NewEndian) operator InputDeviceDefaults<NewEndian>() const {
            InputDeviceDefaults<NewEndian> copy;
            COPY_THIS(device_type);
            COPY_THIS(flags);
            COPY_THIS(device_id);
            COPY_THIS(profile);
            return copy;
        }
    };
    static_assert(sizeof(InputDeviceDefaults<NativeEndian>) == 0x2C);

    ENDIAN_TEMPLATE(EndianType) struct ItemCollectionPermutation {
        PAD(0x20);
        EndianType<float> weight;
        TagDependency<EndianType> item;
        PAD(0x20);
        ENDIAN_TEMPLATE(NewEndian) operator ItemCollectionPermutation<NewEndian>() const {
            ItemCollectionPermutation<NewEndian> copy = {};
            COPY_THIS(weight);
            COPY_THIS(item);
            return copy;
        }
    };
    static_assert(sizeof(ItemCollectionPermutation<NativeEndian>) == 0x54);

    ENDIAN_TEMPLATE(EndianType) struct ItemCollection {
        TagReflexive<EndianType, ItemCollectionPermutation> permutations;
        EndianType<std::int16_t> default_spawn_time;
        PAD(0x2);
        PAD(0x4C);
        ENDIAN_TEMPLATE(NewEndian) operator ItemCollection<NewEndian>() const {
            ItemCollection<NewEndian> copy = {};
            COPY_THIS(permutations);
            COPY_THIS(default_spawn_time);
            return copy;
        }
    };
    static_assert(sizeof(ItemCollection<NativeEndian>) == 0x5C);

    ENDIAN_TEMPLATE(EndianType) struct LensFlareReflection {
        EndianType<LensFlareReflectionFlags> flags;
        PAD(0x2);
        EndianType<Index> bitmap_index;
        PAD(0x2);
        PAD(0x14);
        EndianType<float> position;
        EndianType<float> rotation_offset;
        PAD(0x4);
        Bounds<EndianType<float>> radius;
        EndianType<LensFlareRadiusScaledBy> radius_scaled_by;
        PAD(0x2);
        Bounds<EndianType<Fraction>> brightness;
        EndianType<LensFlareRadiusScaledBy> brightness_scaled_by;
        PAD(0x2);
        ColorARGB<EndianType> tint_color;
        ColorARGB<EndianType> color_lower_bound;
        ColorARGB<EndianType> color_upper_bound;
        EndianType<LensFlareReflectionMoreFlags> more_flags;
        EndianType<WaveFunction> animation_function;
        EndianType<float> animation_period;
        EndianType<float> animation_phase;
        PAD(0x4);
        ENDIAN_TEMPLATE(NewEndian) operator LensFlareReflection<NewEndian>() const {
            LensFlareReflection<NewEndian> copy = {};
            COPY_THIS(flags);
            COPY_THIS(bitmap_index);
            COPY_THIS(position);
            COPY_THIS(rotation_offset);
            COPY_THIS(radius);
            COPY_THIS(radius_scaled_by);
            COPY_THIS(brightness);
            COPY_THIS(brightness_scaled_by);
            COPY_THIS(tint_color);
            COPY_THIS(color_lower_bound);
            COPY_THIS(color_upper_bound);
            COPY_THIS(more_flags);
            COPY_THIS(animation_function);
            COPY_THIS(animation_period);
            COPY_THIS(animation_phase);
            return copy;
        }
    };
    static_assert(sizeof(LensFlareReflection<NativeEndian>) == 0x80);

    ENDIAN_TEMPLATE(EndianType) struct LensFlare {
        EndianType<Angle> falloff_angle;
        EndianType<Angle> cutoff_angle;
        LittleEndian<float> cos_falloff_angle;
        LittleEndian<float> cos_cutoff_angle;
        EndianType<float> occlusion_radius;
        EndianType<LensFlareOcclusionOffsetDirection> occlusion_offset_direction;
        PAD(0x2);
        EndianType<float> near_fade_distance;
        EndianType<float> far_fade_distance;
        TagDependency<EndianType> bitmap;
        EndianType<LensFlareFlags> flags;
        PAD(0x2);
        PAD(0x4C);
        EndianType<LensFlareRotationFunction> rotation_function;
        PAD(0x2);
        EndianType<Angle> rotation_function_scale;
        PAD(0x18);
        EndianType<float> horizontal_scale;
        EndianType<float> vertical_scale;
        PAD(0x1C);
        TagReflexive<EndianType, LensFlareReflection> reflections;
        PAD(0x20);
        ENDIAN_TEMPLATE(NewEndian) operator LensFlare<NewEndian>() const {
            LensFlare<NewEndian> copy = {};
            COPY_THIS(falloff_angle);
            COPY_THIS(cutoff_angle);
            COPY_THIS(cos_falloff_angle);
            COPY_THIS(cos_cutoff_angle);
            COPY_THIS(occlusion_radius);
            COPY_THIS(occlusion_offset_direction);
            COPY_THIS(near_fade_distance);
            COPY_THIS(far_fade_distance);
            COPY_THIS(bitmap);
            COPY_THIS(flags);
            COPY_THIS(rotation_function);
            COPY_THIS(rotation_function_scale);
            COPY_THIS(horizontal_scale);
            COPY_THIS(vertical_scale);
            COPY_THIS(reflections);
            return copy;
        }
    };
    static_assert(sizeof(LensFlare<NativeEndian>) == 0xF0);

    ENDIAN_TEMPLATE(EndianType) struct Light {
        EndianType<LightFlags> flags;
        EndianType<float> radius;
        Bounds<EndianType<float>> radius_modifer;
        EndianType<Angle> falloff_angle;
        EndianType<Angle> cutoff_angle;
        EndianType<float> lens_flare_only_radius;
        LittleEndian<float> cos_falloff_angle;
        LittleEndian<float> cos_cutoff_angle;
        LittleEndian<float> unknown_two;
        LittleEndian<float> sin_cutoff_angle;
        PAD(0x8);
        EndianType<ColorInterpolationFlags> interpolation_flags;
        ColorARGB<EndianType> color_lower_bound;
        ColorARGB<EndianType> color_upper_bound;
        PAD(0xC);
        TagDependency<EndianType> primary_cube_map;
        PAD(0x2);
        EndianType<WaveFunction> texture_animation_function;
        EndianType<float> texture_animation_period;
        TagDependency<EndianType> secondary_cube_map;
        PAD(0x2);
        EndianType<WaveFunction> yaw_function;
        EndianType<float> yaw_period;
        PAD(0x2);
        EndianType<WaveFunction> roll_function;
        EndianType<float> roll_period;
        PAD(0x2);
        EndianType<WaveFunction> pitch_function;
        EndianType<float> pitch_period;
        PAD(0x8);
        TagDependency<EndianType> lens_flare;
        PAD(0x18);
        EndianType<float> intensity;
        ColorRGB<EndianType> color;
        PAD(0x10);
        EndianType<float> duration;
        PAD(0x2);
        EndianType<FunctionType> falloff_function;
        PAD(0x8);
        PAD(0x5C);
        ENDIAN_TEMPLATE(NewEndian) operator Light<NewEndian>() const {
            Light<NewEndian> copy = {};
            COPY_THIS(flags);
            COPY_THIS(radius);
            COPY_THIS(radius_modifer);
            COPY_THIS(falloff_angle);
            COPY_THIS(cutoff_angle);
            COPY_THIS(lens_flare_only_radius);
            COPY_THIS(cos_falloff_angle);
            COPY_THIS(cos_cutoff_angle);
            COPY_THIS(unknown_two);
            COPY_THIS(sin_cutoff_angle);
            COPY_THIS(interpolation_flags);
            COPY_THIS(color_lower_bound);
            COPY_THIS(color_upper_bound);
            COPY_THIS(primary_cube_map);
            COPY_THIS(texture_animation_function);
            COPY_THIS(texture_animation_period);
            COPY_THIS(secondary_cube_map);
            COPY_THIS(yaw_function);
            COPY_THIS(yaw_period);
            COPY_THIS(roll_function);
            COPY_THIS(roll_period);
            COPY_THIS(pitch_function);
            COPY_THIS(pitch_period);
            COPY_THIS(lens_flare);
            COPY_THIS(intensity);
            COPY_THIS(color);
            COPY_THIS(duration);
            COPY_THIS(falloff_function);
            return copy;
        }
    };
    static_assert(sizeof(Light<NativeEndian>) == 0x160);

    ENDIAN_TEMPLATE(EndianType) struct LightVolumeFrame {
        PAD(0x10);
        EndianType<float> offset_from_marker;
        EndianType<float> offset_exponent;
        EndianType<float> length;
        PAD(0x20);
        EndianType<float> radius_hither;
        EndianType<float> radius_yon;
        EndianType<float> radius_exponent;
        PAD(0x20);
        ColorARGB<EndianType> tint_color_hither;
        ColorARGB<EndianType> tint_color_yon;
        EndianType<float> tint_color_exponent;
        EndianType<float> brightness_exponent;
        PAD(0x20);
        ENDIAN_TEMPLATE(NewEndian) operator LightVolumeFrame<NewEndian>() const {
            LightVolumeFrame<NewEndian> copy = {};
            COPY_THIS(offset_from_marker);
            COPY_THIS(offset_exponent);
            COPY_THIS(length);
            COPY_THIS(radius_hither);
            COPY_THIS(radius_yon);
            COPY_THIS(radius_exponent);
            COPY_THIS(tint_color_hither);
            COPY_THIS(tint_color_yon);
            COPY_THIS(tint_color_exponent);
            COPY_THIS(brightness_exponent);
            return copy;
        }
    };
    static_assert(sizeof(LightVolumeFrame<NativeEndian>) == 0xB0);

    ENDIAN_TEMPLATE(EndianType) struct LightVolume {
        TagString attachment_marker;
        PAD(0x2);
        EndianType<LightVolumeFlags> flags;
        PAD(0x10);
        EndianType<float> near_fade_distance;
        EndianType<float> far_fade_distance;
        EndianType<Fraction> perpendicular_brightness_scale;
        EndianType<Fraction> parallel_brightness_scale;
        EndianType<FunctionOut> brightness_scale_source;
        PAD(0x2);
        PAD(0x14);
        TagDependency<EndianType> map;
        EndianType<Index> sequence_index;
        EndianType<std::int16_t> count;
        PAD(0x48);
        EndianType<FunctionOut> frame_animation_source;
        PAD(0x2);
        PAD(0x24);
        PAD(0x40);
        TagReflexive<EndianType, LightVolumeFrame> frames;
        PAD(0x20);
        ENDIAN_TEMPLATE(NewEndian) operator LightVolume<NewEndian>() const {
            LightVolume<NewEndian> copy = {};
            COPY_THIS(attachment_marker);
            COPY_THIS(flags);
            COPY_THIS(near_fade_distance);
            COPY_THIS(far_fade_distance);
            COPY_THIS(perpendicular_brightness_scale);
            COPY_THIS(parallel_brightness_scale);
            COPY_THIS(brightness_scale_source);
            COPY_THIS(map);
            COPY_THIS(sequence_index);
            COPY_THIS(count);
            COPY_THIS(frame_animation_source);
            COPY_THIS(frames);
            return copy;
        }
    };
    static_assert(sizeof(LightVolume<NativeEndian>) == 0x14C);

    ENDIAN_TEMPLATE(EndianType) struct LightningMarker {
        TagString attachment_marker;
        EndianType<LightningMarkerFlag> flags;
        PAD(0x2);
        EndianType<std::int16_t> octaves_to_next_marker;
        PAD(0x2);
        PAD(0x4C);
        Vector3D<EndianType> random_position_bounds;
        EndianType<float> random_jitter;
        EndianType<float> thickness;
        ColorARGB<EndianType> tint;
        PAD(0x4C);
        ENDIAN_TEMPLATE(NewEndian) operator LightningMarker<NewEndian>() const {
            LightningMarker<NewEndian> copy = {};
            COPY_THIS(attachment_marker);
            COPY_THIS(flags);
            COPY_THIS(octaves_to_next_marker);
            COPY_THIS(random_position_bounds);
            COPY_THIS(random_jitter);
            COPY_THIS(thickness);
            COPY_THIS(tint);
            return copy;
        }
    };
    static_assert(sizeof(LightningMarker<NativeEndian>) == 0xE4);

    ENDIAN_TEMPLATE(EndianType) struct LightningShader {
        PAD(0x24);
        LittleEndian<std::uint32_t> make_it_work;
        EndianType<ParticleShaderFlags> shader_flags;
        EndianType<FramebufferBlendFunction> framebuffer_blend_function;
        EndianType<FramebufferFadeMode> framebuffer_fade_mode;
        EndianType<IsUnfilteredFlag> map_flags;
        PAD(0x1C);
        PAD(0xC);
        LittleEndian<std::uint32_t> some_more_stuff_that_should_be_set_for_some_reason;
        PAD(0x2);
        PAD(0x2);
        PAD(0x38);
        PAD(0x1C);
        ENDIAN_TEMPLATE(NewEndian) operator LightningShader<NewEndian>() const {
            LightningShader<NewEndian> copy = {};
            COPY_THIS(make_it_work);
            COPY_THIS(shader_flags);
            COPY_THIS(framebuffer_blend_function);
            COPY_THIS(framebuffer_fade_mode);
            COPY_THIS(map_flags);
            COPY_THIS(some_more_stuff_that_should_be_set_for_some_reason);
            return copy;
        }
    };
    static_assert(sizeof(LightningShader<NativeEndian>) == 0xB4);

    ENDIAN_TEMPLATE(EndianType) struct Lightning {
        PAD(0x2);
        EndianType<std::int16_t> count;
        PAD(0x10);
        EndianType<float> near_fade_distance;
        EndianType<float> far_fade_distance;
        PAD(0x10);
        EndianType<FunctionOut> jitter_scale_source;
        EndianType<FunctionOut> thickness_scale_source;
        EndianType<FunctionNameNullable> tint_modulation_source;
        EndianType<FunctionOut> brightness_scale_source;
        TagDependency<EndianType> bitmap;
        PAD(0x54);
        TagReflexive<EndianType, LightningMarker> markers;
        TagReflexive<EndianType, LightningShader> shader;
        PAD(0x58);
        ENDIAN_TEMPLATE(NewEndian) operator Lightning<NewEndian>() const {
            Lightning<NewEndian> copy = {};
            COPY_THIS(count);
            COPY_THIS(near_fade_distance);
            COPY_THIS(far_fade_distance);
            COPY_THIS(jitter_scale_source);
            COPY_THIS(thickness_scale_source);
            COPY_THIS(tint_modulation_source);
            COPY_THIS(brightness_scale_source);
            COPY_THIS(bitmap);
            COPY_THIS(markers);
            COPY_THIS(shader);
            return copy;
        }
    };
    static_assert(sizeof(Lightning<NativeEndian>) == 0x108);

    ENDIAN_TEMPLATE(EndianType) struct MaterialEffectsMaterialEffectMaterial {
        TagDependency<EndianType> effect;
        TagDependency<EndianType> sound;
        PAD(0x10);
        ENDIAN_TEMPLATE(NewEndian) operator MaterialEffectsMaterialEffectMaterial<NewEndian>() const {
            MaterialEffectsMaterialEffectMaterial<NewEndian> copy = {};
            COPY_THIS(effect);
            COPY_THIS(sound);
            return copy;
        }
    };
    static_assert(sizeof(MaterialEffectsMaterialEffectMaterial<NativeEndian>) == 0x30);

    ENDIAN_TEMPLATE(EndianType) struct MaterialEffectsMaterialEffect {
        TagReflexive<EndianType, MaterialEffectsMaterialEffectMaterial> materials;
        PAD(0x10);
        ENDIAN_TEMPLATE(NewEndian) operator MaterialEffectsMaterialEffect<NewEndian>() const {
            MaterialEffectsMaterialEffect<NewEndian> copy = {};
            COPY_THIS(materials);
            return copy;
        }
    };
    static_assert(sizeof(MaterialEffectsMaterialEffect<NativeEndian>) == 0x1C);

    ENDIAN_TEMPLATE(EndianType) struct MaterialEffects {
        TagReflexive<EndianType, MaterialEffectsMaterialEffect> effects;
        PAD(0x80);
        ENDIAN_TEMPLATE(NewEndian) operator MaterialEffects<NewEndian>() const {
            MaterialEffects<NewEndian> copy = {};
            COPY_THIS(effects);
            return copy;
        }
    };
    static_assert(sizeof(MaterialEffects<NativeEndian>) == 0x8C);

    ENDIAN_TEMPLATE(EndianType) struct Meter {
        EndianType<IsUnusedFlag> flags;
        TagDependency<EndianType> stencil_bitmaps;
        TagDependency<EndianType> source_bitmap;
        EndianType<std::uint16_t> stencil_sequence_index;
        EndianType<std::uint16_t> source_sequence_index;
        PAD(0x10);
        PAD(0x4);
        EndianType<MeterInterpolateColors> interpolate_colors;
        EndianType<MeterAnchorColors> anchor_colors;
        PAD(0x8);
        ColorARGB<EndianType> empty_color;
        ColorARGB<EndianType> full_color;
        PAD(0x14);
        EndianType<float> unmask_distance;
        EndianType<float> mask_distance;
        PAD(0x14);
        TagDataOffset<EndianType> encoded_stencil;
        ENDIAN_TEMPLATE(NewEndian) operator Meter<NewEndian>() const {
            Meter<NewEndian> copy = {};
            COPY_THIS(flags);
            COPY_THIS(stencil_bitmaps);
            COPY_THIS(source_bitmap);
            COPY_THIS(stencil_sequence_index);
            COPY_THIS(source_sequence_index);
            COPY_THIS(interpolate_colors);
            COPY_THIS(anchor_colors);
            COPY_THIS(empty_color);
            COPY_THIS(full_color);
            COPY_THIS(unmask_distance);
            COPY_THIS(mask_distance);
            COPY_THIS(encoded_stencil);
            return copy;
        }
    };
    static_assert(sizeof(Meter<NativeEndian>) == 0xAC);

    ENDIAN_TEMPLATE(EndianType) struct ModelGeometry {
        EndianType<IsUnusedFlag> flags;
        PAD(0x20);
        TagReflexive<EndianType, ModelGeometryPart> parts;
        ENDIAN_TEMPLATE(NewEndian) operator ModelGeometry<NewEndian>() const {
            ModelGeometry<NewEndian> copy = {};
            COPY_THIS(flags);
            COPY_THIS(parts);
            return copy;
        }
    };
    static_assert(sizeof(ModelGeometry<NativeEndian>) == 0x30);

    ENDIAN_TEMPLATE(EndianType) struct Model {
        EndianType<ModelFlags> flags;
        EndianType<std::int32_t> node_list_checksum;
        EndianType<float> super_high_detail_cutoff;
        EndianType<float> high_detail_cutoff;
        EndianType<float> medium_detail_cutoff;
        EndianType<float> low_detail_cutoff;
        EndianType<float> super_low_detail_cutoff;
        EndianType<std::uint16_t> super_low_detail_node_count;
        EndianType<std::uint16_t> low_detail_node_count;
        EndianType<std::uint16_t> medium_detail_node_count;
        EndianType<std::uint16_t> high_detail_node_count;
        EndianType<std::uint16_t> super_high_detail_node_count;
        PAD(0x2);
        PAD(0x8);
        EndianType<float> base_map_u_scale;
        EndianType<float> base_map_v_scale;
        PAD(0x74);
        TagReflexive<EndianType, ModelMarker> markers;
        TagReflexive<EndianType, ModelNode> nodes;
        TagReflexive<EndianType, ModelRegion> regions;
        TagReflexive<EndianType, ModelGeometry> geometries;
        TagReflexive<EndianType, ModelShaderReference> shaders;
        ENDIAN_TEMPLATE(NewEndian) operator Model<NewEndian>() const {
            Model<NewEndian> copy = {};
            COPY_THIS(flags);
            COPY_THIS(node_list_checksum);
            COPY_THIS(super_high_detail_cutoff);
            COPY_THIS(high_detail_cutoff);
            COPY_THIS(medium_detail_cutoff);
            COPY_THIS(low_detail_cutoff);
            COPY_THIS(super_low_detail_cutoff);
            COPY_THIS(super_low_detail_node_count);
            COPY_THIS(low_detail_node_count);
            COPY_THIS(medium_detail_node_count);
            COPY_THIS(high_detail_node_count);
            COPY_THIS(super_high_detail_node_count);
            COPY_THIS(base_map_u_scale);
            COPY_THIS(base_map_v_scale);
            COPY_THIS(markers);
            COPY_THIS(nodes);
            COPY_THIS(regions);
            COPY_THIS(geometries);
            COPY_THIS(shaders);
            return copy;
        }
    };
    static_assert(sizeof(Model<NativeEndian>) == 0xE8);

    ENDIAN_TEMPLATE(EndianType) struct ModelAnimationsRotation {
        EndianType<std::int16_t> rotation[4];
        ENDIAN_TEMPLATE(NewEndian) operator ModelAnimationsRotation<NewEndian>() const {
            ModelAnimationsRotation<NewEndian> copy;
            COPY_THIS_ARRAY(rotation);
            return copy;
        }
    };
    static_assert(sizeof(ModelAnimationsRotation<NativeEndian>) == 0x8);

    ENDIAN_TEMPLATE(EndianType) struct ModelAnimationsTransform {
        Point3D<EndianType> transform;
        ENDIAN_TEMPLATE(NewEndian) operator ModelAnimationsTransform<NewEndian>() const {
            ModelAnimationsTransform<NewEndian> copy;
            COPY_THIS(transform);
            return copy;
        }
    };
    static_assert(sizeof(ModelAnimationsTransform<NativeEndian>) == 0xC);

    ENDIAN_TEMPLATE(EndianType) struct ModelAnimationscale {
        EndianType<Fraction> scale;
        ENDIAN_TEMPLATE(NewEndian) operator ModelAnimationscale<NewEndian>() const {
            ModelAnimationscale<NewEndian> copy;
            COPY_THIS(scale);
            return copy;
        }
    };
    static_assert(sizeof(ModelAnimationscale<NativeEndian>) == 0x4);

    ENDIAN_TEMPLATE(EndianType) struct ModelAnimationsFrameInfoDxDy {
        EndianType<float> dx;
        EndianType<float> dy;
        ENDIAN_TEMPLATE(NewEndian) operator ModelAnimationsFrameInfoDxDy<NewEndian>() const {
            ModelAnimationsFrameInfoDxDy<NewEndian> copy;
            COPY_THIS(dx);
            COPY_THIS(dy);
            return copy;
        }
    };
    static_assert(sizeof(ModelAnimationsFrameInfoDxDy<NativeEndian>) == 0x8);

    ENDIAN_TEMPLATE(EndianType) struct ModelAnimationsFrameInfoDxDyDyaw {
        EndianType<float> dx;
        EndianType<float> dy;
        EndianType<float> dyaw;
        ENDIAN_TEMPLATE(NewEndian) operator ModelAnimationsFrameInfoDxDyDyaw<NewEndian>() const {
            ModelAnimationsFrameInfoDxDyDyaw<NewEndian> copy;
            COPY_THIS(dx);
            COPY_THIS(dy);
            COPY_THIS(dyaw);
            return copy;
        }
    };
    static_assert(sizeof(ModelAnimationsFrameInfoDxDyDyaw<NativeEndian>) == 0xC);

    ENDIAN_TEMPLATE(EndianType) struct ModelAnimationsFrameInfoDxDyDzDyaw {
        EndianType<float> dx;
        EndianType<float> dy;
        EndianType<float> dz;
        EndianType<float> dyaw;
        ENDIAN_TEMPLATE(NewEndian) operator ModelAnimationsFrameInfoDxDyDzDyaw<NewEndian>() const {
            ModelAnimationsFrameInfoDxDyDzDyaw<NewEndian> copy;
            COPY_THIS(dx);
            COPY_THIS(dy);
            COPY_THIS(dz);
            COPY_THIS(dyaw);
            return copy;
        }
    };
    static_assert(sizeof(ModelAnimationsFrameInfoDxDyDzDyaw<NativeEndian>) == 0x10);

    ENDIAN_TEMPLATE(EndianType) struct ModelAnimationsAnimationGraphObjectOverlay {
        EndianType<Index> animation;
        EndianType<AnimationFunction> function;
        EndianType<AnimationFunctionControls> function_controls;
        PAD(0x2);
        PAD(0xC);
        ENDIAN_TEMPLATE(NewEndian) operator ModelAnimationsAnimationGraphObjectOverlay<NewEndian>() const {
            ModelAnimationsAnimationGraphObjectOverlay<NewEndian> copy = {};
            COPY_THIS(animation);
            COPY_THIS(function);
            COPY_THIS(function_controls);
            return copy;
        }
    };
    static_assert(sizeof(ModelAnimationsAnimationGraphObjectOverlay<NativeEndian>) == 0x14);

    ENDIAN_TEMPLATE(EndianType) struct ModelAnimationsUnitSeatAnimation {
        EndianType<Index> animation;
        ENDIAN_TEMPLATE(NewEndian) operator ModelAnimationsUnitSeatAnimation<NewEndian>() const {
            ModelAnimationsUnitSeatAnimation<NewEndian> copy;
            COPY_THIS(animation);
            return copy;
        }
    };
    static_assert(sizeof(ModelAnimationsUnitSeatAnimation<NativeEndian>) == 0x2);

    ENDIAN_TEMPLATE(EndianType) struct ModelAnimationsAnimationGraphUnitSeatikPoint {
        TagString marker;
        TagString attach_to_marker;
        ENDIAN_TEMPLATE(NewEndian) operator ModelAnimationsAnimationGraphUnitSeatikPoint<NewEndian>() const {
            ModelAnimationsAnimationGraphUnitSeatikPoint<NewEndian> copy;
            COPY_THIS(marker);
            COPY_THIS(attach_to_marker);
            return copy;
        }
    };
    static_assert(sizeof(ModelAnimationsAnimationGraphUnitSeatikPoint<NativeEndian>) == 0x40);

    ENDIAN_TEMPLATE(EndianType) struct ModelAnimationsAnimationWeaponClassAnimation {
        EndianType<Index> animation;
        ENDIAN_TEMPLATE(NewEndian) operator ModelAnimationsAnimationWeaponClassAnimation<NewEndian>() const {
            ModelAnimationsAnimationWeaponClassAnimation<NewEndian> copy;
            COPY_THIS(animation);
            return copy;
        }
    };
    static_assert(sizeof(ModelAnimationsAnimationWeaponClassAnimation<NativeEndian>) == 0x2);

    ENDIAN_TEMPLATE(EndianType) struct ModelAnimationsAnimationWeaponTypeAnimation {
        EndianType<Index> animation;
        ENDIAN_TEMPLATE(NewEndian) operator ModelAnimationsAnimationWeaponTypeAnimation<NewEndian>() const {
            ModelAnimationsAnimationWeaponTypeAnimation<NewEndian> copy;
            COPY_THIS(animation);
            return copy;
        }
    };
    static_assert(sizeof(ModelAnimationsAnimationWeaponTypeAnimation<NativeEndian>) == 0x2);

    ENDIAN_TEMPLATE(EndianType) struct ModelAnimationsAnimationGraphWeaponType {
        TagString label;
        PAD(0x10);
        TagReflexive<EndianType, ModelAnimationsAnimationWeaponTypeAnimation> animations;
        ENDIAN_TEMPLATE(NewEndian) operator ModelAnimationsAnimationGraphWeaponType<NewEndian>() const {
            ModelAnimationsAnimationGraphWeaponType<NewEndian> copy = {};
            COPY_THIS(label);
            COPY_THIS(animations);
            return copy;
        }
    };
    static_assert(sizeof(ModelAnimationsAnimationGraphWeaponType<NativeEndian>) == 0x3C);

    ENDIAN_TEMPLATE(EndianType) struct ModelAnimationsAnimationGraphWeapon {
        TagString name;
        TagString grip_marker;
        TagString hand_marker;
        EndianType<Angle> right_yaw_per_frame;
        EndianType<Angle> left_yaw_per_frame;
        EndianType<std::uint16_t> right_frame_count;
        EndianType<std::uint16_t> left_frame_count;
        EndianType<Angle> down_pitch_per_frame;
        EndianType<Angle> up_pitch_per_frame;
        EndianType<std::uint16_t> down_pitch_frame_count;
        EndianType<std::uint16_t> up_pitch_frame_count;
        PAD(0x20);
        TagReflexive<EndianType, ModelAnimationsAnimationWeaponClassAnimation> animations;
        TagReflexive<EndianType, ModelAnimationsAnimationGraphUnitSeatikPoint> ik_point;
        TagReflexive<EndianType, ModelAnimationsAnimationGraphWeaponType> weapon_types;
        ENDIAN_TEMPLATE(NewEndian) operator ModelAnimationsAnimationGraphWeapon<NewEndian>() const {
            ModelAnimationsAnimationGraphWeapon<NewEndian> copy = {};
            COPY_THIS(name);
            COPY_THIS(grip_marker);
            COPY_THIS(hand_marker);
            COPY_THIS(right_yaw_per_frame);
            COPY_THIS(left_yaw_per_frame);
            COPY_THIS(right_frame_count);
            COPY_THIS(left_frame_count);
            COPY_THIS(down_pitch_per_frame);
            COPY_THIS(up_pitch_per_frame);
            COPY_THIS(down_pitch_frame_count);
            COPY_THIS(up_pitch_frame_count);
            COPY_THIS(animations);
            COPY_THIS(ik_point);
            COPY_THIS(weapon_types);
            return copy;
        }
    };
    static_assert(sizeof(ModelAnimationsAnimationGraphWeapon<NativeEndian>) == 0xBC);

    ENDIAN_TEMPLATE(EndianType) struct ModelAnimationsAnimationGraphUnitSeat {
        TagString label;
        EndianType<Angle> right_yaw_per_frame;
        EndianType<Angle> left_yaw_per_frame;
        EndianType<std::uint16_t> right_frame_count;
        EndianType<std::uint16_t> left_frame_count;
        EndianType<Angle> down_pitch_per_frame;
        EndianType<Angle> up_pitch_per_frame;
        EndianType<std::uint16_t> down_pitch_frame_count;
        EndianType<std::uint16_t> up_pitch_frame_count;
        PAD(0x8);
        TagReflexive<EndianType, ModelAnimationsAnimationWeaponClassAnimation> animations;
        TagReflexive<EndianType, ModelAnimationsAnimationGraphUnitSeatikPoint> ik_points;
        TagReflexive<EndianType, ModelAnimationsAnimationGraphWeapon> weapons;
        ENDIAN_TEMPLATE(NewEndian) operator ModelAnimationsAnimationGraphUnitSeat<NewEndian>() const {
            ModelAnimationsAnimationGraphUnitSeat<NewEndian> copy = {};
            COPY_THIS(label);
            COPY_THIS(right_yaw_per_frame);
            COPY_THIS(left_yaw_per_frame);
            COPY_THIS(right_frame_count);
            COPY_THIS(left_frame_count);
            COPY_THIS(down_pitch_per_frame);
            COPY_THIS(up_pitch_per_frame);
            COPY_THIS(down_pitch_frame_count);
            COPY_THIS(up_pitch_frame_count);
            COPY_THIS(animations);
            COPY_THIS(ik_points);
            COPY_THIS(weapons);
            return copy;
        }
    };
    static_assert(sizeof(ModelAnimationsAnimationGraphUnitSeat<NativeEndian>) == 0x64);

    ENDIAN_TEMPLATE(EndianType) struct ModelAnimationsWeaponAnimation {
        EndianType<Index> animation;
        ENDIAN_TEMPLATE(NewEndian) operator ModelAnimationsWeaponAnimation<NewEndian>() const {
            ModelAnimationsWeaponAnimation<NewEndian> copy;
            COPY_THIS(animation);
            return copy;
        }
    };
    static_assert(sizeof(ModelAnimationsWeaponAnimation<NativeEndian>) == 0x2);

    ENDIAN_TEMPLATE(EndianType) struct ModelAnimationsAnimationGraphWeaponAnimations {
        PAD(0x10);
        TagReflexive<EndianType, ModelAnimationsWeaponAnimation> animations;
        ENDIAN_TEMPLATE(NewEndian) operator ModelAnimationsAnimationGraphWeaponAnimations<NewEndian>() const {
            ModelAnimationsAnimationGraphWeaponAnimations<NewEndian> copy = {};
            COPY_THIS(animations);
            return copy;
        }
    };
    static_assert(sizeof(ModelAnimationsAnimationGraphWeaponAnimations<NativeEndian>) == 0x1C);

    ENDIAN_TEMPLATE(EndianType) struct ModelAnimationsVehicleAnimation {
        EndianType<Index> animation;
        ENDIAN_TEMPLATE(NewEndian) operator ModelAnimationsVehicleAnimation<NewEndian>() const {
            ModelAnimationsVehicleAnimation<NewEndian> copy;
            COPY_THIS(animation);
            return copy;
        }
    };
    static_assert(sizeof(ModelAnimationsVehicleAnimation<NativeEndian>) == 0x2);

    ENDIAN_TEMPLATE(EndianType) struct ModelAnimationSuspensionAnimation {
        EndianType<Index> mass_point_index;
        EndianType<Index> animation;
        EndianType<float> full_extension_ground_depth;
        EndianType<float> full_compression_ground_depth;
        PAD(0x8);
        ENDIAN_TEMPLATE(NewEndian) operator ModelAnimationSuspensionAnimation<NewEndian>() const {
            ModelAnimationSuspensionAnimation<NewEndian> copy = {};
            COPY_THIS(mass_point_index);
            COPY_THIS(animation);
            COPY_THIS(full_extension_ground_depth);
            COPY_THIS(full_compression_ground_depth);
            return copy;
        }
    };
    static_assert(sizeof(ModelAnimationSuspensionAnimation<NativeEndian>) == 0x14);

    ENDIAN_TEMPLATE(EndianType) struct ModelAnimationsAnimationGraphVehicleAnimations {
        EndianType<Angle> right_yaw_per_frame;
        EndianType<Angle> left_yaw_per_frame;
        EndianType<std::uint16_t> right_frame_count;
        EndianType<std::uint16_t> left_frame_count;
        EndianType<Angle> down_pitch_per_frame;
        EndianType<Angle> up_pitch_per_frame;
        EndianType<std::uint16_t> down_pitch_frame_count;
        EndianType<std::uint16_t> up_pitch_frame_count;
        PAD(0x44);
        TagReflexive<EndianType, ModelAnimationsVehicleAnimation> animations;
        TagReflexive<EndianType, ModelAnimationSuspensionAnimation> suspension_animations;
        ENDIAN_TEMPLATE(NewEndian) operator ModelAnimationsAnimationGraphVehicleAnimations<NewEndian>() const {
            ModelAnimationsAnimationGraphVehicleAnimations<NewEndian> copy = {};
            COPY_THIS(right_yaw_per_frame);
            COPY_THIS(left_yaw_per_frame);
            COPY_THIS(right_frame_count);
            COPY_THIS(left_frame_count);
            COPY_THIS(down_pitch_per_frame);
            COPY_THIS(up_pitch_per_frame);
            COPY_THIS(down_pitch_frame_count);
            COPY_THIS(up_pitch_frame_count);
            COPY_THIS(animations);
            COPY_THIS(suspension_animations);
            return copy;
        }
    };
    static_assert(sizeof(ModelAnimationsAnimationGraphVehicleAnimations<NativeEndian>) == 0x74);

    ENDIAN_TEMPLATE(EndianType) struct ModelAnimationsDeviceAnimation {
        EndianType<Index> animation;
        ENDIAN_TEMPLATE(NewEndian) operator ModelAnimationsDeviceAnimation<NewEndian>() const {
            ModelAnimationsDeviceAnimation<NewEndian> copy;
            COPY_THIS(animation);
            return copy;
        }
    };
    static_assert(sizeof(ModelAnimationsDeviceAnimation<NativeEndian>) == 0x2);

    ENDIAN_TEMPLATE(EndianType) struct ModelAnimationsDeviceAnimations {
        PAD(0x54);
        TagReflexive<EndianType, ModelAnimationsDeviceAnimation> animations;
        ENDIAN_TEMPLATE(NewEndian) operator ModelAnimationsDeviceAnimations<NewEndian>() const {
            ModelAnimationsDeviceAnimations<NewEndian> copy = {};
            COPY_THIS(animations);
            return copy;
        }
    };
    static_assert(sizeof(ModelAnimationsDeviceAnimations<NativeEndian>) == 0x60);

    ENDIAN_TEMPLATE(EndianType) struct ModelAnimationsUnitDamageAnimations {
        EndianType<Index> animation;
        ENDIAN_TEMPLATE(NewEndian) operator ModelAnimationsUnitDamageAnimations<NewEndian>() const {
            ModelAnimationsUnitDamageAnimations<NewEndian> copy;
            COPY_THIS(animation);
            return copy;
        }
    };
    static_assert(sizeof(ModelAnimationsUnitDamageAnimations<NativeEndian>) == 0x2);

    ENDIAN_TEMPLATE(EndianType) struct ModelAnimationsFirstPersonWeapon {
        EndianType<Index> animation;
        ENDIAN_TEMPLATE(NewEndian) operator ModelAnimationsFirstPersonWeapon<NewEndian>() const {
            ModelAnimationsFirstPersonWeapon<NewEndian> copy;
            COPY_THIS(animation);
            return copy;
        }
    };
    static_assert(sizeof(ModelAnimationsFirstPersonWeapon<NativeEndian>) == 0x2);

    ENDIAN_TEMPLATE(EndianType) struct ModelAnimationsAnimationGraphFirstPersonWeaponAnimations {
        PAD(0x10);
        TagReflexive<EndianType, ModelAnimationsFirstPersonWeapon> animations;
        ENDIAN_TEMPLATE(NewEndian) operator ModelAnimationsAnimationGraphFirstPersonWeaponAnimations<NewEndian>() const {
            ModelAnimationsAnimationGraphFirstPersonWeaponAnimations<NewEndian> copy = {};
            COPY_THIS(animations);
            return copy;
        }
    };
    static_assert(sizeof(ModelAnimationsAnimationGraphFirstPersonWeaponAnimations<NativeEndian>) == 0x1C);

    ENDIAN_TEMPLATE(EndianType) struct ModelAnimationsAnimationGraphSoundReference {
        TagDependency<EndianType> sound;
        PAD(0x4);
        ENDIAN_TEMPLATE(NewEndian) operator ModelAnimationsAnimationGraphSoundReference<NewEndian>() const {
            ModelAnimationsAnimationGraphSoundReference<NewEndian> copy = {};
            COPY_THIS(sound);
            return copy;
        }
    };
    static_assert(sizeof(ModelAnimationsAnimationGraphSoundReference<NativeEndian>) == 0x14);

    ENDIAN_TEMPLATE(EndianType) struct ModelAnimationsAnimationGraphNode {
        TagString name;
        EndianType<Index> next_sibling_node_index;
        EndianType<Index> first_child_node_index;
        EndianType<Index> parent_node_index;
        PAD(0x2);
        EndianType<ModelAnimationsAnimationGraphNodeFlags> node_joint_flags;
        Vector3D<EndianType> base_vector;
        EndianType<float> vector_range;
        PAD(0x4);
        ENDIAN_TEMPLATE(NewEndian) operator ModelAnimationsAnimationGraphNode<NewEndian>() const {
            ModelAnimationsAnimationGraphNode<NewEndian> copy = {};
            COPY_THIS(name);
            COPY_THIS(next_sibling_node_index);
            COPY_THIS(first_child_node_index);
            COPY_THIS(parent_node_index);
            COPY_THIS(node_joint_flags);
            COPY_THIS(base_vector);
            COPY_THIS(vector_range);
            return copy;
        }
    };
    static_assert(sizeof(ModelAnimationsAnimationGraphNode<NativeEndian>) == 0x40);

    ENDIAN_TEMPLATE(EndianType) struct ModelAnimationsAnimation {
        TagString name;
        EndianType<AnimationType> type;
        EndianType<std::uint16_t> frame_count;
        EndianType<std::uint16_t> frame_size;
        EndianType<AnimationFrameInfoType> frame_info_type;
        EndianType<std::int32_t> node_list_checksum;
        EndianType<std::uint16_t> node_count;
        EndianType<Index> loop_frame_index;
        EndianType<Fraction> weight;
        EndianType<Index> key_frame_index;
        EndianType<Index> second_key_frame_index;
        EndianType<Index> next_animation;
        EndianType<ModelAnimationsAnimationFlags> flags;
        EndianType<Index> sound;
        EndianType<Index> sound_frame_index;
        std::int8_t left_foot_frame_index;
        std::int8_t right_foot_frame_index;
        LittleEndian<std::uint16_t> main_animation_index;
        LittleEndian<float> relative_weight;
        TagDataOffset<EndianType> frame_info;
        EndianType<std::uint32_t> node_transform_flag_data[2];
        PAD(0x8);
        EndianType<std::uint32_t> node_rotation_flag_data[2];
        PAD(0x8);
        EndianType<std::uint32_t> node_scale_flag_data[2];
        PAD(0x4);
        EndianType<std::uint32_t> offset_to_compressed_data;
        TagDataOffset<EndianType> default_data;
        TagDataOffset<EndianType> frame_data;
        ENDIAN_TEMPLATE(NewEndian) operator ModelAnimationsAnimation<NewEndian>() const {
            ModelAnimationsAnimation<NewEndian> copy = {};
            COPY_THIS(name);
            COPY_THIS(type);
            COPY_THIS(frame_count);
            COPY_THIS(frame_size);
            COPY_THIS(frame_info_type);
            COPY_THIS(node_list_checksum);
            COPY_THIS(node_count);
            COPY_THIS(loop_frame_index);
            COPY_THIS(weight);
            COPY_THIS(key_frame_index);
            COPY_THIS(second_key_frame_index);
            COPY_THIS(next_animation);
            COPY_THIS(flags);
            COPY_THIS(sound);
            COPY_THIS(sound_frame_index);
            COPY_THIS(left_foot_frame_index);
            COPY_THIS(right_foot_frame_index);
            COPY_THIS(main_animation_index);
            COPY_THIS(relative_weight);
            COPY_THIS(frame_info);
            COPY_THIS_ARRAY(node_transform_flag_data);
            COPY_THIS_ARRAY(node_rotation_flag_data);
            COPY_THIS_ARRAY(node_scale_flag_data);
            COPY_THIS(offset_to_compressed_data);
            COPY_THIS(default_data);
            COPY_THIS(frame_data);
            return copy;
        }
    };
    static_assert(sizeof(ModelAnimationsAnimation<NativeEndian>) == 0xB4);

    ENDIAN_TEMPLATE(EndianType) struct ModelAnimations {
        TagReflexive<EndianType, ModelAnimationsAnimationGraphObjectOverlay> objects;
        TagReflexive<EndianType, ModelAnimationsAnimationGraphUnitSeat> units;
        TagReflexive<EndianType, ModelAnimationsAnimationGraphWeaponAnimations> weapons;
        TagReflexive<EndianType, ModelAnimationsAnimationGraphVehicleAnimations> vehicles;
        TagReflexive<EndianType, ModelAnimationsDeviceAnimations> devices;
        TagReflexive<EndianType, ModelAnimationsUnitDamageAnimations> unit_damage;
        TagReflexive<EndianType, ModelAnimationsAnimationGraphFirstPersonWeaponAnimations> first_person_weapons;
        TagReflexive<EndianType, ModelAnimationsAnimationGraphSoundReference> sound_references;
        EndianType<float> limp_body_node_radius;
        EndianType<ModelAnimationsFlags> flags;
        PAD(0x2);
        TagReflexive<EndianType, ModelAnimationsAnimationGraphNode> nodes;
        TagReflexive<EndianType, ModelAnimationsAnimation> animations;
        ENDIAN_TEMPLATE(NewEndian) operator ModelAnimations<NewEndian>() const {
            ModelAnimations<NewEndian> copy = {};
            COPY_THIS(objects);
            COPY_THIS(units);
            COPY_THIS(weapons);
            COPY_THIS(vehicles);
            COPY_THIS(devices);
            COPY_THIS(unit_damage);
            COPY_THIS(first_person_weapons);
            COPY_THIS(sound_references);
            COPY_THIS(limp_body_node_radius);
            COPY_THIS(flags);
            COPY_THIS(nodes);
            COPY_THIS(animations);
            return copy;
        }
    };
    static_assert(sizeof(ModelAnimations<NativeEndian>) == 0x80);

    ENDIAN_TEMPLATE(EndianType) struct ModelCollisionGeometryMaterial {
        TagString name;
        EndianType<ModelCollisionGeometryMaterialFlags> flags;
        EndianType<MaterialType> material_type;
        PAD(0x2);
        EndianType<Fraction> shield_leak_percentage;
        EndianType<float> shield_damage_multiplier;
        PAD(0xC);
        EndianType<float> body_damage_multiplier;
        PAD(0x8);
        ENDIAN_TEMPLATE(NewEndian) operator ModelCollisionGeometryMaterial<NewEndian>() const {
            ModelCollisionGeometryMaterial<NewEndian> copy = {};
            COPY_THIS(name);
            COPY_THIS(flags);
            COPY_THIS(material_type);
            COPY_THIS(shield_leak_percentage);
            COPY_THIS(shield_damage_multiplier);
            COPY_THIS(body_damage_multiplier);
            return copy;
        }
    };
    static_assert(sizeof(ModelCollisionGeometryMaterial<NativeEndian>) == 0x48);

    ENDIAN_TEMPLATE(EndianType) struct ModelCollisionGeometryPermutation {
        TagString name;
        ENDIAN_TEMPLATE(NewEndian) operator ModelCollisionGeometryPermutation<NewEndian>() const {
            ModelCollisionGeometryPermutation<NewEndian> copy;
            COPY_THIS(name);
            return copy;
        }
    };
    static_assert(sizeof(ModelCollisionGeometryPermutation<NativeEndian>) == 0x20);

    ENDIAN_TEMPLATE(EndianType) struct ModelCollisionGeometryRegion {
        TagString name;
        EndianType<ModelCollisionGeometryRegionFlags> flags;
        PAD(0x4);
        EndianType<float> damage_threshold;
        PAD(0xC);
        TagDependency<EndianType> destroyed_effect;
        TagReflexive<EndianType, ModelCollisionGeometryPermutation> permutations;
        ENDIAN_TEMPLATE(NewEndian) operator ModelCollisionGeometryRegion<NewEndian>() const {
            ModelCollisionGeometryRegion<NewEndian> copy = {};
            COPY_THIS(name);
            COPY_THIS(flags);
            COPY_THIS(damage_threshold);
            COPY_THIS(destroyed_effect);
            COPY_THIS(permutations);
            return copy;
        }
    };
    static_assert(sizeof(ModelCollisionGeometryRegion<NativeEndian>) == 0x54);

    ENDIAN_TEMPLATE(EndianType) struct ModelCollisionGeometryModifier {
        PAD(0x34);
        ENDIAN_TEMPLATE(NewEndian) operator ModelCollisionGeometryModifier<NewEndian>() const {
            ModelCollisionGeometryModifier<NewEndian> copy = {};
            return copy;
        }
    };
    static_assert(sizeof(ModelCollisionGeometryModifier<NativeEndian>) == 0x34);

    ENDIAN_TEMPLATE(EndianType) struct ModelCollisionGeometrySphere {
        EndianType<Index> node;
        PAD(0x2);
        PAD(0xC);
        Point3D<EndianType> center;
        EndianType<float> radius;
        ENDIAN_TEMPLATE(NewEndian) operator ModelCollisionGeometrySphere<NewEndian>() const {
            ModelCollisionGeometrySphere<NewEndian> copy = {};
            COPY_THIS(node);
            COPY_THIS(center);
            COPY_THIS(radius);
            return copy;
        }
    };
    static_assert(sizeof(ModelCollisionGeometrySphere<NativeEndian>) == 0x20);

    ENDIAN_TEMPLATE(EndianType) struct ModelCollisionGeometryBSP3DNode {
        EndianType<std::uint32_t> plane;
        EndianType<FlaggedInt<std::uint32_t>> back_child;
        EndianType<FlaggedInt<std::uint32_t>> front_child;
        ENDIAN_TEMPLATE(NewEndian) operator ModelCollisionGeometryBSP3DNode<NewEndian>() const {
            ModelCollisionGeometryBSP3DNode<NewEndian> copy;
            COPY_THIS(plane);
            COPY_THIS(back_child);
            COPY_THIS(front_child);
            return copy;
        }
    };
    static_assert(sizeof(ModelCollisionGeometryBSP3DNode<NativeEndian>) == 0xC);

    ENDIAN_TEMPLATE(EndianType) struct ModelCollisionGeometryBSPPlane {
        Plane3D<EndianType> plane;
        ENDIAN_TEMPLATE(NewEndian) operator ModelCollisionGeometryBSPPlane<NewEndian>() const {
            ModelCollisionGeometryBSPPlane<NewEndian> copy;
            COPY_THIS(plane);
            return copy;
        }
    };
    static_assert(sizeof(ModelCollisionGeometryBSPPlane<NativeEndian>) == 0x10);

    ENDIAN_TEMPLATE(EndianType) struct ModelCollisionGeometryBSPLeaf {
        EndianType<ModelCollisionGeometryBSPLeafFlags> flags;
        EndianType<std::uint16_t> bsp2d_reference_count;
        EndianType<std::uint32_t> first_bsp2d_reference;
        ENDIAN_TEMPLATE(NewEndian) operator ModelCollisionGeometryBSPLeaf<NewEndian>() const {
            ModelCollisionGeometryBSPLeaf<NewEndian> copy;
            COPY_THIS(flags);
            COPY_THIS(bsp2d_reference_count);
            COPY_THIS(first_bsp2d_reference);
            return copy;
        }
    };
    static_assert(sizeof(ModelCollisionGeometryBSPLeaf<NativeEndian>) == 0x8);

    ENDIAN_TEMPLATE(EndianType) struct ModelCollisionGeometryBSP2DReference {
        EndianType<FlaggedInt<std::uint32_t>> plane;
        EndianType<FlaggedInt<std::uint32_t>> bsp2d_node;
        ENDIAN_TEMPLATE(NewEndian) operator ModelCollisionGeometryBSP2DReference<NewEndian>() const {
            ModelCollisionGeometryBSP2DReference<NewEndian> copy;
            COPY_THIS(plane);
            COPY_THIS(bsp2d_node);
            return copy;
        }
    };
    static_assert(sizeof(ModelCollisionGeometryBSP2DReference<NativeEndian>) == 0x8);

    ENDIAN_TEMPLATE(EndianType) struct ModelCollisionGeometryBSP2DNode {
        Plane2D<EndianType> plane;
        EndianType<FlaggedInt<std::uint32_t>> left_child;
        EndianType<FlaggedInt<std::uint32_t>> right_child;
        ENDIAN_TEMPLATE(NewEndian) operator ModelCollisionGeometryBSP2DNode<NewEndian>() const {
            ModelCollisionGeometryBSP2DNode<NewEndian> copy;
            COPY_THIS(plane);
            COPY_THIS(left_child);
            COPY_THIS(right_child);
            return copy;
        }
    };
    static_assert(sizeof(ModelCollisionGeometryBSP2DNode<NativeEndian>) == 0x14);

    ENDIAN_TEMPLATE(EndianType) struct ModelCollisionGeometryBSPSurface {
        EndianType<FlaggedInt<std::uint32_t>> plane;
        EndianType<std::uint32_t> first_edge;
        ModelCollisionGeometryBSPSurfaceFlags flags;
        std::int8_t breakable_surface;
        EndianType<Index> material;
        ENDIAN_TEMPLATE(NewEndian) operator ModelCollisionGeometryBSPSurface<NewEndian>() const {
            ModelCollisionGeometryBSPSurface<NewEndian> copy;
            COPY_THIS(plane);
            COPY_THIS(first_edge);
            COPY_THIS(flags);
            COPY_THIS(breakable_surface);
            COPY_THIS(material);
            return copy;
        }
    };
    static_assert(sizeof(ModelCollisionGeometryBSPSurface<NativeEndian>) == 0xC);

    ENDIAN_TEMPLATE(EndianType) struct ModelCollisionGeometryBSPEdge {
        EndianType<std::uint32_t> start_vertex;
        EndianType<std::uint32_t> end_vertex;
        EndianType<std::uint32_t> forward_edge;
        EndianType<std::uint32_t> reverse_edge;
        EndianType<std::uint32_t> left_surface;
        EndianType<std::uint32_t> right_surface;
        ENDIAN_TEMPLATE(NewEndian) operator ModelCollisionGeometryBSPEdge<NewEndian>() const {
            ModelCollisionGeometryBSPEdge<NewEndian> copy;
            COPY_THIS(start_vertex);
            COPY_THIS(end_vertex);
            COPY_THIS(forward_edge);
            COPY_THIS(reverse_edge);
            COPY_THIS(left_surface);
            COPY_THIS(right_surface);
            return copy;
        }
    };
    static_assert(sizeof(ModelCollisionGeometryBSPEdge<NativeEndian>) == 0x18);

    ENDIAN_TEMPLATE(EndianType) struct ModelCollisionGeometryBSPVertex {
        Point3D<EndianType> point;
        EndianType<std::uint32_t> first_edge;
        ENDIAN_TEMPLATE(NewEndian) operator ModelCollisionGeometryBSPVertex<NewEndian>() const {
            ModelCollisionGeometryBSPVertex<NewEndian> copy;
            COPY_THIS(point);
            COPY_THIS(first_edge);
            return copy;
        }
    };
    static_assert(sizeof(ModelCollisionGeometryBSPVertex<NativeEndian>) == 0x10);

    ENDIAN_TEMPLATE(EndianType) struct ModelCollisionGeometryBSP {
        TagReflexive<EndianType, ModelCollisionGeometryBSP3DNode> bsp3d_nodes;
        TagReflexive<EndianType, ModelCollisionGeometryBSPPlane> planes;
        TagReflexive<EndianType, ModelCollisionGeometryBSPLeaf> leaves;
        TagReflexive<EndianType, ModelCollisionGeometryBSP2DReference> bsp2d_references;
        TagReflexive<EndianType, ModelCollisionGeometryBSP2DNode> bsp2d_nodes;
        TagReflexive<EndianType, ModelCollisionGeometryBSPSurface> surfaces;
        TagReflexive<EndianType, ModelCollisionGeometryBSPEdge> edges;
        TagReflexive<EndianType, ModelCollisionGeometryBSPVertex> vertices;
        ENDIAN_TEMPLATE(NewEndian) operator ModelCollisionGeometryBSP<NewEndian>() const {
            ModelCollisionGeometryBSP<NewEndian> copy;
            COPY_THIS(bsp3d_nodes);
            COPY_THIS(planes);
            COPY_THIS(leaves);
            COPY_THIS(bsp2d_references);
            COPY_THIS(bsp2d_nodes);
            COPY_THIS(surfaces);
            COPY_THIS(edges);
            COPY_THIS(vertices);
            return copy;
        }
    };
    static_assert(sizeof(ModelCollisionGeometryBSP<NativeEndian>) == 0x60);

    ENDIAN_TEMPLATE(EndianType) struct ModelCollisionGeometryNode {
        TagString name;
        EndianType<Index> region;
        EndianType<Index> parent_node;
        EndianType<Index> next_sibling_node;
        EndianType<Index> first_child_node;
        PAD(0xA);
        EndianType<std::int16_t> name_thing;
        TagReflexive<EndianType, ModelCollisionGeometryBSP> bsps;
        ENDIAN_TEMPLATE(NewEndian) operator ModelCollisionGeometryNode<NewEndian>() const {
            ModelCollisionGeometryNode<NewEndian> copy = {};
            COPY_THIS(name);
            COPY_THIS(region);
            COPY_THIS(parent_node);
            COPY_THIS(next_sibling_node);
            COPY_THIS(first_child_node);
            COPY_THIS(name_thing);
            COPY_THIS(bsps);
            return copy;
        }
    };
    static_assert(sizeof(ModelCollisionGeometryNode<NativeEndian>) == 0x40);

    ENDIAN_TEMPLATE(EndianType) struct ModelCollisionGeometry {
        EndianType<ModelCollisionGeometryFlags> flags;
        EndianType<Index> indirect_damage_material;
        PAD(0x2);
        EndianType<float> maximum_body_vitality;
        EndianType<float> body_system_shock;
        PAD(0x18);
        PAD(0x1C);
        EndianType<Fraction> friendly_damage_resistance;
        PAD(0x8);
        PAD(0x20);
        TagDependency<EndianType> localized_damage_effect;
        EndianType<float> area_damage_effect_threshold;
        TagDependency<EndianType> area_damage_effect;
        EndianType<float> body_damaged_threshold;
        TagDependency<EndianType> body_damaged_effect;
        TagDependency<EndianType> body_depleted_effect;
        EndianType<float> body_destroyed_threshold;
        TagDependency<EndianType> body_destroyed_effect;
        EndianType<float> maximum_shield_vitality;
        PAD(0x2);
        EndianType<MaterialType> shield_material_type;
        PAD(0x18);
        EndianType<FunctionType> shield_failure_function;
        PAD(0x2);
        EndianType<Fraction> shield_failure_threshold;
        EndianType<Fraction> failing_shield_leak_fraction;
        PAD(0x10);
        EndianType<float> minimum_stun_damage;
        EndianType<float> stun_time;
        EndianType<float> recharge_time;
        PAD(0x10);
        PAD(0x60);
        EndianType<float> shield_damaged_threshold;
        TagDependency<EndianType> shield_damaged_effect;
        TagDependency<EndianType> shield_depleted_effect;
        TagDependency<EndianType> shield_recharging_effect;
        PAD(0x8);
        LittleEndian<float> shield_recharge_rate;
        PAD(0x70);
        TagReflexive<EndianType, ModelCollisionGeometryMaterial> materials;
        TagReflexive<EndianType, ModelCollisionGeometryRegion> regions;
        TagReflexive<EndianType, ModelCollisionGeometryModifier> modifiers;
        PAD(0x10);
        Bounds<EndianType<float>> x;
        Bounds<EndianType<float>> y;
        Bounds<EndianType<float>> z;
        TagReflexive<EndianType, ModelCollisionGeometrySphere> pathfinding_spheres;
        TagReflexive<EndianType, ModelCollisionGeometryNode> nodes;
        ENDIAN_TEMPLATE(NewEndian) operator ModelCollisionGeometry<NewEndian>() const {
            ModelCollisionGeometry<NewEndian> copy = {};
            COPY_THIS(flags);
            COPY_THIS(indirect_damage_material);
            COPY_THIS(maximum_body_vitality);
            COPY_THIS(body_system_shock);
            COPY_THIS(friendly_damage_resistance);
            COPY_THIS(localized_damage_effect);
            COPY_THIS(area_damage_effect_threshold);
            COPY_THIS(area_damage_effect);
            COPY_THIS(body_damaged_threshold);
            COPY_THIS(body_damaged_effect);
            COPY_THIS(body_depleted_effect);
            COPY_THIS(body_destroyed_threshold);
            COPY_THIS(body_destroyed_effect);
            COPY_THIS(maximum_shield_vitality);
            COPY_THIS(shield_material_type);
            COPY_THIS(shield_failure_function);
            COPY_THIS(shield_failure_threshold);
            COPY_THIS(failing_shield_leak_fraction);
            COPY_THIS(minimum_stun_damage);
            COPY_THIS(stun_time);
            COPY_THIS(recharge_time);
            COPY_THIS(shield_damaged_threshold);
            COPY_THIS(shield_damaged_effect);
            COPY_THIS(shield_depleted_effect);
            COPY_THIS(shield_recharging_effect);
            COPY_THIS(shield_recharge_rate);
            COPY_THIS(materials);
            COPY_THIS(regions);
            COPY_THIS(modifiers);
            COPY_THIS(x);
            COPY_THIS(y);
            COPY_THIS(z);
            COPY_THIS(pathfinding_spheres);
            COPY_THIS(nodes);
            return copy;
        }
    };
    static_assert(sizeof(ModelCollisionGeometry<NativeEndian>) == 0x298);

    ENDIAN_TEMPLATE(EndianType) struct MultiplayerScenarioDescriptionScenarioDescription {
        TagDependency<EndianType> descriptive_bitmap;
        TagDependency<EndianType> displayed_map_name;
        TagString scenario_tag_directory_path;
        PAD(0x4);
        ENDIAN_TEMPLATE(NewEndian) operator MultiplayerScenarioDescriptionScenarioDescription<NewEndian>() const {
            MultiplayerScenarioDescriptionScenarioDescription<NewEndian> copy = {};
            COPY_THIS(descriptive_bitmap);
            COPY_THIS(displayed_map_name);
            COPY_THIS(scenario_tag_directory_path);
            return copy;
        }
    };
    static_assert(sizeof(MultiplayerScenarioDescriptionScenarioDescription<NativeEndian>) == 0x44);

    ENDIAN_TEMPLATE(EndianType) struct MultiplayerScenarioDescription {
        TagReflexive<EndianType, MultiplayerScenarioDescriptionScenarioDescription> multiplayer_scenarios;
        ENDIAN_TEMPLATE(NewEndian) operator MultiplayerScenarioDescription<NewEndian>() const {
            MultiplayerScenarioDescription<NewEndian> copy;
            COPY_THIS(multiplayer_scenarios);
            return copy;
        }
    };
    static_assert(sizeof(MultiplayerScenarioDescription<NativeEndian>) == 0xC);

    ENDIAN_TEMPLATE(EndianType) struct BasicObject : Object<EndianType> {
        PAD(0x2);
        EndianType<BaseObjectFlags> more_flags;
        PAD(0x7C);
        ENDIAN_TEMPLATE(NewEndian) operator BasicObject<NewEndian>() const {
            BasicObject<NewEndian> copy = {};
            COPY_THIS(more_flags);
            COPY_THIS(object_type);
            COPY_THIS(flags);
            COPY_THIS(bounding_radius);
            COPY_THIS(bounding_offset);
            COPY_THIS(origin_offset);
            COPY_THIS(acceleration_scale);
            COPY_THIS(scales_change_colors);
            COPY_THIS(model);
            COPY_THIS(animation_graph);
            COPY_THIS(collision_model);
            COPY_THIS(physics);
            COPY_THIS(modifier_shader);
            COPY_THIS(creation_effect);
            COPY_THIS(render_bounding_radius);
            COPY_THIS(a_in);
            COPY_THIS(b_in);
            COPY_THIS(c_in);
            COPY_THIS(d_in);
            COPY_THIS(hud_text_message_index);
            COPY_THIS(forced_shader_permutation_index);
            COPY_THIS(attachments);
            COPY_THIS(widgets);
            COPY_THIS(functions);
            COPY_THIS(change_colors);
            COPY_THIS(predicted_resources);
            return copy;
        }
    };
    static_assert(sizeof(BasicObject<NativeEndian>) == 0x1FC);

    ENDIAN_TEMPLATE(EndianType) struct Particle {
        EndianType<ParticleFlags> flags;
        TagDependency<EndianType> bitmap;
        TagDependency<EndianType> physics;
        TagDependency<EndianType> sir_marty_exchanged_his_children_for_thine;
        PAD(0x4);
        Bounds<EndianType<float>> lifespan;
        EndianType<float> fade_in_time;
        EndianType<float> fade_out_time;
        TagDependency<EndianType> collision_effect;
        TagDependency<EndianType> death_effect;
        EndianType<float> minimum_size;
        PAD(0x8);
        Bounds<EndianType<float>> radius_animation;
        PAD(0x4);
        Bounds<EndianType<float>> animation_rate;
        EndianType<float> contact_deterioration;
        EndianType<float> fade_start_size;
        EndianType<float> fade_end_size;
        PAD(0x4);
        EndianType<Index> first_sequence_index;
        EndianType<std::int16_t> initial_sequence_count;
        EndianType<std::int16_t> looping_sequence_count;
        EndianType<std::int16_t> final_sequence_count;
        PAD(0x8);
        LittleEndian<float> sprite_size;
        EndianType<ParticleOrientation> orientation;
        PAD(0x2);
        PAD(0x24);
        LittleEndian<std::uint32_t> make_it_actually_work;
        EndianType<ParticleShaderFlags> shader_flags;
        EndianType<FramebufferBlendFunction> framebuffer_blend_function;
        EndianType<FramebufferFadeMode> framebuffer_fade_mode;
        EndianType<IsUnfilteredFlag> map_flags;
        PAD(0x1C);
        TagDependency<EndianType> secondary_bitmap;
        EndianType<ParticleAnchor> anchor;
        EndianType<IsUnfilteredFlag> secondary_map_flags;
        EndianType<FunctionOut> u_animation_source;
        EndianType<WaveFunction> u_animation_function;
        EndianType<float> u_animation_period;
        EndianType<float> u_animation_phase;
        EndianType<float> u_animation_scale;
        EndianType<FunctionOut> v_animation_source;
        EndianType<WaveFunction> v_animation_function;
        EndianType<float> v_animation_period;
        EndianType<float> v_animation_phase;
        EndianType<float> v_animation_scale;
        EndianType<FunctionOut> rotation_animation_source;
        EndianType<WaveFunction> rotation_animation_function;
        EndianType<float> rotation_animation_period;
        EndianType<float> rotation_animation_phase;
        EndianType<float> rotation_animation_scale;
        Point2D<EndianType> rotation_animation_center;
        PAD(0x4);
        EndianType<float> zsprite_radius_scale;
        PAD(0x14);
        ENDIAN_TEMPLATE(NewEndian) operator Particle<NewEndian>() const {
            Particle<NewEndian> copy = {};
            COPY_THIS(flags);
            COPY_THIS(bitmap);
            COPY_THIS(physics);
            COPY_THIS(sir_marty_exchanged_his_children_for_thine);
            COPY_THIS(lifespan);
            COPY_THIS(fade_in_time);
            COPY_THIS(fade_out_time);
            COPY_THIS(collision_effect);
            COPY_THIS(death_effect);
            COPY_THIS(minimum_size);
            COPY_THIS(radius_animation);
            COPY_THIS(animation_rate);
            COPY_THIS(contact_deterioration);
            COPY_THIS(fade_start_size);
            COPY_THIS(fade_end_size);
            COPY_THIS(first_sequence_index);
            COPY_THIS(initial_sequence_count);
            COPY_THIS(looping_sequence_count);
            COPY_THIS(final_sequence_count);
            COPY_THIS(sprite_size);
            COPY_THIS(orientation);
            COPY_THIS(make_it_actually_work);
            COPY_THIS(shader_flags);
            COPY_THIS(framebuffer_blend_function);
            COPY_THIS(framebuffer_fade_mode);
            COPY_THIS(map_flags);
            COPY_THIS(secondary_bitmap);
            COPY_THIS(anchor);
            COPY_THIS(secondary_map_flags);
            COPY_THIS(u_animation_source);
            COPY_THIS(u_animation_function);
            COPY_THIS(u_animation_period);
            COPY_THIS(u_animation_phase);
            COPY_THIS(u_animation_scale);
            COPY_THIS(v_animation_source);
            COPY_THIS(v_animation_function);
            COPY_THIS(v_animation_period);
            COPY_THIS(v_animation_phase);
            COPY_THIS(v_animation_scale);
            COPY_THIS(rotation_animation_source);
            COPY_THIS(rotation_animation_function);
            COPY_THIS(rotation_animation_period);
            COPY_THIS(rotation_animation_phase);
            COPY_THIS(rotation_animation_scale);
            COPY_THIS(rotation_animation_center);
            COPY_THIS(zsprite_radius_scale);
            return copy;
        }
    };
    static_assert(sizeof(Particle<NativeEndian>) == 0x164);

    ENDIAN_TEMPLATE(EndianType) struct ParticleSystemPhysicsConstant {
        EndianType<float> k;
        ENDIAN_TEMPLATE(NewEndian) operator ParticleSystemPhysicsConstant<NewEndian>() const {
            ParticleSystemPhysicsConstant<NewEndian> copy;
            COPY_THIS(k);
            return copy;
        }
    };
    static_assert(sizeof(ParticleSystemPhysicsConstant<NativeEndian>) == 0x4);

    ENDIAN_TEMPLATE(EndianType) struct ParticleSystemTypeStates {
        TagString name;
        Bounds<EndianType<float>> duration_bounds;
        Bounds<EndianType<float>> transition_time_bounds;
        PAD(0x4);
        EndianType<float> scale_multiplier;
        EndianType<float> animation_rate_multiplier;
        EndianType<float> rotation_rate_multiplier;
        ColorARGB<EndianType> color_multiplier;
        EndianType<float> radius_multiplier;
        EndianType<float> minimum_particle_count;
        EndianType<float> particle_creation_rate;
        PAD(0x54);
        EndianType<ParticleSystemParticleCreationPhysics> particle_creation_physics;
        EndianType<ParticleSystemParticleUpdatePhysics> particle_update_physics;
        TagReflexive<EndianType, ParticleSystemPhysicsConstant> physics_constants;
        ENDIAN_TEMPLATE(NewEndian) operator ParticleSystemTypeStates<NewEndian>() const {
            ParticleSystemTypeStates<NewEndian> copy = {};
            COPY_THIS(name);
            COPY_THIS(duration_bounds);
            COPY_THIS(transition_time_bounds);
            COPY_THIS(scale_multiplier);
            COPY_THIS(animation_rate_multiplier);
            COPY_THIS(rotation_rate_multiplier);
            COPY_THIS(color_multiplier);
            COPY_THIS(radius_multiplier);
            COPY_THIS(minimum_particle_count);
            COPY_THIS(particle_creation_rate);
            COPY_THIS(particle_creation_physics);
            COPY_THIS(particle_update_physics);
            COPY_THIS(physics_constants);
            return copy;
        }
    };
    static_assert(sizeof(ParticleSystemTypeStates<NativeEndian>) == 0xC0);

    ENDIAN_TEMPLATE(EndianType) struct ParticleSystemTypeParticleState {
        TagString name;
        Bounds<EndianType<float>> duration_bounds;
        Bounds<EndianType<float>> transition_time_bounds;
        TagDependency<EndianType> bitmaps;
        EndianType<Index> sequence_index;
        PAD(0x2);
        PAD(0x4);
        Bounds<EndianType<float>> scale;
        Bounds<EndianType<float>> animation_rate;
        Bounds<EndianType<Angle>> rotation_rate;
        ColorARGB<EndianType> color_1;
        ColorARGB<EndianType> color_2;
        EndianType<float> radius_multiplier;
        TagDependency<EndianType> point_physics;
        PAD(0x24);
        PAD(0x24);
        LittleEndian<std::uint32_t> unknown_int;
        EndianType<ParticleShaderFlags> shader_flags;
        EndianType<FramebufferBlendFunction> framebuffer_blend_function;
        EndianType<FramebufferFadeMode> framebuffer_fade_mode;
        EndianType<IsUnfilteredFlag> map_flags;
        PAD(0x1C);
        TagDependency<EndianType> secondary_map_bitmap;
        EndianType<ParticleAnchor> anchor;
        EndianType<IsUnfilteredFlag> flags;
        EndianType<FunctionOut> u_animation_source;
        EndianType<WaveFunction> u_animation_function;
        EndianType<float> u_animation_period;
        EndianType<float> u_animation_phase;
        EndianType<float> u_animation_scale;
        EndianType<FunctionOut> v_animation_source;
        EndianType<WaveFunction> v_animation_function;
        EndianType<float> v_animation_period;
        EndianType<float> v_animation_phase;
        EndianType<float> v_animation_scale;
        EndianType<FunctionOut> rotation_animation_source;
        EndianType<WaveFunction> rotation_animation_function;
        EndianType<float> rotation_animation_period;
        EndianType<float> rotation_animation_phase;
        EndianType<float> rotation_animation_scale;
        Point2D<EndianType> rotation_animation_center;
        PAD(0x4);
        EndianType<float> zsprite_radius_scale;
        PAD(0x14);
        TagReflexive<EndianType, ParticleSystemPhysicsConstant> physics_constants;
        ENDIAN_TEMPLATE(NewEndian) operator ParticleSystemTypeParticleState<NewEndian>() const {
            ParticleSystemTypeParticleState<NewEndian> copy = {};
            COPY_THIS(name);
            COPY_THIS(duration_bounds);
            COPY_THIS(transition_time_bounds);
            COPY_THIS(bitmaps);
            COPY_THIS(sequence_index);
            COPY_THIS(scale);
            COPY_THIS(animation_rate);
            COPY_THIS(rotation_rate);
            COPY_THIS(color_1);
            COPY_THIS(color_2);
            COPY_THIS(radius_multiplier);
            COPY_THIS(point_physics);
            COPY_THIS(unknown_int);
            COPY_THIS(shader_flags);
            COPY_THIS(framebuffer_blend_function);
            COPY_THIS(framebuffer_fade_mode);
            COPY_THIS(map_flags);
            COPY_THIS(secondary_map_bitmap);
            COPY_THIS(anchor);
            COPY_THIS(flags);
            COPY_THIS(u_animation_source);
            COPY_THIS(u_animation_function);
            COPY_THIS(u_animation_period);
            COPY_THIS(u_animation_phase);
            COPY_THIS(u_animation_scale);
            COPY_THIS(v_animation_source);
            COPY_THIS(v_animation_function);
            COPY_THIS(v_animation_period);
            COPY_THIS(v_animation_phase);
            COPY_THIS(v_animation_scale);
            COPY_THIS(rotation_animation_source);
            COPY_THIS(rotation_animation_function);
            COPY_THIS(rotation_animation_period);
            COPY_THIS(rotation_animation_phase);
            COPY_THIS(rotation_animation_scale);
            COPY_THIS(rotation_animation_center);
            COPY_THIS(zsprite_radius_scale);
            COPY_THIS(physics_constants);
            return copy;
        }
    };
    static_assert(sizeof(ParticleSystemTypeParticleState<NativeEndian>) == 0x178);

    ENDIAN_TEMPLATE(EndianType) struct ParticleSystemType {
        TagString name;
        EndianType<ParticleSystemTypeFlags> flags;
        EndianType<std::uint16_t> initial_particle_count;
        PAD(0x2);
        EndianType<ParticleSystemComplexSpriteRenderMode> complex_sprite_render_mode;
        PAD(0x2);
        EndianType<float> radius;
        PAD(0x24);
        EndianType<ParticleSystemParticleCreationPhysics> particle_creation_physics;
        PAD(0x2);
        EndianType<IsUnusedFlag> physics_flags;
        TagReflexive<EndianType, ParticleSystemPhysicsConstant> physics_constants;
        TagReflexive<EndianType, ParticleSystemTypeStates> states;
        TagReflexive<EndianType, ParticleSystemTypeParticleState> particle_states;
        ENDIAN_TEMPLATE(NewEndian) operator ParticleSystemType<NewEndian>() const {
            ParticleSystemType<NewEndian> copy = {};
            COPY_THIS(name);
            COPY_THIS(flags);
            COPY_THIS(initial_particle_count);
            COPY_THIS(complex_sprite_render_mode);
            COPY_THIS(radius);
            COPY_THIS(particle_creation_physics);
            COPY_THIS(physics_flags);
            COPY_THIS(physics_constants);
            COPY_THIS(states);
            COPY_THIS(particle_states);
            return copy;
        }
    };
    static_assert(sizeof(ParticleSystemType<NativeEndian>) == 0x80);

    ENDIAN_TEMPLATE(EndianType) struct ParticleSystem {
        PAD(0x4);
        PAD(0x34);
        TagDependency<EndianType> point_physics;
        EndianType<ParticleSystemSystemUpdatePhysics> system_update_physics;
        PAD(0x2);
        EndianType<IsUnusedFlag> physics_flags;
        TagReflexive<EndianType, ParticleSystemPhysicsConstant> physics_constants;
        TagReflexive<EndianType, ParticleSystemType> particle_types;
        ENDIAN_TEMPLATE(NewEndian) operator ParticleSystem<NewEndian>() const {
            ParticleSystem<NewEndian> copy = {};
            COPY_THIS(point_physics);
            COPY_THIS(system_update_physics);
            COPY_THIS(physics_flags);
            COPY_THIS(physics_constants);
            COPY_THIS(particle_types);
            return copy;
        }
    };
    static_assert(sizeof(ParticleSystem<NativeEndian>) == 0x68);

    ENDIAN_TEMPLATE(EndianType) struct PhysicsInertialMatrix {
        Matrix<EndianType> matrix;
        ENDIAN_TEMPLATE(NewEndian) operator PhysicsInertialMatrix<NewEndian>() const {
            PhysicsInertialMatrix<NewEndian> copy;
            COPY_THIS(matrix);
            return copy;
        }
    };
    static_assert(sizeof(PhysicsInertialMatrix<NativeEndian>) == 0x24);

    ENDIAN_TEMPLATE(EndianType) struct PhysicsPoweredMassPoint {
        TagString name;
        EndianType<PhysicsPoweredMassPointFlags> flags;
        EndianType<float> antigrav_strength;
        EndianType<float> antigrav_offset;
        EndianType<float> antigrav_height;
        EndianType<float> antigrav_damp_fraction;
        EndianType<float> antigrav_normal_k1;
        EndianType<float> antigrav_normal_k0;
        PAD(0x44);
        ENDIAN_TEMPLATE(NewEndian) operator PhysicsPoweredMassPoint<NewEndian>() const {
            PhysicsPoweredMassPoint<NewEndian> copy = {};
            COPY_THIS(name);
            COPY_THIS(flags);
            COPY_THIS(antigrav_strength);
            COPY_THIS(antigrav_offset);
            COPY_THIS(antigrav_height);
            COPY_THIS(antigrav_damp_fraction);
            COPY_THIS(antigrav_normal_k1);
            COPY_THIS(antigrav_normal_k0);
            return copy;
        }
    };
    static_assert(sizeof(PhysicsPoweredMassPoint<NativeEndian>) == 0x80);

    ENDIAN_TEMPLATE(EndianType) struct PhysicsMassPoint {
        TagString name;
        EndianType<std::int16_t> powered_mass_point;
        EndianType<std::int16_t> model_node;
        EndianType<PhysicsMassPointFlags> flags;
        EndianType<float> relative_mass;
        EndianType<float> mass;
        EndianType<float> relative_density;
        EndianType<float> density;
        Point3D<EndianType> position;
        Vector3D<EndianType> forward;
        Vector3D<EndianType> up;
        EndianType<PhysicsFrictionType> friction_type;
        PAD(0x2);
        EndianType<float> friction_parallel_scale;
        EndianType<float> friction_perpendicular_scale;
        EndianType<float> radius;
        PAD(0x14);
        ENDIAN_TEMPLATE(NewEndian) operator PhysicsMassPoint<NewEndian>() const {
            PhysicsMassPoint<NewEndian> copy = {};
            COPY_THIS(name);
            COPY_THIS(powered_mass_point);
            COPY_THIS(model_node);
            COPY_THIS(flags);
            COPY_THIS(relative_mass);
            COPY_THIS(mass);
            COPY_THIS(relative_density);
            COPY_THIS(density);
            COPY_THIS(position);
            COPY_THIS(forward);
            COPY_THIS(up);
            COPY_THIS(friction_type);
            COPY_THIS(friction_parallel_scale);
            COPY_THIS(friction_perpendicular_scale);
            COPY_THIS(radius);
            return copy;
        }
    };
    static_assert(sizeof(PhysicsMassPoint<NativeEndian>) == 0x80);

    ENDIAN_TEMPLATE(EndianType) struct Physics {
        EndianType<float> radius;
        EndianType<Fraction> moment_scale;
        EndianType<float> mass;
        Point3D<EndianType> center_of_mass;
        EndianType<float> density;
        EndianType<float> gravity_scale;
        EndianType<float> ground_friction;
        EndianType<float> ground_depth;
        EndianType<Fraction> ground_damp_fraction;
        EndianType<float> ground_normal_k1;
        EndianType<float> ground_normal_k0;
        PAD(0x4);
        EndianType<float> water_friction;
        EndianType<float> water_depth;
        EndianType<float> water_density;
        PAD(0x4);
        EndianType<Fraction> air_friction;
        PAD(0x4);
        EndianType<float> xx_moment;
        EndianType<float> yy_moment;
        EndianType<float> zz_moment;
        TagReflexive<EndianType, PhysicsInertialMatrix> inertial_matrix_and_inverse;
        TagReflexive<EndianType, PhysicsPoweredMassPoint> powered_mass_points;
        TagReflexive<EndianType, PhysicsMassPoint> mass_points;
        ENDIAN_TEMPLATE(NewEndian) operator Physics<NewEndian>() const {
            Physics<NewEndian> copy = {};
            COPY_THIS(radius);
            COPY_THIS(moment_scale);
            COPY_THIS(mass);
            COPY_THIS(center_of_mass);
            COPY_THIS(density);
            COPY_THIS(gravity_scale);
            COPY_THIS(ground_friction);
            COPY_THIS(ground_depth);
            COPY_THIS(ground_damp_fraction);
            COPY_THIS(ground_normal_k1);
            COPY_THIS(ground_normal_k0);
            COPY_THIS(water_friction);
            COPY_THIS(water_depth);
            COPY_THIS(water_density);
            COPY_THIS(air_friction);
            COPY_THIS(xx_moment);
            COPY_THIS(yy_moment);
            COPY_THIS(zz_moment);
            COPY_THIS(inertial_matrix_and_inverse);
            COPY_THIS(powered_mass_points);
            COPY_THIS(mass_points);
            return copy;
        }
    };
    static_assert(sizeof(Physics<NativeEndian>) == 0x80);

    ENDIAN_TEMPLATE(EndianType) struct Placeholder : BasicObject<EndianType> {
        ENDIAN_TEMPLATE(NewEndian) operator Placeholder<NewEndian>() const {
            Placeholder<NewEndian> copy = {};
            COPY_THIS(more_flags);
            COPY_THIS(object_type);
            COPY_THIS(flags);
            COPY_THIS(bounding_radius);
            COPY_THIS(bounding_offset);
            COPY_THIS(origin_offset);
            COPY_THIS(acceleration_scale);
            COPY_THIS(scales_change_colors);
            COPY_THIS(model);
            COPY_THIS(animation_graph);
            COPY_THIS(collision_model);
            COPY_THIS(physics);
            COPY_THIS(modifier_shader);
            COPY_THIS(creation_effect);
            COPY_THIS(render_bounding_radius);
            COPY_THIS(a_in);
            COPY_THIS(b_in);
            COPY_THIS(c_in);
            COPY_THIS(d_in);
            COPY_THIS(hud_text_message_index);
            COPY_THIS(forced_shader_permutation_index);
            COPY_THIS(attachments);
            COPY_THIS(widgets);
            COPY_THIS(functions);
            COPY_THIS(change_colors);
            COPY_THIS(predicted_resources);
            return copy;
        }
    };
    static_assert(sizeof(Placeholder<NativeEndian>) == 0x1FC);

    ENDIAN_TEMPLATE(EndianType) struct PointPhysics {
        EndianType<PointPhysicsFlags> flags;
        LittleEndian<float> unknown_constant;
        LittleEndian<float> water_gravity_scale;
        LittleEndian<float> air_gravity_scale;
        PAD(0x10);
        EndianType<float> density;
        EndianType<float> air_friction;
        EndianType<float> water_friction;
        EndianType<float> surface_friction;
        EndianType<float> elasticity;
        PAD(0xC);
        ENDIAN_TEMPLATE(NewEndian) operator PointPhysics<NewEndian>() const {
            PointPhysics<NewEndian> copy = {};
            COPY_THIS(flags);
            COPY_THIS(unknown_constant);
            COPY_THIS(water_gravity_scale);
            COPY_THIS(air_gravity_scale);
            COPY_THIS(density);
            COPY_THIS(air_friction);
            COPY_THIS(water_friction);
            COPY_THIS(surface_friction);
            COPY_THIS(elasticity);
            return copy;
        }
    };
    static_assert(sizeof(PointPhysics<NativeEndian>) == 0x40);

    ENDIAN_TEMPLATE(EndianType) struct PreferencesNetworkGame {
        TagString name;
        ColorRGB<EndianType> primary_color;
        ColorRGB<EndianType> secondary_color;
        TagDependency<EndianType> pattern;
        EndianType<Index> pattern_bitmap_index;
        PAD(0x2);
        TagDependency<EndianType> decal;
        EndianType<Index> decal_bitmap_index;
        PAD(0x2);
        PAD(0x320);
        ENDIAN_TEMPLATE(NewEndian) operator PreferencesNetworkGame<NewEndian>() const {
            PreferencesNetworkGame<NewEndian> copy = {};
            COPY_THIS(name);
            COPY_THIS(primary_color);
            COPY_THIS(secondary_color);
            COPY_THIS(pattern);
            COPY_THIS(pattern_bitmap_index);
            COPY_THIS(decal);
            COPY_THIS(decal_bitmap_index);
            return copy;
        }
    };
    static_assert(sizeof(PreferencesNetworkGame<NativeEndian>) == 0x380);

    ENDIAN_TEMPLATE(EndianType) struct ProjectileMaterialResponse {
        EndianType<ProjectileMaterialResponseFlags> flags;
        EndianType<ProjectileResponse> default_response;
        TagDependency<EndianType> default_effect;
        PAD(0x10);
        EndianType<ProjectileResponse> potential_response;
        EndianType<ProjectileMaterialResponsePotentialFlags> potential_flags;
        EndianType<Fraction> potential_skip_fraction;
        Bounds<EndianType<Angle>> potential_between;
        Bounds<EndianType<float>> potential_and;
        TagDependency<EndianType> potential_effect;
        PAD(0x10);
        EndianType<ProjectileScaleEffectsBy> scale_effects_by;
        PAD(0x2);
        EndianType<Angle> angular_noise;
        EndianType<float> velocity_noise;
        TagDependency<EndianType> detonation_effect;
        PAD(0x18);
        EndianType<float> initial_friction;
        EndianType<float> maximum_distance;
        EndianType<float> parallel_friction;
        EndianType<float> perpendicular_friction;
        ENDIAN_TEMPLATE(NewEndian) operator ProjectileMaterialResponse<NewEndian>() const {
            ProjectileMaterialResponse<NewEndian> copy = {};
            COPY_THIS(flags);
            COPY_THIS(default_response);
            COPY_THIS(default_effect);
            COPY_THIS(potential_response);
            COPY_THIS(potential_flags);
            COPY_THIS(potential_skip_fraction);
            COPY_THIS(potential_between);
            COPY_THIS(potential_and);
            COPY_THIS(potential_effect);
            COPY_THIS(scale_effects_by);
            COPY_THIS(angular_noise);
            COPY_THIS(velocity_noise);
            COPY_THIS(detonation_effect);
            COPY_THIS(initial_friction);
            COPY_THIS(maximum_distance);
            COPY_THIS(parallel_friction);
            COPY_THIS(perpendicular_friction);
            return copy;
        }
    };
    static_assert(sizeof(ProjectileMaterialResponse<NativeEndian>) == 0xA0);

    ENDIAN_TEMPLATE(EndianType) struct Projectile : Object<EndianType> {
        EndianType<ProjectileFlags> projectile_flags;
        EndianType<ProjectileDetonationTimerStarts> detonation_timer_starts;
        EndianType<ObjectNoise> impact_noise;
        EndianType<ProjectileFunctionIn> projectile_a_in;
        EndianType<ProjectileFunctionIn> projectile_b_in;
        EndianType<ProjectileFunctionIn> projectile_c_in;
        EndianType<ProjectileFunctionIn> projectile_d_in;
        TagDependency<EndianType> super_detonation;
        EndianType<float> ai_perception_radius;
        EndianType<float> collision_radius;
        EndianType<float> arming_time;
        EndianType<float> danger_radius;
        TagDependency<EndianType> effect;
        Bounds<EndianType<float>> timer;
        EndianType<float> minimum_velocity;
        EndianType<float> maximum_range;
        EndianType<float> air_gravity_scale;
        Bounds<EndianType<float>> air_damage_range;
        EndianType<float> water_gravity_scale;
        Bounds<EndianType<float>> water_damage_range;
        EndianType<float> initial_velocity;
        EndianType<float> final_velocity;
        EndianType<Angle> guided_angular_velocity;
        EndianType<ObjectNoise> detonation_noise;
        PAD(0x2);
        TagDependency<EndianType> detonation_started;
        TagDependency<EndianType> flyby_sound;
        TagDependency<EndianType> attached_detonation_damage;
        TagDependency<EndianType> impact_damage;
        PAD(0xC);
        TagReflexive<EndianType, ProjectileMaterialResponse> projectile_material_response;
        ENDIAN_TEMPLATE(NewEndian) operator Projectile<NewEndian>() const {
            Projectile<NewEndian> copy = {};
            COPY_THIS(projectile_flags);
            COPY_THIS(detonation_timer_starts);
            COPY_THIS(impact_noise);
            COPY_THIS(projectile_a_in);
            COPY_THIS(projectile_b_in);
            COPY_THIS(projectile_c_in);
            COPY_THIS(projectile_d_in);
            COPY_THIS(super_detonation);
            COPY_THIS(ai_perception_radius);
            COPY_THIS(collision_radius);
            COPY_THIS(arming_time);
            COPY_THIS(danger_radius);
            COPY_THIS(effect);
            COPY_THIS(timer);
            COPY_THIS(minimum_velocity);
            COPY_THIS(maximum_range);
            COPY_THIS(air_gravity_scale);
            COPY_THIS(air_damage_range);
            COPY_THIS(water_gravity_scale);
            COPY_THIS(water_damage_range);
            COPY_THIS(initial_velocity);
            COPY_THIS(final_velocity);
            COPY_THIS(guided_angular_velocity);
            COPY_THIS(detonation_noise);
            COPY_THIS(detonation_started);
            COPY_THIS(flyby_sound);
            COPY_THIS(attached_detonation_damage);
            COPY_THIS(impact_damage);
            COPY_THIS(projectile_material_response);
            COPY_THIS(object_type);
            COPY_THIS(flags);
            COPY_THIS(bounding_radius);
            COPY_THIS(bounding_offset);
            COPY_THIS(origin_offset);
            COPY_THIS(acceleration_scale);
            COPY_THIS(scales_change_colors);
            COPY_THIS(model);
            COPY_THIS(animation_graph);
            COPY_THIS(collision_model);
            COPY_THIS(physics);
            COPY_THIS(modifier_shader);
            COPY_THIS(creation_effect);
            COPY_THIS(render_bounding_radius);
            COPY_THIS(a_in);
            COPY_THIS(b_in);
            COPY_THIS(c_in);
            COPY_THIS(d_in);
            COPY_THIS(hud_text_message_index);
            COPY_THIS(forced_shader_permutation_index);
            COPY_THIS(attachments);
            COPY_THIS(widgets);
            COPY_THIS(functions);
            COPY_THIS(change_colors);
            COPY_THIS(predicted_resources);
            return copy;
        }
    };
    static_assert(sizeof(Projectile<NativeEndian>) == 0x24C);

    ENDIAN_TEMPLATE(EndianType) struct ScenarioSky {
        TagDependency<EndianType> sky;
        ENDIAN_TEMPLATE(NewEndian) operator ScenarioSky<NewEndian>() const {
            ScenarioSky<NewEndian> copy;
            COPY_THIS(sky);
            return copy;
        }
    };
    static_assert(sizeof(ScenarioSky<NativeEndian>) == 0x10);

    ENDIAN_TEMPLATE(EndianType) struct ScenarioChildScenario {
        TagDependency<EndianType> child_scenario;
        PAD(0x10);
        ENDIAN_TEMPLATE(NewEndian) operator ScenarioChildScenario<NewEndian>() const {
            ScenarioChildScenario<NewEndian> copy = {};
            COPY_THIS(child_scenario);
            return copy;
        }
    };
    static_assert(sizeof(ScenarioChildScenario<NativeEndian>) == 0x20);

    ENDIAN_TEMPLATE(EndianType) struct ScenarioFunction {
        EndianType<ScenarioFunctionFlags> flags;
        TagString name;
        EndianType<float> period;
        EndianType<Index> scale_period_by;
        EndianType<WaveFunction> function;
        EndianType<Index> scale_function_by;
        EndianType<WaveFunction> wobble_function;
        EndianType<float> wobble_period;
        EndianType<float> wobble_magnitude;
        EndianType<Fraction> square_wave_threshold;
        EndianType<std::int16_t> step_count;
        EndianType<FunctionType> map_to;
        EndianType<std::int16_t> sawtooth_count;
        PAD(0x2);
        EndianType<Index> scale_result_by;
        EndianType<FunctionBoundsMode> bounds_mode;
        Bounds<EndianType<float>> bounds;
        PAD(0x4);
        PAD(0x2);
        EndianType<Index> turn_off_with;
        PAD(0x10);
        PAD(0x10);
        ENDIAN_TEMPLATE(NewEndian) operator ScenarioFunction<NewEndian>() const {
            ScenarioFunction<NewEndian> copy = {};
            COPY_THIS(flags);
            COPY_THIS(name);
            COPY_THIS(period);
            COPY_THIS(scale_period_by);
            COPY_THIS(function);
            COPY_THIS(scale_function_by);
            COPY_THIS(wobble_function);
            COPY_THIS(wobble_period);
            COPY_THIS(wobble_magnitude);
            COPY_THIS(square_wave_threshold);
            COPY_THIS(step_count);
            COPY_THIS(map_to);
            COPY_THIS(sawtooth_count);
            COPY_THIS(scale_result_by);
            COPY_THIS(bounds_mode);
            COPY_THIS(bounds);
            COPY_THIS(turn_off_with);
            return copy;
        }
    };
    static_assert(sizeof(ScenarioFunction<NativeEndian>) == 0x78);

    ENDIAN_TEMPLATE(EndianType) struct ScenarioEditorComment {
        Point3D<EndianType> position;
        PAD(0x10);
        TagDataOffset<EndianType> comment;
        ENDIAN_TEMPLATE(NewEndian) operator ScenarioEditorComment<NewEndian>() const {
            ScenarioEditorComment<NewEndian> copy = {};
            COPY_THIS(position);
            COPY_THIS(comment);
            return copy;
        }
    };
    static_assert(sizeof(ScenarioEditorComment<NativeEndian>) == 0x30);

    ENDIAN_TEMPLATE(EndianType) struct ScenarioScavengerHuntObjects {
        TagString name;
        EndianType<Index> object_name_index;
        PAD(0x2);
        ENDIAN_TEMPLATE(NewEndian) operator ScenarioScavengerHuntObjects<NewEndian>() const {
            ScenarioScavengerHuntObjects<NewEndian> copy = {};
            COPY_THIS(name);
            COPY_THIS(object_name_index);
            return copy;
        }
    };
    static_assert(sizeof(ScenarioScavengerHuntObjects<NativeEndian>) == 0x24);

    ENDIAN_TEMPLATE(EndianType) struct ScenarioObjectName {
        TagString name;
        LittleEndian<ObjectType> object_type;
        LittleEndian<Index> object_index;
        ENDIAN_TEMPLATE(NewEndian) operator ScenarioObjectName<NewEndian>() const {
            ScenarioObjectName<NewEndian> copy;
            COPY_THIS(name);
            COPY_THIS(object_type);
            COPY_THIS(object_index);
            return copy;
        }
    };
    static_assert(sizeof(ScenarioObjectName<NativeEndian>) == 0x24);

    ENDIAN_TEMPLATE(EndianType) struct ScenarioScenery {
        EndianType<Index> type;
        EndianType<Index> name;
        EndianType<ScenarioSpawnNotPlaced> not_placed;
        EndianType<std::int16_t> desired_permutation;
        Point3D<EndianType> position;
        Euler3D<EndianType> rotation;
        EndianType<std::uint16_t> bsp_indices;
        PAD(0x2);
        EndianType<std::int8_t> appearance_player_index;
        PAD(0x3);
        PAD(0x10);
        PAD(0x8);
        PAD(0x8);
        ENDIAN_TEMPLATE(NewEndian) operator ScenarioScenery<NewEndian>() const {
            ScenarioScenery<NewEndian> copy = {};
            COPY_THIS(type);
            COPY_THIS(name);
            COPY_THIS(not_placed);
            COPY_THIS(desired_permutation);
            COPY_THIS(position);
            COPY_THIS(rotation);
            COPY_THIS(bsp_indices);
            COPY_THIS(appearance_player_index);
            return copy;
        }
    };
    static_assert(sizeof(ScenarioScenery<NativeEndian>) == 0x48);

    ENDIAN_TEMPLATE(EndianType) struct ScenarioSceneryPalette {
        TagDependency<EndianType> name;
        PAD(0x20);
        ENDIAN_TEMPLATE(NewEndian) operator ScenarioSceneryPalette<NewEndian>() const {
            ScenarioSceneryPalette<NewEndian> copy = {};
            COPY_THIS(name);
            return copy;
        }
    };
    static_assert(sizeof(ScenarioSceneryPalette<NativeEndian>) == 0x30);

    ENDIAN_TEMPLATE(EndianType) struct ScenarioBiped {
        EndianType<Index> type;
        EndianType<Index> name;
        EndianType<ScenarioSpawnNotPlaced> not_placed;
        EndianType<std::int16_t> desired_permutation;
        Point3D<EndianType> position;
        Euler3D<EndianType> rotation;
        PAD(0x4);
        EndianType<std::int8_t> appearance_player_index;
        PAD(0x3);
        PAD(0x10);
        PAD(0x8);
        PAD(0x8);
        EndianType<float> body_vitality_modifier;
        EndianType<ScenarioUnitFlags> flags;
        PAD(0x8);
        PAD(0x20);
        ENDIAN_TEMPLATE(NewEndian) operator ScenarioBiped<NewEndian>() const {
            ScenarioBiped<NewEndian> copy = {};
            COPY_THIS(type);
            COPY_THIS(name);
            COPY_THIS(not_placed);
            COPY_THIS(desired_permutation);
            COPY_THIS(position);
            COPY_THIS(rotation);
            COPY_THIS(appearance_player_index);
            COPY_THIS(body_vitality_modifier);
            COPY_THIS(flags);
            return copy;
        }
    };
    static_assert(sizeof(ScenarioBiped<NativeEndian>) == 0x78);

    ENDIAN_TEMPLATE(EndianType) struct ScenarioBipedPalette {
        TagDependency<EndianType> name;
        PAD(0x20);
        ENDIAN_TEMPLATE(NewEndian) operator ScenarioBipedPalette<NewEndian>() const {
            ScenarioBipedPalette<NewEndian> copy = {};
            COPY_THIS(name);
            return copy;
        }
    };
    static_assert(sizeof(ScenarioBipedPalette<NativeEndian>) == 0x30);

    ENDIAN_TEMPLATE(EndianType) struct ScenarioVehicle {
        EndianType<Index> type;
        EndianType<Index> name;
        EndianType<ScenarioSpawnNotPlaced> not_placed;
        EndianType<std::int16_t> desired_permutation;
        Point3D<EndianType> position;
        Euler3D<EndianType> rotation;
        PAD(0x4);
        EndianType<std::int8_t> appearance_player_index;
        PAD(0x3);
        PAD(0x10);
        PAD(0x8);
        PAD(0x8);
        EndianType<float> body_vitality;
        EndianType<ScenarioUnitFlags> flags;
        PAD(0x8);
        std::int8_t multiplayer_team_index;
        PAD(0x1);
        EndianType<ScenarioVehicleMultiplayerSpawnFlags> multiplayer_spawn_flags;
        PAD(0x1C);
        ENDIAN_TEMPLATE(NewEndian) operator ScenarioVehicle<NewEndian>() const {
            ScenarioVehicle<NewEndian> copy = {};
            COPY_THIS(type);
            COPY_THIS(name);
            COPY_THIS(not_placed);
            COPY_THIS(desired_permutation);
